apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
/****************************************************************************
 * arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_IOMUXC_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_IOMUXC_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "hardware/imxrt_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* General Purpose Register Offsets *****************************************/

/* IOMUXC GPR Register Offsets (from IMXRT_IOMUXCGPR_BASE) */

#define IMXRT_IOMUXC_GPR_GPR0_OFFSET             (0x0000)  /* GPR0 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR1_OFFSET             (0x0004)  /* GPR1 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR2_OFFSET             (0x0008)  /* GPR2 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR3_OFFSET             (0x000c)  /* GPR3 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR4_OFFSET             (0x0010)  /* GPR4 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR5_OFFSET             (0x0014)  /* GPR5 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR6_OFFSET             (0x0018)  /* GPR6 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR7_OFFSET             (0x001c)  /* GPR7 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR8_OFFSET             (0x0020)  /* GPR8 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR9_OFFSET             (0x0024)  /* GPR9 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR10_OFFSET            (0x0028)  /* GPR10 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR11_OFFSET            (0x002c)  /* GPR11 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR12_OFFSET            (0x0030)  /* GPR12 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR13_OFFSET            (0x0034)  /* GPR13 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR14_OFFSET            (0x0038)  /* GPR14 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR15_OFFSET            (0x003c)  /* GPR15 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR16_OFFSET            (0x0040)  /* GPR16 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR17_OFFSET            (0x0044)  /* GPR17 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR18_OFFSET            (0x0048)  /* GPR18 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR20_OFFSET            (0x0050)  /* GPR20 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR21_OFFSET            (0x0054)  /* GPR21 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR22_OFFSET            (0x0058)  /* GPR22 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR23_OFFSET            (0x005c)  /* GPR23 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR24_OFFSET            (0x0060)  /* GPR24 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR25_OFFSET            (0x0064)  /* GPR25 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR26_OFFSET            (0x0068)  /* GPR26 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR27_OFFSET            (0x006c)  /* GPR27 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR28_OFFSET            (0x0070)  /* GPR28 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR29_OFFSET            (0x0074)  /* GPR29 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR30_OFFSET            (0x0078)  /* GPR30 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR31_OFFSET            (0x007c)  /* GPR31 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR32_OFFSET            (0x0080)  /* GPR32 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR33_OFFSET            (0x0084)  /* GPR33 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR34_OFFSET            (0x0088)  /* GPR34 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR35_OFFSET            (0x008c)  /* GPR35 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR36_OFFSET            (0x0090)  /* GPR36 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR37_OFFSET            (0x0094)  /* GPR37 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR38_OFFSET            (0x0098)  /* GPR38 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR39_OFFSET            (0x009c)  /* GPR39 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR40_OFFSET            (0x00a0)  /* GPR40 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR41_OFFSET            (0x00a4)  /* GPR41 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR42_OFFSET            (0x00a8)  /* GPR42 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR43_OFFSET            (0x00ac)  /* GPR43 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR44_OFFSET            (0x00b0)  /* GPR44 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR45_OFFSET            (0x00b4)  /* GPR45 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR46_OFFSET            (0x00b8)  /* GPR46 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR47_OFFSET            (0x00bc)  /* GPR47 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR48_OFFSET            (0x00c0)  /* GPR48 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR49_OFFSET            (0x00c4)  /* GPR49 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR50_OFFSET            (0x00c8)  /* GPR50 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR51_OFFSET            (0x00cc)  /* GPR51 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR52_OFFSET            (0x00d0)  /* GPR52 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR53_OFFSET            (0x00d4)  /* GPR53 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR54_OFFSET            (0x00d8)  /* GPR54 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR55_OFFSET            (0x00dc)  /* GPR55 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR59_OFFSET            (0x00ec)  /* GPR59 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR62_OFFSET            (0x00f8)  /* GPR62 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR63_OFFSET            (0x00fc)  /* GPR63 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR64_OFFSET            (0x0100)  /* GPR64 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR65_OFFSET            (0x0104)  /* GPR65 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR66_OFFSET            (0x0108)  /* GPR66 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR67_OFFSET            (0x010c)  /* GPR67 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR68_OFFSET            (0x0110)  /* GPR68 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR69_OFFSET            (0x0114)  /* GPR69 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR70_OFFSET            (0x0118)  /* GPR70 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR71_OFFSET            (0x011c)  /* GPR71 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR72_OFFSET            (0x0120)  /* GPR72 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR73_OFFSET            (0x0124)  /* GPR73 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR74_OFFSET            (0x0128)  /* GPR74 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR75_OFFSET            (0x012c)  /* GPR75 General Purpose Register */
#define IMXRT_IOMUXC_GPR_GPR76_OFFSET            (0x0130)  /* GPR76 General Purpose Register */

/* IOMUXC LPSR GPR Register Offsets (from IMXRT_IOMUXCLPSRGPR_BASE) */

