apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define IMXRT_IOMUXC_LPSR_GPR_GPR26_OFFSET       (0x0068)  /* GPR26 General Purpose Register */
#define IMXRT_IOMUXC_LPSR_GPR_GPR33_OFFSET       (0x0084)  /* GPR33 General Purpose Register */
#define IMXRT_IOMUXC_LPSR_GPR_GPR34_OFFSET       (0x0088)  /* GPR34 General Purpose Register */
#define IMXRT_IOMUXC_LPSR_GPR_GPR35_OFFSET       (0x008c)  /* GPR35 General Purpose Register */
#define IMXRT_IOMUXC_LPSR_GPR_GPR36_OFFSET       (0x0090)  /* GPR36 General Purpose Register */
#define IMXRT_IOMUXC_LPSR_GPR_GPR37_OFFSET       (0x0094)  /* GPR37 General Purpose Register */
#define IMXRT_IOMUXC_LPSR_GPR_GPR38_OFFSET       (0x0098)  /* GPR38 General Purpose Register */
#define IMXRT_IOMUXC_LPSR_GPR_GPR39_OFFSET       (0x009c)  /* GPR39 General Purpose Register */
#define IMXRT_IOMUXC_LPSR_GPR_GPR40_OFFSET       (0x00a0)  /* GPR40 General Purpose Register */
#define IMXRT_IOMUXC_LPSR_GPR_GPR41_OFFSET       (0x00a4)  /* GPR41 General Purpose Register */

/* Pad Mux Register Indices & Offsets****************************************/

/* Pad Mux Register Indices (used by software for table lookups) */

#define IMXRT_PADMUX_GPIO_EMC_B1_00_INDEX        (  0)
#define IMXRT_PADMUX_GPIO_EMC_B1_01_INDEX        (  1)
#define IMXRT_PADMUX_GPIO_EMC_B1_02_INDEX        (  2)
#define IMXRT_PADMUX_GPIO_EMC_B1_03_INDEX        (  3)
#define IMXRT_PADMUX_GPIO_EMC_B1_04_INDEX        (  4)
#define IMXRT_PADMUX_GPIO_EMC_B1_05_INDEX        (  5)
#define IMXRT_PADMUX_GPIO_EMC_B1_06_INDEX        (  6)
#define IMXRT_PADMUX_GPIO_EMC_B1_07_INDEX        (  7)
#define IMXRT_PADMUX_GPIO_EMC_B1_08_INDEX        (  8)
#define IMXRT_PADMUX_GPIO_EMC_B1_09_INDEX        (  9)
#define IMXRT_PADMUX_GPIO_EMC_B1_10_INDEX        ( 10)
#define IMXRT_PADMUX_GPIO_EMC_B1_11_INDEX        ( 11)
#define IMXRT_PADMUX_GPIO_EMC_B1_12_INDEX        ( 12)
#define IMXRT_PADMUX_GPIO_EMC_B1_13_INDEX        ( 13)
#define IMXRT_PADMUX_GPIO_EMC_B1_14_INDEX        ( 14)
#define IMXRT_PADMUX_GPIO_EMC_B1_15_INDEX        ( 15)
#define IMXRT_PADMUX_GPIO_EMC_B1_16_INDEX        ( 16)
#define IMXRT_PADMUX_GPIO_EMC_B1_17_INDEX        ( 17)
#define IMXRT_PADMUX_GPIO_EMC_B1_18_INDEX        ( 18)
#define IMXRT_PADMUX_GPIO_EMC_B1_19_INDEX        ( 19)
#define IMXRT_PADMUX_GPIO_EMC_B1_20_INDEX        ( 20)
#define IMXRT_PADMUX_GPIO_EMC_B1_21_INDEX        ( 21)
#define IMXRT_PADMUX_GPIO_EMC_B1_22_INDEX        ( 22)
#define IMXRT_PADMUX_GPIO_EMC_B1_23_INDEX        ( 23)
#define IMXRT_PADMUX_GPIO_EMC_B1_24_INDEX        ( 24)
#define IMXRT_PADMUX_GPIO_EMC_B1_25_INDEX        ( 25)
#define IMXRT_PADMUX_GPIO_EMC_B1_26_INDEX        ( 26)
#define IMXRT_PADMUX_GPIO_EMC_B1_27_INDEX        ( 27)
#define IMXRT_PADMUX_GPIO_EMC_B1_28_INDEX        ( 28)
#define IMXRT_PADMUX_GPIO_EMC_B1_29_INDEX        ( 29)
#define IMXRT_PADMUX_GPIO_EMC_B1_30_INDEX        ( 30)
#define IMXRT_PADMUX_GPIO_EMC_B1_31_INDEX        ( 31)
#define IMXRT_PADMUX_GPIO_EMC_B1_32_INDEX        ( 32)
#define IMXRT_PADMUX_GPIO_EMC_B1_33_INDEX        ( 33)
#define IMXRT_PADMUX_GPIO_EMC_B1_34_INDEX        ( 34)
#define IMXRT_PADMUX_GPIO_EMC_B1_35_INDEX        ( 35)
#define IMXRT_PADMUX_GPIO_EMC_B1_36_INDEX        ( 36)
#define IMXRT_PADMUX_GPIO_EMC_B1_37_INDEX        ( 37)
#define IMXRT_PADMUX_GPIO_EMC_B1_38_INDEX        ( 38)
#define IMXRT_PADMUX_GPIO_EMC_B1_39_INDEX        ( 39)
#define IMXRT_PADMUX_GPIO_EMC_B1_40_INDEX        ( 40)
#define IMXRT_PADMUX_GPIO_EMC_B1_41_INDEX        ( 41)
#define IMXRT_PADMUX_GPIO_EMC_B2_00_INDEX        ( 42)
#define IMXRT_PADMUX_GPIO_EMC_B2_01_INDEX        ( 43)
#define IMXRT_PADMUX_GPIO_EMC_B2_02_INDEX        ( 44)
#define IMXRT_PADMUX_GPIO_EMC_B2_03_INDEX        ( 45)
#define IMXRT_PADMUX_GPIO_EMC_B2_04_INDEX        ( 46)
#define IMXRT_PADMUX_GPIO_EMC_B2_05_INDEX        ( 47)
#define IMXRT_PADMUX_GPIO_EMC_B2_06_INDEX        ( 48)
#define IMXRT_PADMUX_GPIO_EMC_B2_07_INDEX        ( 49)
#define IMXRT_PADMUX_GPIO_EMC_B2_08_INDEX        ( 50)
#define IMXRT_PADMUX_GPIO_EMC_B2_09_INDEX        ( 51)
#define IMXRT_PADMUX_GPIO_EMC_B2_10_INDEX        ( 52)
#define IMXRT_PADMUX_GPIO_EMC_B2_11_INDEX        ( 53)
#define IMXRT_PADMUX_GPIO_EMC_B2_12_INDEX        ( 54)
#define IMXRT_PADMUX_GPIO_EMC_B2_13_INDEX        ( 55)
#define IMXRT_PADMUX_GPIO_EMC_B2_14_INDEX        ( 56)
#define IMXRT_PADMUX_GPIO_EMC_B2_15_INDEX        ( 57)
#define IMXRT_PADMUX_GPIO_EMC_B2_16_INDEX        ( 58)
#define IMXRT_PADMUX_GPIO_EMC_B2_17_INDEX        ( 59)
#define IMXRT_PADMUX_GPIO_EMC_B2_18_INDEX        ( 60)
#define IMXRT_PADMUX_GPIO_EMC_B2_19_INDEX        ( 61)
#define IMXRT_PADMUX_GPIO_EMC_B2_20_INDEX        ( 62)
#define IMXRT_PADMUX_GPIO_AD_00_INDEX            ( 63)
#define IMXRT_PADMUX_GPIO_AD_01_INDEX            ( 64)
#define IMXRT_PADMUX_GPIO_AD_02_INDEX            ( 65)
#define IMXRT_PADMUX_GPIO_AD_03_INDEX            ( 66)
#define IMXRT_PADMUX_GPIO_AD_04_INDEX            ( 67)
#define IMXRT_PADMUX_GPIO_AD_05_INDEX            ( 68)
#define IMXRT_PADMUX_GPIO_AD_06_INDEX            ( 69)
#define IMXRT_PADMUX_GPIO_AD_07_INDEX            ( 70)
#define IMXRT_PADMUX_GPIO_AD_08_INDEX            ( 71)
#define IMXRT_PADMUX_GPIO_AD_09_INDEX            ( 72)
#define IMXRT_PADMUX_GPIO_AD_10_INDEX            ( 73)
#define IMXRT_PADMUX_GPIO_AD_11_INDEX            ( 74)
#define IMXRT_PADMUX_GPIO_AD_12_INDEX            ( 75)
#define IMXRT_PADMUX_GPIO_AD_13_INDEX            ( 76)
#define IMXRT_PADMUX_GPIO_AD_14_INDEX            ( 77)
#define IMXRT_PADMUX_GPIO_AD_15_INDEX            ( 78)
#define IMXRT_PADMUX_GPIO_AD_16_INDEX            ( 79)
#define IMXRT_PADMUX_GPIO_AD_17_INDEX            ( 80)
#define IMXRT_PADMUX_GPIO_AD_18_INDEX            ( 81)
#define IMXRT_PADMUX_GPIO_AD_19_INDEX            ( 82)
#define IMXRT_PADMUX_GPIO_AD_20_INDEX            ( 83)
#define IMXRT_PADMUX_GPIO_AD_21_INDEX            ( 84)
#define IMXRT_PADMUX_GPIO_AD_22_INDEX            ( 85)
#define IMXRT_PADMUX_GPIO_AD_23_INDEX            ( 86)
#define IMXRT_PADMUX_GPIO_AD_24_INDEX            ( 87)
#define IMXRT_PADMUX_GPIO_AD_25_INDEX            ( 88)
#define IMXRT_PADMUX_GPIO_AD_26_INDEX            ( 89)
#define IMXRT_PADMUX_GPIO_AD_27_INDEX            ( 90)
#define IMXRT_PADMUX_GPIO_AD_28_INDEX            ( 91)
#define IMXRT_PADMUX_GPIO_AD_29_INDEX            ( 92)
#define IMXRT_PADMUX_GPIO_AD_30_INDEX            ( 93)
#define IMXRT_PADMUX_GPIO_AD_31_INDEX            ( 94)
#define IMXRT_PADMUX_GPIO_AD_32_INDEX            ( 95)
#define IMXRT_PADMUX_GPIO_AD_33_INDEX            ( 96)
#define IMXRT_PADMUX_GPIO_AD_34_INDEX            ( 97)
#define IMXRT_PADMUX_GPIO_AD_35_INDEX            ( 98)
#define IMXRT_PADMUX_GPIO_SD_B1_00_INDEX         ( 99)
#define IMXRT_PADMUX_GPIO_SD_B1_01_INDEX         (100)
#define IMXRT_PADMUX_GPIO_SD_B1_02_INDEX         (101)
#define IMXRT_PADMUX_GPIO_SD_B1_03_INDEX         (102)
#define IMXRT_PADMUX_GPIO_SD_B1_04_INDEX         (103)
#define IMXRT_PADMUX_GPIO_SD_B1_05_INDEX         (104)
#define IMXRT_PADMUX_GPIO_SD_B2_00_INDEX         (105)
#define IMXRT_PADMUX_GPIO_SD_B2_01_INDEX         (106)
#define IMXRT_PADMUX_GPIO_SD_B2_02_INDEX         (107)
#define IMXRT_PADMUX_GPIO_SD_B2_03_INDEX         (108)
#define IMXRT_PADMUX_GPIO_SD_B2_04_INDEX         (109)
#define IMXRT_PADMUX_GPIO_SD_B2_05_INDEX         (110)
#define IMXRT_PADMUX_GPIO_SD_B2_06_INDEX         (111)
#define IMXRT_PADMUX_GPIO_SD_B2_07_INDEX         (112)
#define IMXRT_PADMUX_GPIO_SD_B2_08_INDEX         (113)
#define IMXRT_PADMUX_GPIO_SD_B2_09_INDEX         (114)
#define IMXRT_PADMUX_GPIO_SD_B2_10_INDEX         (115)
#define IMXRT_PADMUX_GPIO_SD_B2_11_INDEX         (116)
#define IMXRT_PADMUX_GPIO_DISP_B1_00_INDEX       (117)
#define IMXRT_PADMUX_GPIO_DISP_B1_01_INDEX       (118)
#define IMXRT_PADMUX_GPIO_DISP_B1_02_INDEX       (119)
#define IMXRT_PADMUX_GPIO_DISP_B1_03_INDEX       (120)
#define IMXRT_PADMUX_GPIO_DISP_B1_04_INDEX       (121)
#define IMXRT_PADMUX_GPIO_DISP_B1_05_INDEX       (122)
#define IMXRT_PADMUX_GPIO_DISP_B1_06_INDEX       (123)
#define IMXRT_PADMUX_GPIO_DISP_B1_07_INDEX       (124)
#define IMXRT_PADMUX_GPIO_DISP_B1_08_INDEX       (125)
#define IMXRT_PADMUX_GPIO_DISP_B1_09_INDEX       (126)
#define IMXRT_PADMUX_GPIO_DISP_B1_10_INDEX       (127)
#define IMXRT_PADMUX_GPIO_DISP_B1_11_INDEX       (128)
#define IMXRT_PADMUX_GPIO_DISP_B2_00_INDEX       (129)
#define IMXRT_PADMUX_GPIO_DISP_B2_01_INDEX       (130)
#define IMXRT_PADMUX_GPIO_DISP_B2_02_INDEX       (131)
#define IMXRT_PADMUX_GPIO_DISP_B2_03_INDEX       (132)
#define IMXRT_PADMUX_GPIO_DISP_B2_04_INDEX       (133)
#define IMXRT_PADMUX_GPIO_DISP_B2_05_INDEX       (134)
#define IMXRT_PADMUX_GPIO_DISP_B2_06_INDEX       (135)
#define IMXRT_PADMUX_GPIO_DISP_B2_07_INDEX       (136)
#define IMXRT_PADMUX_GPIO_DISP_B2_08_INDEX       (137)
#define IMXRT_PADMUX_GPIO_DISP_B2_09_INDEX       (138)
#define IMXRT_PADMUX_GPIO_DISP_B2_10_INDEX       (139)
#define IMXRT_PADMUX_GPIO_DISP_B2_11_INDEX       (140)
#define IMXRT_PADMUX_GPIO_DISP_B2_12_INDEX       (141)
#define IMXRT_PADMUX_GPIO_DISP_B2_13_INDEX       (142)
#define IMXRT_PADMUX_GPIO_DISP_B2_14_INDEX       (143)
#define IMXRT_PADMUX_GPIO_DISP_B2_15_INDEX       (144)

#define IMXRT_PADMUX_WAKEUP_INDEX                (145)
#define IMXRT_PADMUX_PMIC_ON_REQ_INDEX           (146)
#define IMXRT_PADMUX_PMIC_STBY_REQ_INDEX         (147)
#define IMXRT_PADMUX_GPIO_SNVS_00_INDEX          (148)
#define IMXRT_PADMUX_GPIO_SNVS_01_INDEX          (149)
#define IMXRT_PADMUX_GPIO_SNVS_02_INDEX          (150)
#define IMXRT_PADMUX_GPIO_SNVS_03_INDEX          (151)
#define IMXRT_PADMUX_GPIO_SNVS_04_INDEX          (152)
#define IMXRT_PADMUX_GPIO_SNVS_05_INDEX          (153)
#define IMXRT_PADMUX_GPIO_SNVS_06_INDEX          (154)
#define IMXRT_PADMUX_GPIO_SNVS_07_INDEX          (155)
#define IMXRT_PADMUX_GPIO_SNVS_08_INDEX          (156)
#define IMXRT_PADMUX_GPIO_SNVS_09_INDEX          (157)

#define IMXRT_PADMUX_GPIO_LPSR_00_INDEX          (158)
#define IMXRT_PADMUX_GPIO_LPSR_01_INDEX          (159)
#define IMXRT_PADMUX_GPIO_LPSR_02_INDEX          (160)
#define IMXRT_PADMUX_GPIO_LPSR_03_INDEX          (161)
#define IMXRT_PADMUX_GPIO_LPSR_04_INDEX          (162)
#define IMXRT_PADMUX_GPIO_LPSR_05_INDEX          (163)
#define IMXRT_PADMUX_GPIO_LPSR_06_INDEX          (164)
#define IMXRT_PADMUX_GPIO_LPSR_07_INDEX          (165)
#define IMXRT_PADMUX_GPIO_LPSR_08_INDEX          (166)
#define IMXRT_PADMUX_GPIO_LPSR_09_INDEX          (167)
#define IMXRT_PADMUX_GPIO_LPSR_10_INDEX          (168)
#define IMXRT_PADMUX_GPIO_LPSR_11_INDEX          (169)
#define IMXRT_PADMUX_GPIO_LPSR_12_INDEX          (170)
#define IMXRT_PADMUX_GPIO_LPSR_13_INDEX          (171)
#define IMXRT_PADMUX_GPIO_LPSR_14_INDEX          (172)
#define IMXRT_PADMUX_GPIO_LPSR_15_INDEX          (173)

#define IMXRT_PADMUX_NREGISTERS                  (174)

/* IOMUXC Pad Mux Register Offsets (from IMXRT_IOMUXC_BASE) */

#define IMXRT_PADMUX_OFFSET(n)                   (0x0010 + ((unsigned int)(n) << 2))

#define IMXRT_PADMUX_GPIO_EMC_B1_00_OFFSET       (0x0010)
#define IMXRT_PADMUX_GPIO_EMC_B1_01_OFFSET       (0x0014)
#define IMXRT_PADMUX_GPIO_EMC_B1_02_OFFSET       (0x0018)
#define IMXRT_PADMUX_GPIO_EMC_B1_03_OFFSET       (0x001c)
#define IMXRT_PADMUX_GPIO_EMC_B1_04_OFFSET       (0x0020)
#define IMXRT_PADMUX_GPIO_EMC_B1_05_OFFSET       (0x0024)
#define IMXRT_PADMUX_GPIO_EMC_B1_06_OFFSET       (0x0028)
#define IMXRT_PADMUX_GPIO_EMC_B1_07_OFFSET       (0x002c)
#define IMXRT_PADMUX_GPIO_EMC_B1_08_OFFSET       (0x0030)
#define IMXRT_PADMUX_GPIO_EMC_B1_09_OFFSET       (0x0034)
#define IMXRT_PADMUX_GPIO_EMC_B1_10_OFFSET       (0x0038)
#define IMXRT_PADMUX_GPIO_EMC_B1_11_OFFSET       (0x003c)
#define IMXRT_PADMUX_GPIO_EMC_B1_12_OFFSET       (0x0040)
#define IMXRT_PADMUX_GPIO_EMC_B1_13_OFFSET       (0x0044)
#define IMXRT_PADMUX_GPIO_EMC_B1_14_OFFSET       (0x0048)
#define IMXRT_PADMUX_GPIO_EMC_B1_15_OFFSET       (0x004c)
#define IMXRT_PADMUX_GPIO_EMC_B1_16_OFFSET       (0x0050)
#define IMXRT_PADMUX_GPIO_EMC_B1_17_OFFSET       (0x0054)
#define IMXRT_PADMUX_GPIO_EMC_B1_18_OFFSET       (0x0058)
#define IMXRT_PADMUX_GPIO_EMC_B1_19_OFFSET       (0x005c)
#define IMXRT_PADMUX_GPIO_EMC_B1_20_OFFSET       (0x0060)
#define IMXRT_PADMUX_GPIO_EMC_B1_21_OFFSET       (0x0064)
#define IMXRT_PADMUX_GPIO_EMC_B1_22_OFFSET       (0x0068)
#define IMXRT_PADMUX_GPIO_EMC_B1_23_OFFSET       (0x006c)
#define IMXRT_PADMUX_GPIO_EMC_B1_24_OFFSET       (0x0070)
#define IMXRT_PADMUX_GPIO_EMC_B1_25_OFFSET       (0x0074)
#define IMXRT_PADMUX_GPIO_EMC_B1_26_OFFSET       (0x0078)
#define IMXRT_PADMUX_GPIO_EMC_B1_27_OFFSET       (0x007c)
#define IMXRT_PADMUX_GPIO_EMC_B1_28_OFFSET       (0x0080)
#define IMXRT_PADMUX_GPIO_EMC_B1_29_OFFSET       (0x0084)
#define IMXRT_PADMUX_GPIO_EMC_B1_30_OFFSET       (0x0088)
#define IMXRT_PADMUX_GPIO_EMC_B1_31_OFFSET       (0x008c)
#define IMXRT_PADMUX_GPIO_EMC_B1_32_OFFSET       (0x0090)
#define IMXRT_PADMUX_GPIO_EMC_B1_33_OFFSET       (0x0094)
#define IMXRT_PADMUX_GPIO_EMC_B1_34_OFFSET       (0x0098)
#define IMXRT_PADMUX_GPIO_EMC_B1_35_OFFSET       (0x009c)
#define IMXRT_PADMUX_GPIO_EMC_B1_36_OFFSET       (0x00a0)
#define IMXRT_PADMUX_GPIO_EMC_B1_37_OFFSET       (0x00a4)
#define IMXRT_PADMUX_GPIO_EMC_B1_38_OFFSET       (0x00a8)
#define IMXRT_PADMUX_GPIO_EMC_B1_39_OFFSET       (0x00ac)
#define IMXRT_PADMUX_GPIO_EMC_B1_40_OFFSET       (0x00b0)
#define IMXRT_PADMUX_GPIO_EMC_B1_41_OFFSET       (0x00b4)
#define IMXRT_PADMUX_GPIO_EMC_B2_00_OFFSET       (0x00b8)
#define IMXRT_PADMUX_GPIO_EMC_B2_01_OFFSET       (0x00bc)
#define IMXRT_PADMUX_GPIO_EMC_B2_02_OFFSET       (0x00c0)
#define IMXRT_PADMUX_GPIO_EMC_B2_03_OFFSET       (0x00c4)
#define IMXRT_PADMUX_GPIO_EMC_B2_04_OFFSET       (0x00c8)
#define IMXRT_PADMUX_GPIO_EMC_B2_05_OFFSET       (0x00cc)
#define IMXRT_PADMUX_GPIO_EMC_B2_06_OFFSET       (0x00d0)
#define IMXRT_PADMUX_GPIO_EMC_B2_07_OFFSET       (0x00d4)
#define IMXRT_PADMUX_GPIO_EMC_B2_08_OFFSET       (0x00d8)
#define IMXRT_PADMUX_GPIO_EMC_B2_09_OFFSET       (0x00dc)
#define IMXRT_PADMUX_GPIO_EMC_B2_10_OFFSET       (0x00e0)
#define IMXRT_PADMUX_GPIO_EMC_B2_11_OFFSET       (0x00e4)
#define IMXRT_PADMUX_GPIO_EMC_B2_12_OFFSET       (0x00e8)
#define IMXRT_PADMUX_GPIO_EMC_B2_13_OFFSET       (0x00ec)
#define IMXRT_PADMUX_GPIO_EMC_B2_14_OFFSET       (0x00f0)
#define IMXRT_PADMUX_GPIO_EMC_B2_15_OFFSET       (0x00f4)
#define IMXRT_PADMUX_GPIO_EMC_B2_16_OFFSET       (0x00f8)
#define IMXRT_PADMUX_GPIO_EMC_B2_17_OFFSET       (0x00fc)
#define IMXRT_PADMUX_GPIO_EMC_B2_18_OFFSET       (0x0100)
#define IMXRT_PADMUX_GPIO_EMC_B2_19_OFFSET       (0x0104)
#define IMXRT_PADMUX_GPIO_EMC_B2_20_OFFSET       (0x0108)
#define IMXRT_PADMUX_GPIO_AD_00_OFFSET           (0x010c)
#define IMXRT_PADMUX_GPIO_AD_01_OFFSET           (0x0110)
#define IMXRT_PADMUX_GPIO_AD_02_OFFSET           (0x0114)
#define IMXRT_PADMUX_GPIO_AD_03_OFFSET           (0x0118)
#define IMXRT_PADMUX_GPIO_AD_04_OFFSET           (0x011c)
#define IMXRT_PADMUX_GPIO_AD_05_OFFSET           (0x0120)
#define IMXRT_PADMUX_GPIO_AD_06_OFFSET           (0x0124)
#define IMXRT_PADMUX_GPIO_AD_07_OFFSET           (0x0128)
#define IMXRT_PADMUX_GPIO_AD_08_OFFSET           (0x012c)
#define IMXRT_PADMUX_GPIO_AD_09_OFFSET           (0x0130)
#define IMXRT_PADMUX_GPIO_AD_10_OFFSET           (0x0134)
#define IMXRT_PADMUX_GPIO_AD_11_OFFSET           (0x0138)
#define IMXRT_PADMUX_GPIO_AD_12_OFFSET           (0x013c)
#define IMXRT_PADMUX_GPIO_AD_13_OFFSET           (0x0140)
#define IMXRT_PADMUX_GPIO_AD_14_OFFSET           (0x0144)
#define IMXRT_PADMUX_GPIO_AD_15_OFFSET           (0x0148)
#define IMXRT_PADMUX_GPIO_AD_16_OFFSET           (0x014c)
#define IMXRT_PADMUX_GPIO_AD_17_OFFSET           (0x0150)
#define IMXRT_PADMUX_GPIO_AD_18_OFFSET           (0x0154)
#define IMXRT_PADMUX_GPIO_AD_19_OFFSET           (0x0158)
#define IMXRT_PADMUX_GPIO_AD_20_OFFSET           (0x015c)
#define IMXRT_PADMUX_GPIO_AD_21_OFFSET           (0x0160)
#define IMXRT_PADMUX_GPIO_AD_22_OFFSET           (0x0164)
#define IMXRT_PADMUX_GPIO_AD_23_OFFSET           (0x0168)
#define IMXRT_PADMUX_GPIO_AD_24_OFFSET           (0x016c)
#define IMXRT_PADMUX_GPIO_AD_25_OFFSET           (0x0170)
#define IMXRT_PADMUX_GPIO_AD_26_OFFSET           (0x0174)
#define IMXRT_PADMUX_GPIO_AD_27_OFFSET           (0x0178)
#define IMXRT_PADMUX_GPIO_AD_28_OFFSET           (0x017c)
#define IMXRT_PADMUX_GPIO_AD_29_OFFSET           (0x0180)
#define IMXRT_PADMUX_GPIO_AD_30_OFFSET           (0x0184)
#define IMXRT_PADMUX_GPIO_AD_31_OFFSET           (0x0188)
#define IMXRT_PADMUX_GPIO_AD_32_OFFSET           (0x018c)
#define IMXRT_PADMUX_GPIO_AD_33_OFFSET           (0x0190)
#define IMXRT_PADMUX_GPIO_AD_34_OFFSET           (0x0194)
#define IMXRT_PADMUX_GPIO_AD_35_OFFSET           (0x0198)
#define IMXRT_PADMUX_GPIO_SD_B1_00_OFFSET        (0x019c)
#define IMXRT_PADMUX_GPIO_SD_B1_01_OFFSET        (0x01a0)
#define IMXRT_PADMUX_GPIO_SD_B1_02_OFFSET        (0x01a4)
#define IMXRT_PADMUX_GPIO_SD_B1_03_OFFSET        (0x01a8)
#define IMXRT_PADMUX_GPIO_SD_B1_04_OFFSET        (0x01ac)
#define IMXRT_PADMUX_GPIO_SD_B1_05_OFFSET        (0x01b0)
#define IMXRT_PADMUX_GPIO_SD_B2_00_OFFSET        (0x01b4)
#define IMXRT_PADMUX_GPIO_SD_B2_01_OFFSET        (0x01b8)
#define IMXRT_PADMUX_GPIO_SD_B2_02_OFFSET        (0x01bc)
#define IMXRT_PADMUX_GPIO_SD_B2_03_OFFSET        (0x01c0)
#define IMXRT_PADMUX_GPIO_SD_B2_04_OFFSET        (0x01c4)
#define IMXRT_PADMUX_GPIO_SD_B2_05_OFFSET        (0x01c8)
#define IMXRT_PADMUX_GPIO_SD_B2_06_OFFSET        (0x01cc)
#define IMXRT_PADMUX_GPIO_SD_B2_07_OFFSET        (0x01d0)
#define IMXRT_PADMUX_GPIO_SD_B2_08_OFFSET        (0x01d4)
#define IMXRT_PADMUX_GPIO_SD_B2_09_OFFSET        (0x01d8)
#define IMXRT_PADMUX_GPIO_SD_B2_10_OFFSET        (0x01dc)
#define IMXRT_PADMUX_GPIO_SD_B2_11_OFFSET        (0x01e0)
#define IMXRT_PADMUX_GPIO_DISP_B1_00_OFFSET      (0x01e4)
#define IMXRT_PADMUX_GPIO_DISP_B1_01_OFFSET      (0x01e8)
#define IMXRT_PADMUX_GPIO_DISP_B1_02_OFFSET      (0x01ec)
#define IMXRT_PADMUX_GPIO_DISP_B1_03_OFFSET      (0x01f0)
#define IMXRT_PADMUX_GPIO_DISP_B1_04_OFFSET      (0x01f4)
#define IMXRT_PADMUX_GPIO_DISP_B1_05_OFFSET      (0x01f8)
#define IMXRT_PADMUX_GPIO_DISP_B1_06_OFFSET      (0x01fc)
#define IMXRT_PADMUX_GPIO_DISP_B1_07_OFFSET      (0x0200)
#define IMXRT_PADMUX_GPIO_DISP_B1_08_OFFSET      (0x0204)
#define IMXRT_PADMUX_GPIO_DISP_B1_09_OFFSET      (0x0208)
#define IMXRT_PADMUX_GPIO_DISP_B1_10_OFFSET      (0x020c)
#define IMXRT_PADMUX_GPIO_DISP_B1_11_OFFSET      (0x0210)
#define IMXRT_PADMUX_GPIO_DISP_B2_00_OFFSET      (0x0214)
#define IMXRT_PADMUX_GPIO_DISP_B2_01_OFFSET      (0x0218)
#define IMXRT_PADMUX_GPIO_DISP_B2_02_OFFSET      (0x021c)
#define IMXRT_PADMUX_GPIO_DISP_B2_03_OFFSET      (0x0220)
#define IMXRT_PADMUX_GPIO_DISP_B2_04_OFFSET      (0x0224)
#define IMXRT_PADMUX_GPIO_DISP_B2_05_OFFSET      (0x0228)
#define IMXRT_PADMUX_GPIO_DISP_B2_06_OFFSET      (0x022c)
#define IMXRT_PADMUX_GPIO_DISP_B2_07_OFFSET      (0x0230)
#define IMXRT_PADMUX_GPIO_DISP_B2_08_OFFSET      (0x0234)
#define IMXRT_PADMUX_GPIO_DISP_B2_09_OFFSET      (0x0238)
#define IMXRT_PADMUX_GPIO_DISP_B2_10_OFFSET      (0x023c)
#define IMXRT_PADMUX_GPIO_DISP_B2_11_OFFSET      (0x0240)
#define IMXRT_PADMUX_GPIO_DISP_B2_12_OFFSET      (0x0244)
#define IMXRT_PADMUX_GPIO_DISP_B2_13_OFFSET      (0x0248)
#define IMXRT_PADMUX_GPIO_DISP_B2_14_OFFSET      (0x024c)
#define IMXRT_PADMUX_GPIO_DISP_B2_15_OFFSET      (0x0250)

/* IOMUXC_SNVS Pad Mux Register Offsets (from IMXRT_IOMUXCSNVS_BASE) */

#define IMXRT_PADMUX_OFFSET_SNVS(n)              ((unsigned int)(n) << 2)

#define IMXRT_PADMUX_WAKEUP_OFFSET               (0x0000)
#define IMXRT_PADMUX_PMIC_ON_REQ_OFFSET          (0x0004)
#define IMXRT_PADMUX_PMIC_STBY_REQ_OFFSET        (0x0008)
#define IMXRT_PADMUX_GPIO_SNVS_00_OFFSET         (0x000c)
#define IMXRT_PADMUX_GPIO_SNVS_01_OFFSET         (0x0010)
#define IMXRT_PADMUX_GPIO_SNVS_02_OFFSET         (0x0014)
#define IMXRT_PADMUX_GPIO_SNVS_03_OFFSET         (0x0018)
#define IMXRT_PADMUX_GPIO_SNVS_04_OFFSET         (0x001c)
#define IMXRT_PADMUX_GPIO_SNVS_05_OFFSET         (0x0020)
#define IMXRT_PADMUX_GPIO_SNVS_06_OFFSET         (0x0024)
#define IMXRT_PADMUX_GPIO_SNVS_07_OFFSET         (0x0028)
#define IMXRT_PADMUX_GPIO_SNVS_08_OFFSET         (0x002c)
#define IMXRT_PADMUX_GPIO_SNVS_09_OFFSET         (0x0030)

/* IOMUXC_LPSR Pad Mux Register Offsets (from IMXRT_IOMUXCLPSR_BASE) */

#define IMXRT_PADMUX_OFFSET_LPSR(n)              ((unsigned int)(n) << 2)

#define IMXRT_PADMUX_GPIO_LPSR_00_OFFSET         (0x0000)
#define IMXRT_PADMUX_GPIO_LPSR_01_OFFSET         (0x0004)
#define IMXRT_PADMUX_GPIO_LPSR_02_OFFSET         (0x0008)
#define IMXRT_PADMUX_GPIO_LPSR_03_OFFSET         (0x000c)
#define IMXRT_PADMUX_GPIO_LPSR_04_OFFSET         (0x0010)
#define IMXRT_PADMUX_GPIO_LPSR_05_OFFSET         (0x0014)
#define IMXRT_PADMUX_GPIO_LPSR_06_OFFSET         (0x0018)
#define IMXRT_PADMUX_GPIO_LPSR_07_OFFSET         (0x001c)
#define IMXRT_PADMUX_GPIO_LPSR_08_OFFSET         (0x0020)
#define IMXRT_PADMUX_GPIO_LPSR_09_OFFSET         (0x0024)
#define IMXRT_PADMUX_GPIO_LPSR_10_OFFSET         (0x0028)
#define IMXRT_PADMUX_GPIO_LPSR_11_OFFSET         (0x002c)
#define IMXRT_PADMUX_GPIO_LPSR_12_OFFSET         (0x0030)
#define IMXRT_PADMUX_GPIO_LPSR_13_OFFSET         (0x0034)
#define IMXRT_PADMUX_GPIO_LPSR_14_OFFSET         (0x0038)
#define IMXRT_PADMUX_GPIO_LPSR_15_OFFSET         (0x003c)

/* Pad Control Register Indices & Offsets ***********************************/

/* Pad Control Register Indices (used by software for table lookups) */

