apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define IMXRT_PADCTL_OFFSET(n)                   (0x0254 + ((unsigned int)(n) << 2))

#define IMXRT_PADCTL_GPIO_EMC_B1_00_OFFSET       (0x0254)
#define IMXRT_PADCTL_GPIO_EMC_B1_01_OFFSET       (0x0258)
#define IMXRT_PADCTL_GPIO_EMC_B1_02_OFFSET       (0x025c)
#define IMXRT_PADCTL_GPIO_EMC_B1_03_OFFSET       (0x0260)
#define IMXRT_PADCTL_GPIO_EMC_B1_04_OFFSET       (0x0264)
#define IMXRT_PADCTL_GPIO_EMC_B1_05_OFFSET       (0x0268)
#define IMXRT_PADCTL_GPIO_EMC_B1_06_OFFSET       (0x026c)
#define IMXRT_PADCTL_GPIO_EMC_B1_07_OFFSET       (0x0270)
#define IMXRT_PADCTL_GPIO_EMC_B1_08_OFFSET       (0x0274)
#define IMXRT_PADCTL_GPIO_EMC_B1_09_OFFSET       (0x0278)
#define IMXRT_PADCTL_GPIO_EMC_B1_10_OFFSET       (0x027c)
#define IMXRT_PADCTL_GPIO_EMC_B1_11_OFFSET       (0x0280)
#define IMXRT_PADCTL_GPIO_EMC_B1_12_OFFSET       (0x0284)
#define IMXRT_PADCTL_GPIO_EMC_B1_13_OFFSET       (0x0288)
#define IMXRT_PADCTL_GPIO_EMC_B1_14_OFFSET       (0x028c)
#define IMXRT_PADCTL_GPIO_EMC_B1_15_OFFSET       (0x0290)
#define IMXRT_PADCTL_GPIO_EMC_B1_16_OFFSET       (0x0294)
#define IMXRT_PADCTL_GPIO_EMC_B1_17_OFFSET       (0x0298)
#define IMXRT_PADCTL_GPIO_EMC_B1_18_OFFSET       (0x029c)
#define IMXRT_PADCTL_GPIO_EMC_B1_19_OFFSET       (0x02a0)
#define IMXRT_PADCTL_GPIO_EMC_B1_20_OFFSET       (0x02a4)
#define IMXRT_PADCTL_GPIO_EMC_B1_21_OFFSET       (0x02a8)
#define IMXRT_PADCTL_GPIO_EMC_B1_22_OFFSET       (0x02ac)
#define IMXRT_PADCTL_GPIO_EMC_B1_23_OFFSET       (0x02b0)
#define IMXRT_PADCTL_GPIO_EMC_B1_24_OFFSET       (0x02b4)
#define IMXRT_PADCTL_GPIO_EMC_B1_25_OFFSET       (0x02b8)
#define IMXRT_PADCTL_GPIO_EMC_B1_26_OFFSET       (0x02bc)
#define IMXRT_PADCTL_GPIO_EMC_B1_27_OFFSET       (0x02c0)
#define IMXRT_PADCTL_GPIO_EMC_B1_28_OFFSET       (0x02c4)
#define IMXRT_PADCTL_GPIO_EMC_B1_29_OFFSET       (0x02c8)
#define IMXRT_PADCTL_GPIO_EMC_B1_30_OFFSET       (0x02cc)
#define IMXRT_PADCTL_GPIO_EMC_B1_31_OFFSET       (0x02d0)
#define IMXRT_PADCTL_GPIO_EMC_B1_32_OFFSET       (0x02d4)
#define IMXRT_PADCTL_GPIO_EMC_B1_33_OFFSET       (0x02d8)
#define IMXRT_PADCTL_GPIO_EMC_B1_34_OFFSET       (0x02dc)
#define IMXRT_PADCTL_GPIO_EMC_B1_35_OFFSET       (0x02e0)
#define IMXRT_PADCTL_GPIO_EMC_B1_36_OFFSET       (0x02e4)
#define IMXRT_PADCTL_GPIO_EMC_B1_37_OFFSET       (0x02e8)
#define IMXRT_PADCTL_GPIO_EMC_B1_38_OFFSET       (0x02ec)
#define IMXRT_PADCTL_GPIO_EMC_B1_39_OFFSET       (0x02f0)
#define IMXRT_PADCTL_GPIO_EMC_B1_40_OFFSET       (0x02f4)
#define IMXRT_PADCTL_GPIO_EMC_B1_41_OFFSET       (0x02f8)
#define IMXRT_PADCTL_GPIO_EMC_B2_00_OFFSET       (0x02fc)
#define IMXRT_PADCTL_GPIO_EMC_B2_01_OFFSET       (0x0300)
#define IMXRT_PADCTL_GPIO_EMC_B2_02_OFFSET       (0x0304)
#define IMXRT_PADCTL_GPIO_EMC_B2_03_OFFSET       (0x0308)
#define IMXRT_PADCTL_GPIO_EMC_B2_04_OFFSET       (0x030c)
#define IMXRT_PADCTL_GPIO_EMC_B2_05_OFFSET       (0x0310)
#define IMXRT_PADCTL_GPIO_EMC_B2_06_OFFSET       (0x0314)
#define IMXRT_PADCTL_GPIO_EMC_B2_07_OFFSET       (0x0318)
#define IMXRT_PADCTL_GPIO_EMC_B2_08_OFFSET       (0x031c)
#define IMXRT_PADCTL_GPIO_EMC_B2_09_OFFSET       (0x0320)
#define IMXRT_PADCTL_GPIO_EMC_B2_10_OFFSET       (0x0324)
#define IMXRT_PADCTL_GPIO_EMC_B2_11_OFFSET       (0x0328)
#define IMXRT_PADCTL_GPIO_EMC_B2_12_OFFSET       (0x032c)
#define IMXRT_PADCTL_GPIO_EMC_B2_13_OFFSET       (0x0330)
#define IMXRT_PADCTL_GPIO_EMC_B2_14_OFFSET       (0x0334)
#define IMXRT_PADCTL_GPIO_EMC_B2_15_OFFSET       (0x0338)
#define IMXRT_PADCTL_GPIO_EMC_B2_16_OFFSET       (0x033c)
#define IMXRT_PADCTL_GPIO_EMC_B2_17_OFFSET       (0x0340)
#define IMXRT_PADCTL_GPIO_EMC_B2_18_OFFSET       (0x0344)
#define IMXRT_PADCTL_GPIO_EMC_B2_19_OFFSET       (0x0348)
#define IMXRT_PADCTL_GPIO_EMC_B2_20_OFFSET       (0x034c)
#define IMXRT_PADCTL_GPIO_AD_00_OFFSET           (0x0350)
#define IMXRT_PADCTL_GPIO_AD_01_OFFSET           (0x0354)
#define IMXRT_PADCTL_GPIO_AD_02_OFFSET           (0x0358)
#define IMXRT_PADCTL_GPIO_AD_03_OFFSET           (0x035c)
#define IMXRT_PADCTL_GPIO_AD_04_OFFSET           (0x0360)
#define IMXRT_PADCTL_GPIO_AD_05_OFFSET           (0x0364)
#define IMXRT_PADCTL_GPIO_AD_06_OFFSET           (0x0368)
#define IMXRT_PADCTL_GPIO_AD_07_OFFSET           (0x036c)
#define IMXRT_PADCTL_GPIO_AD_08_OFFSET           (0x0370)
#define IMXRT_PADCTL_GPIO_AD_09_OFFSET           (0x0374)
#define IMXRT_PADCTL_GPIO_AD_10_OFFSET           (0x0378)
#define IMXRT_PADCTL_GPIO_AD_11_OFFSET           (0x037c)
#define IMXRT_PADCTL_GPIO_AD_12_OFFSET           (0x0380)
#define IMXRT_PADCTL_GPIO_AD_13_OFFSET           (0x0384)
#define IMXRT_PADCTL_GPIO_AD_14_OFFSET           (0x0388)
#define IMXRT_PADCTL_GPIO_AD_15_OFFSET           (0x038c)
#define IMXRT_PADCTL_GPIO_AD_16_OFFSET           (0x0390)
#define IMXRT_PADCTL_GPIO_AD_17_OFFSET           (0x0394)
#define IMXRT_PADCTL_GPIO_AD_18_OFFSET           (0x0398)
#define IMXRT_PADCTL_GPIO_AD_19_OFFSET           (0x039c)
#define IMXRT_PADCTL_GPIO_AD_20_OFFSET           (0x03a0)
#define IMXRT_PADCTL_GPIO_AD_21_OFFSET           (0x03a4)
#define IMXRT_PADCTL_GPIO_AD_22_OFFSET           (0x03a8)
#define IMXRT_PADCTL_GPIO_AD_23_OFFSET           (0x03ac)
#define IMXRT_PADCTL_GPIO_AD_24_OFFSET           (0x03b0)
#define IMXRT_PADCTL_GPIO_AD_25_OFFSET           (0x03b4)
#define IMXRT_PADCTL_GPIO_AD_26_OFFSET           (0x03b8)
#define IMXRT_PADCTL_GPIO_AD_27_OFFSET           (0x03bc)
#define IMXRT_PADCTL_GPIO_AD_28_OFFSET           (0x03c0)
#define IMXRT_PADCTL_GPIO_AD_29_OFFSET           (0x03c4)
#define IMXRT_PADCTL_GPIO_AD_30_OFFSET           (0x03c8)
#define IMXRT_PADCTL_GPIO_AD_31_OFFSET           (0x03cc)
#define IMXRT_PADCTL_GPIO_AD_32_OFFSET           (0x03d0)
#define IMXRT_PADCTL_GPIO_AD_33_OFFSET           (0x03d4)
#define IMXRT_PADCTL_GPIO_AD_34_OFFSET           (0x03d8)
#define IMXRT_PADCTL_GPIO_AD_35_OFFSET           (0x03dc)
#define IMXRT_PADCTL_GPIO_SD_B1_00_OFFSET        (0x03e0)
#define IMXRT_PADCTL_GPIO_SD_B1_01_OFFSET        (0x03e4)
#define IMXRT_PADCTL_GPIO_SD_B1_02_OFFSET        (0x03e8)
#define IMXRT_PADCTL_GPIO_SD_B1_03_OFFSET        (0x03ec)
#define IMXRT_PADCTL_GPIO_SD_B1_04_OFFSET        (0x03f0)
#define IMXRT_PADCTL_GPIO_SD_B1_05_OFFSET        (0x03f4)
#define IMXRT_PADCTL_GPIO_SD_B2_00_OFFSET        (0x03f8)
#define IMXRT_PADCTL_GPIO_SD_B2_01_OFFSET        (0x03fc)
#define IMXRT_PADCTL_GPIO_SD_B2_02_OFFSET        (0x0400)
#define IMXRT_PADCTL_GPIO_SD_B2_03_OFFSET        (0x0404)
#define IMXRT_PADCTL_GPIO_SD_B2_04_OFFSET        (0x0408)
#define IMXRT_PADCTL_GPIO_SD_B2_05_OFFSET        (0x040c)
#define IMXRT_PADCTL_GPIO_SD_B2_06_OFFSET        (0x0410)
#define IMXRT_PADCTL_GPIO_SD_B2_07_OFFSET        (0x0414)
#define IMXRT_PADCTL_GPIO_SD_B2_08_OFFSET        (0x0418)
#define IMXRT_PADCTL_GPIO_SD_B2_09_OFFSET        (0x041c)
#define IMXRT_PADCTL_GPIO_SD_B2_10_OFFSET        (0x0420)
#define IMXRT_PADCTL_GPIO_SD_B2_11_OFFSET        (0x0424)
#define IMXRT_PADCTL_GPIO_DISP_B1_00_OFFSET      (0x0428)
#define IMXRT_PADCTL_GPIO_DISP_B1_01_OFFSET      (0x042c)
#define IMXRT_PADCTL_GPIO_DISP_B1_02_OFFSET      (0x0430)
#define IMXRT_PADCTL_GPIO_DISP_B1_03_OFFSET      (0x0434)
#define IMXRT_PADCTL_GPIO_DISP_B1_04_OFFSET      (0x0438)
#define IMXRT_PADCTL_GPIO_DISP_B1_05_OFFSET      (0x043c)
#define IMXRT_PADCTL_GPIO_DISP_B1_06_OFFSET      (0x0440)
#define IMXRT_PADCTL_GPIO_DISP_B1_07_OFFSET      (0x0444)
#define IMXRT_PADCTL_GPIO_DISP_B1_08_OFFSET      (0x0448)
#define IMXRT_PADCTL_GPIO_DISP_B1_09_OFFSET      (0x044c)
#define IMXRT_PADCTL_GPIO_DISP_B1_10_OFFSET      (0x0450)
#define IMXRT_PADCTL_GPIO_DISP_B1_11_OFFSET      (0x0454)
#define IMXRT_PADCTL_GPIO_DISP_B2_00_OFFSET      (0x0458)
#define IMXRT_PADCTL_GPIO_DISP_B2_01_OFFSET      (0x045c)
#define IMXRT_PADCTL_GPIO_DISP_B2_02_OFFSET      (0x0460)
#define IMXRT_PADCTL_GPIO_DISP_B2_03_OFFSET      (0x0464)
#define IMXRT_PADCTL_GPIO_DISP_B2_04_OFFSET      (0x0468)
#define IMXRT_PADCTL_GPIO_DISP_B2_05_OFFSET      (0x046c)
#define IMXRT_PADCTL_GPIO_DISP_B2_06_OFFSET      (0x0470)
#define IMXRT_PADCTL_GPIO_DISP_B2_07_OFFSET      (0x0474)
#define IMXRT_PADCTL_GPIO_DISP_B2_08_OFFSET      (0x0478)
#define IMXRT_PADCTL_GPIO_DISP_B2_09_OFFSET      (0x047c)
#define IMXRT_PADCTL_GPIO_DISP_B2_10_OFFSET      (0x0480)
#define IMXRT_PADCTL_GPIO_DISP_B2_11_OFFSET      (0x0484)
#define IMXRT_PADCTL_GPIO_DISP_B2_12_OFFSET      (0x0488)
#define IMXRT_PADCTL_GPIO_DISP_B2_13_OFFSET      (0x048c)
#define IMXRT_PADCTL_GPIO_DISP_B2_14_OFFSET      (0x0490)
#define IMXRT_PADCTL_GPIO_DISP_B2_15_OFFSET      (0x0494)

