apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
/* IOMUXC_SNVS Pad Control Register Offsets (from IMXRT_IOMUXCSNVS_BASE) */

#define IMXRT_PADCTL_OFFSET_SNVS(n)              (0x0034 + ((unsigned int)(n) << 2))

#define IMXRT_PADCTL_TEST_MODE_OFFSET            (0x0034)
#define IMXRT_PADCTL_POR_B_OFFSET                (0x0038)
#define IMXRT_PADCTL_ONOFF_OFFSET                (0x003c)
#define IMXRT_PADCTL_WAKEUP_OFFSET               (0x0040)
#define IMXRT_PADCTL_PMIC_ON_REQ_OFFSET          (0x0044)
#define IMXRT_PADCTL_PMIC_STBY_REQ_OFFSET        (0x0048)
#define IMXRT_PADCTL_GPIO_SNVS_00_OFFSET         (0x004c)
#define IMXRT_PADCTL_GPIO_SNVS_01_OFFSET         (0x0050)
#define IMXRT_PADCTL_GPIO_SNVS_02_OFFSET         (0x0054)
#define IMXRT_PADCTL_GPIO_SNVS_03_OFFSET         (0x0058)
#define IMXRT_PADCTL_GPIO_SNVS_04_OFFSET         (0x005c)
#define IMXRT_PADCTL_GPIO_SNVS_05_OFFSET         (0x0060)
#define IMXRT_PADCTL_GPIO_SNVS_06_OFFSET         (0x0064)
#define IMXRT_PADCTL_GPIO_SNVS_07_OFFSET         (0x0068)
#define IMXRT_PADCTL_GPIO_SNVS_08_OFFSET         (0x006c)
#define IMXRT_PADCTL_GPIO_SNVS_09_OFFSET         (0x0070)

/* IOMUXC_LPSR Pad Control Register Offsets (from IMXRT_IOMUXCLPSR_BASE) */

#define IMXRT_PADCTL_OFFSET_LPSR(n)              (0x0040 + ((unsigned int)(n) << 2))

#define IMXRT_PADCTL_GPIO_LPSR_00_OFFSET         (0x0040)
#define IMXRT_PADCTL_GPIO_LPSR_01_OFFSET         (0x0044)
#define IMXRT_PADCTL_GPIO_LPSR_02_OFFSET         (0x0048)
#define IMXRT_PADCTL_GPIO_LPSR_03_OFFSET         (0x004c)
#define IMXRT_PADCTL_GPIO_LPSR_04_OFFSET         (0x0050)
#define IMXRT_PADCTL_GPIO_LPSR_05_OFFSET         (0x0054)
#define IMXRT_PADCTL_GPIO_LPSR_06_OFFSET         (0x0058)
#define IMXRT_PADCTL_GPIO_LPSR_07_OFFSET         (0x005c)
#define IMXRT_PADCTL_GPIO_LPSR_08_OFFSET         (0x0060)
#define IMXRT_PADCTL_GPIO_LPSR_09_OFFSET         (0x0064)
#define IMXRT_PADCTL_GPIO_LPSR_10_OFFSET         (0x0068)
#define IMXRT_PADCTL_GPIO_LPSR_11_OFFSET         (0x006c)
#define IMXRT_PADCTL_GPIO_LPSR_12_OFFSET         (0x0070)
#define IMXRT_PADCTL_GPIO_LPSR_13_OFFSET         (0x0074)
#define IMXRT_PADCTL_GPIO_LPSR_14_OFFSET         (0x0078)
#define IMXRT_PADCTL_GPIO_LPSR_15_OFFSET         (0x007c)

/* IOMUXC Select Input Daisy Chain Register Offsets
 * (from IMXRT_IOMUXC_BASE)
 */

#define IMXRT_INPUT_INDEX2OFFSET(n)              (0x0498 + ((unsigned int)(n) << 2))
#define IMXRT_INPUT_OFFSET2INDEX(o)              (((unsigned int)(o) - 0x0498) >> 2)

#define IMXRT_INPUT_FLEXCAN1_RX_OFFSET           (0x0498)
#define IMXRT_INPUT_FLEXCAN2_RX_OFFSET           (0x049c)
#define IMXRT_INPUT_CCM_ENET_QOS_REFCLK_OFFSET   (0x04a0)
#define IMXRT_INPUT_CCM_ENET_QOS_TXCLK_OFFSET    (0x04a4)
#define IMXRT_INPUT_ENET_IPG_CLK_RMII_OFFSET     (0x04a8)
#define IMXRT_INPUT_ENET_MDIO_OFFSET             (0x04ac)
#define IMXRT_INPUT_ENET_RXDATA0_OFFSET          (0x04b0)
#define IMXRT_INPUT_ENET_RXDATA1_OFFSET          (0x04b4)
#define IMXRT_INPUT_ENET_RXEN_OFFSET             (0x04b8)
#define IMXRT_INPUT_ENET_RXERR_OFFSET            (0x04bc)
#define IMXRT_INPUT_ENET_TXCLK_OFFSET            (0x04c0)
#define IMXRT_INPUT_ENET_1G_IPG_CLK_RMII_OFFSET  (0x04c4)
#define IMXRT_INPUT_ENET_1G_MDIO_OFFSET          (0x04c8)
#define IMXRT_INPUT_ENET_1G_RXCLK_OFFSET         (0x04cc)
#define IMXRT_INPUT_ENET_1G_RXDATA0_OFFSET       (0x04d0)
#define IMXRT_INPUT_ENET_1G_RXDATA1_OFFSET       (0x04d4)
#define IMXRT_INPUT_ENET_1G_RXDATA2_OFFSET       (0x04d8)
#define IMXRT_INPUT_ENET_1G_RXDATA3_OFFSET       (0x04dc)
#define IMXRT_INPUT_ENET_1G_RXEN_OFFSET          (0x04e0)
#define IMXRT_INPUT_ENET_1G_RXERR_OFFSET         (0x04e4)
#define IMXRT_INPUT_ENET_1G_TXCLK_OFFSET         (0x04e8)
#define IMXRT_INPUT_ENET_QOS_MDIO_OFFSET         (0x04ec)
#define IMXRT_INPUT_ENET_QOS_RXDATA0_OFFSET      (0x04f0)
#define IMXRT_INPUT_ENET_QOS_RXDATA1_OFFSET      (0x04f4)
#define IMXRT_INPUT_ENET_QOS_RXDV_OFFSET         (0x04f8)
#define IMXRT_INPUT_ENET_QOS_RXERR_OFFSET        (0x04fc)
#define IMXRT_INPUT_FLEXPWM1_PWMA0_OFFSET        (0x0500)
#define IMXRT_INPUT_FLEXPWM1_PWMA1_OFFSET        (0x0504)
#define IMXRT_INPUT_FLEXPWM1_PWMA2_OFFSET        (0x0508)
#define IMXRT_INPUT_FLEXPWM1_PWMB0_OFFSET        (0x050c)
#define IMXRT_INPUT_FLEXPWM1_PWMB1_OFFSET        (0x0510)
#define IMXRT_INPUT_FLEXPWM1_PWMB2_OFFSET        (0x0514)
#define IMXRT_INPUT_FLEXPWM2_PWMA0_OFFSET        (0x0518)
#define IMXRT_INPUT_FLEXPWM2_PWMA1_OFFSET        (0x051c)
#define IMXRT_INPUT_FLEXPWM2_PWMA2_OFFSET        (0x0520)
#define IMXRT_INPUT_FLEXPWM2_PWMB0_OFFSET        (0x0524)
#define IMXRT_INPUT_FLEXPWM2_PWMB1_OFFSET        (0x0528)
#define IMXRT_INPUT_FLEXPWM2_PWMB2_OFFSET        (0x052c)
#define IMXRT_INPUT_FLEXPWM3_PWMA0_OFFSET        (0x0530)
#define IMXRT_INPUT_FLEXPWM3_PWMA1_OFFSET        (0x0534)
#define IMXRT_INPUT_FLEXPWM3_PWMA2_OFFSET        (0x0538)
#define IMXRT_INPUT_FLEXPWM3_PWMA3_OFFSET        (0x053c)
#define IMXRT_INPUT_FLEXPWM3_PWMB0_OFFSET        (0x0540)
#define IMXRT_INPUT_FLEXPWM3_PWMB1_OFFSET        (0x0544)
#define IMXRT_INPUT_FLEXPWM3_PWMB2_OFFSET        (0x0548)
#define IMXRT_INPUT_FLEXPWM3_PWMB3_OFFSET        (0x054c)
#define IMXRT_INPUT_FLEXSPI1A_DQS_OFFSET         (0x0550)
#define IMXRT_INPUT_FLEXSPI1A_DATA0_OFFSET       (0x0554)
#define IMXRT_INPUT_FLEXSPI1A_DATA1_OFFSET       (0x0558)
#define IMXRT_INPUT_FLEXSPI1A_DATA2_OFFSET       (0x055c)
#define IMXRT_INPUT_FLEXSPI1A_DATA3_OFFSET       (0x0560)
#define IMXRT_INPUT_FLEXSPI1B_DATA0_OFFSET       (0x0564)
#define IMXRT_INPUT_FLEXSPI1B_DATA1_OFFSET       (0x0568)
#define IMXRT_INPUT_FLEXSPI1B_DATA2_OFFSET       (0x056c)
#define IMXRT_INPUT_FLEXSPI1B_DATA3_OFFSET       (0x0570)
#define IMXRT_INPUT_FLEXSPI1A_SCK_OFFSET         (0x0574)
#define IMXRT_INPUT_FLEXSPI1B_SCK_OFFSET         (0x0578)
#define IMXRT_INPUT_FLEXSPI2A_DATA0_OFFSET       (0x057c)
#define IMXRT_INPUT_FLEXSPI2A_DATA1_OFFSET       (0x0580)
#define IMXRT_INPUT_FLEXSPI2A_DATA2_OFFSET       (0x0584)
#define IMXRT_INPUT_FLEXSPI2A_DATA3_OFFSET       (0x0588)
#define IMXRT_INPUT_FLEXSPI2A_SCK_OFFSET         (0x058c)
#define IMXRT_INPUT_GPT3_CAPIN1_OFFSET           (0x0590)
#define IMXRT_INPUT_GPT3_CAPIN2_OFFSET           (0x0594)
#define IMXRT_INPUT_GPT3_CLKIN_OFFSET            (0x0598)
#define IMXRT_INPUT_KPP_COL6_OFFSET              (0x059c)
#define IMXRT_INPUT_KPP_COL7_OFFSET              (0x05a0)
#define IMXRT_INPUT_KPP_ROW6_OFFSET              (0x05a4)
#define IMXRT_INPUT_KPP_ROW7_OFFSET              (0x05a8)
#define IMXRT_INPUT_LPI2C1_SCL_OFFSET            (0x05ac)
#define IMXRT_INPUT_LPI2C1_SDA_OFFSET            (0x05b0)
#define IMXRT_INPUT_LPI2C2_SCL_OFFSET            (0x05b4)
#define IMXRT_INPUT_LPI2C2_SDA_OFFSET            (0x05b8)
#define IMXRT_INPUT_LPI2C3_SCL_OFFSET            (0x05bc)
#define IMXRT_INPUT_LPI2C3_SDA_OFFSET            (0x05c0)
#define IMXRT_INPUT_LPI2C4_SCL_OFFSET            (0x05c4)
#define IMXRT_INPUT_LPI2C4_SDA_OFFSET            (0x05c8)
#define IMXRT_INPUT_LPSPI1_PCS0_OFFSET           (0x05cc)
#define IMXRT_INPUT_LPSPI1_SCK_OFFSET            (0x05d0)
#define IMXRT_INPUT_LPSPI1_SDI_OFFSET            (0x05d4)
#define IMXRT_INPUT_LPSPI1_SDO_OFFSET            (0x05d8)
#define IMXRT_INPUT_LPSPI2_PCS0_OFFSET           (0x05dc)
#define IMXRT_INPUT_LPSPI2_PCS1_OFFSET           (0x05e0)
#define IMXRT_INPUT_LPSPI2_SCK_OFFSET            (0x05e4)
#define IMXRT_INPUT_LPSPI2_SDI_OFFSET            (0x05e8)
#define IMXRT_INPUT_LPSPI2_SDO_OFFSET            (0x05ec)
#define IMXRT_INPUT_LPSPI3_PCS0_OFFSET           (0x05f0)
#define IMXRT_INPUT_LPSPI3_PCS1_OFFSET           (0x05f4)
#define IMXRT_INPUT_LPSPI3_PCS2_OFFSET           (0x05f8)
#define IMXRT_INPUT_LPSPI3_PCS3_OFFSET           (0x05fc)
#define IMXRT_INPUT_LPSPI3_SCK_OFFSET            (0x0600)
#define IMXRT_INPUT_LPSPI3_SDI_OFFSET            (0x0604)
#define IMXRT_INPUT_LPSPI3_SDO_OFFSET            (0x0608)
#define IMXRT_INPUT_LPSPI4_PCS0_OFFSET           (0x060c)
#define IMXRT_INPUT_LPSPI4_SCK_OFFSET            (0x0610)
#define IMXRT_INPUT_LPSPI4_SDI_OFFSET            (0x0614)
#define IMXRT_INPUT_LPSPI4_SDO_OFFSET            (0x0618)
#define IMXRT_INPUT_LPUART1_RX_OFFSET            (0x061c)
#define IMXRT_INPUT_LPUART1_TX_OFFSET            (0x0620)
#define IMXRT_INPUT_LPUART10_RX_OFFSET           (0x0624)
#define IMXRT_INPUT_LPUART10_TX_OFFSET           (0x0628)
#define IMXRT_INPUT_LPUART7_RX_OFFSET            (0x062c)
#define IMXRT_INPUT_LPUART7_TX_OFFSET            (0x0630)
#define IMXRT_INPUT_LPUART8_RX_OFFSET            (0x0634)
#define IMXRT_INPUT_LPUART8_TX_OFFSET            (0x0638)
#define IMXRT_INPUT_QTIMER1_TIMER0_OFFSET        (0x063c)
#define IMXRT_INPUT_QTIMER1_TIMER1_OFFSET        (0x0640)
#define IMXRT_INPUT_QTIMER1_TIMER2_OFFSET        (0x0644)
#define IMXRT_INPUT_QTIMER2_TIMER0_OFFSET        (0x0648)
#define IMXRT_INPUT_QTIMER2_TIMER1_OFFSET        (0x064c)
#define IMXRT_INPUT_QTIMER2_TIMER2_OFFSET        (0x0650)
#define IMXRT_INPUT_QTIMER3_TIMER0_OFFSET        (0x0654)
#define IMXRT_INPUT_QTIMER3_TIMER1_OFFSET        (0x0658)
#define IMXRT_INPUT_QTIMER3_TIMER2_OFFSET        (0x065c)
#define IMXRT_INPUT_QTIMER4_TIMER0_OFFSET        (0x0660)
#define IMXRT_INPUT_QTIMER4_TIMER1_OFFSET        (0x0664)
#define IMXRT_INPUT_QTIMER4_TIMER2_OFFSET        (0x0668)
#define IMXRT_INPUT_SAI1_MCLK_OFFSET             (0x066c)
#define IMXRT_INPUT_SAI1_RX_BCLK_OFFSET          (0x0670)
#define IMXRT_INPUT_SAI1_RX_DATA0_OFFSET         (0x0674)
#define IMXRT_INPUT_SAI1_RX_SYNC_OFFSET          (0x0678)
#define IMXRT_INPUT_SAI1_TX_BCLK_OFFSET          (0x067c)
#define IMXRT_INPUT_SAI1_TX_SYNC_OFFSET          (0x0680)
#define IMXRT_INPUT_EMVSIM1_SIO_OFFSET           (0x069c)
#define IMXRT_INPUT_EMVSIM1_SIMPD_OFFSET         (0x06a0)
#define IMXRT_INPUT_EMVSIM1_POWER_FAIL_OFFSET    (0x06a4)
#define IMXRT_INPUT_EMVSIM2_SIO_OFFSET           (0x06a8)
#define IMXRT_INPUT_EMVSIM2_SIMPD_OFFSET         (0x06ac)
#define IMXRT_INPUT_EMVSIM2_POWER_FAIL_OFFSET    (0x06b0)
#define IMXRT_INPUT_SPDIF_IN_OFFSET              (0x06b4)
#define IMXRT_INPUT_USB_OTG2_OC_OFFSET           (0x06b8)
#define IMXRT_INPUT_USB_OTG1_OC_OFFSET           (0x06bc)
#define IMXRT_INPUT_USBPHY1_USB_ID_OFFSET        (0x06c0)
#define IMXRT_INPUT_USBPHY2_USB_ID_OFFSET        (0x06c4)
#define IMXRT_INPUT_USDHC1_CD_B_OFFSET           (0x06c8)
#define IMXRT_INPUT_USDHC1_WP_OFFSET             (0x06cc)
#define IMXRT_INPUT_USDHC2_CD_B_OFFSET           (0x06d0)
#define IMXRT_INPUT_USDHC2_WP_OFFSET             (0x06d4)
#define IMXRT_INPUT_XBAR1_IN20_OFFSET            (0x06d8)
#define IMXRT_INPUT_XBAR1_IN21_OFFSET            (0x06dc)
#define IMXRT_INPUT_XBAR1_IN22_OFFSET            (0x06e0)
#define IMXRT_INPUT_XBAR1_IN23_OFFSET            (0x06e4)
#define IMXRT_INPUT_XBAR1_IN24_OFFSET            (0x06e8)
#define IMXRT_INPUT_XBAR1_IN25_OFFSET            (0x06ec)
#define IMXRT_INPUT_XBAR1_IN26_OFFSET            (0x06f0)
#define IMXRT_INPUT_XBAR1_IN27_OFFSET            (0x06f4)
#define IMXRT_INPUT_XBAR1_IN28_OFFSET            (0x06f8)
#define IMXRT_INPUT_XBAR1_IN29_OFFSET            (0x06fc)
#define IMXRT_INPUT_XBAR1_IN30_OFFSET            (0x0700)
#define IMXRT_INPUT_XBAR1_IN31_OFFSET            (0x0704)
#define IMXRT_INPUT_XBAR1_IN32_OFFSET            (0x0708)
#define IMXRT_INPUT_XBAR1_IN33_OFFSET            (0x070c)
#define IMXRT_INPUT_XBAR1_IN34_OFFSET            (0x0710)
#define IMXRT_INPUT_XBAR1_IN35_OFFSET            (0x0714)

/* IOMUXC_LPSR Select Input Daisy Chain Register Offsets
 * (from IMXRT_IOMUXCLPSR_BASE)
 */

#define IMXRT_INPUT_LPSR_INDEX2OFFSET(n)         (0x0080 + ((unsigned int)(n) << 2))
#define IMXRT_INPUT_LPSR_OFFSET2INDEX(o)         (((unsigned int)(o) - 0x0080) >> 2)

#define IMXRT_INPUT_LPSR_FLEXCAN3_RX_OFFSET      (0x0080)
#define IMXRT_INPUT_LPSR_LPI2C5_SCL_OFFSET       (0x0084)
#define IMXRT_INPUT_LPSR_LPI2C5_SDA_OFFSET       (0x0088)
#define IMXRT_INPUT_LPSR_LPI2C6_SCL_OFFSET       (0x008c)
#define IMXRT_INPUT_LPSR_LPI2C6_SDA_OFFSET       (0x0090)
#define IMXRT_INPUT_LPSR_LPSPI5_PCS0_OFFSET      (0x0094)
#define IMXRT_INPUT_LPSR_LPSPI5_SCK_OFFSET       (0x0098)
#define IMXRT_INPUT_LPSR_LPSPI5_SDI_OFFSET       (0x009c)
#define IMXRT_INPUT_LPSR_LPSPI5_SDO_OFFSET       (0x00a0)
#define IMXRT_INPUT_LPSR_LPUART11_RX_OFFSET      (0x00a4)
#define IMXRT_INPUT_LPSR_LPUART11_TX_OFFSET      (0x00a8)
#define IMXRT_INPUT_LPSR_LPUART12_RX_OFFSET      (0x00ac)
#define IMXRT_INPUT_LPSR_LPUART12_TX_OFFSET      (0x00b0)
#define IMXRT_INPUT_LPSR_PDM_BITSTREAM0_OFFSET   (0x00b4)
#define IMXRT_INPUT_LPSR_PDM_BITSTREAM1_OFFSET   (0x00b8)
#define IMXRT_INPUT_LPSR_PDM_BITSTREAM2_OFFSET   (0x00bc)
#define IMXRT_INPUT_LPSR_PDM_BITSTREAM3_OFFSET   (0x00c0)
#define IMXRT_INPUT_LPSR_NMI_GLUE_NMI_OFFSET     (0x00c4)
#define IMXRT_INPUT_LPSR_SAI4_MCLK_OFFSET        (0x00c8)
#define IMXRT_INPUT_LPSR_SAI4_RX_BCLK_OFFSET     (0x00cc)
#define IMXRT_INPUT_LPSR_SAI4_RX_DATA0_OFFSET    (0x00d0)
#define IMXRT_INPUT_LPSR_SAI4_RX_SYNC_OFFSET     (0x00d4)
#define IMXRT_INPUT_LPSR_SAI4_TX_BCLK_OFFSET     (0x00d8)
#define IMXRT_INPUT_LPSR_SAI4_TX_SYNC_OFFSET     (0x00dc)

