apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
/* Register Addresses *******************************************************/

/* IOMUXC GPR Register Addresses */

#define IMXRT_IOMUXC_GPR_GPR0                    (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR0_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR1                    (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR1_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR2                    (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR2_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR3                    (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR3_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR4                    (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR4_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR5                    (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR5_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR6                    (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR6_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR7                    (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR7_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR8                    (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR8_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR9                    (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR9_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR10                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR10_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR11                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR11_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR12                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR12_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR13                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR13_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR14                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR14_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR15                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR15_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR16                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR16_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR17                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR17_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR18                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR18_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR20                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR20_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR21                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR21_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR22                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR22_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR23                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR23_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR24                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR24_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR25                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR25_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR26                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR26_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR27                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR27_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR28                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR28_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR29                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR29_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR30                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR30_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR31                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR31_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR32                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR32_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR33                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR33_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR34                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR34_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR35                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR35_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR36                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR36_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR37                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR37_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR38                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR38_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR39                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR39_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR40                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR40_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR41                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR41_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR42                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR42_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR43                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR43_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR44                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR44_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR45                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR45_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR46                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR46_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR47                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR47_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR48                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR48_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR49                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR49_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR50                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR50_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR51                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR51_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR52                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR52_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR53                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR53_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR54                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR54_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR55                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR55_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR59                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR59_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR62                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR62_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR63                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR63_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR64                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR64_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR65                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR65_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR66                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR66_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR67                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR67_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR68                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR68_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR69                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR69_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR70                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR70_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR71                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR71_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR72                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR72_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR73                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR73_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR74                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR74_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR75                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR75_OFFSET)
#define IMXRT_IOMUXC_GPR_GPR76                   (IMXRT_IOMUXCGPR_BASE + IMXRT_IOMUXC_GPR_GPR76_OFFSET)

/* IOMUXC LPSR GPR Register Addresses */

#define IMXRT_IOMUXC_LPSR_GPR_GPR26              (IMXRT_IOMUXCLPSRGPR_BASE + IMXRT_IOMUXC_LPSR_GPR_GPR26_OFFSET)
#define IMXRT_IOMUXC_LPSR_GPR_GPR33              (IMXRT_IOMUXCLPSRGPR_BASE + IMXRT_IOMUXC_LPSR_GPR_GPR33_OFFSET)
#define IMXRT_IOMUXC_LPSR_GPR_GPR34              (IMXRT_IOMUXCLPSRGPR_BASE + IMXRT_IOMUXC_LPSR_GPR_GPR34_OFFSET)
#define IMXRT_IOMUXC_LPSR_GPR_GPR35              (IMXRT_IOMUXCLPSRGPR_BASE + IMXRT_IOMUXC_LPSR_GPR_GPR35_OFFSET)
#define IMXRT_IOMUXC_LPSR_GPR_GPR36              (IMXRT_IOMUXCLPSRGPR_BASE + IMXRT_IOMUXC_LPSR_GPR_GPR36_OFFSET)
#define IMXRT_IOMUXC_LPSR_GPR_GPR37              (IMXRT_IOMUXCLPSRGPR_BASE + IMXRT_IOMUXC_LPSR_GPR_GPR37_OFFSET)
#define IMXRT_IOMUXC_LPSR_GPR_GPR38              (IMXRT_IOMUXCLPSRGPR_BASE + IMXRT_IOMUXC_LPSR_GPR_GPR38_OFFSET)
#define IMXRT_IOMUXC_LPSR_GPR_GPR39              (IMXRT_IOMUXCLPSRGPR_BASE + IMXRT_IOMUXC_LPSR_GPR_GPR39_OFFSET)
#define IMXRT_IOMUXC_LPSR_GPR_GPR40              (IMXRT_IOMUXCLPSRGPR_BASE + IMXRT_IOMUXC_LPSR_GPR_GPR40_OFFSET)
#define IMXRT_IOMUXC_LPSR_GPR_GPR41              (IMXRT_IOMUXCLPSRGPR_BASE + IMXRT_IOMUXC_LPSR_GPR_GPR41_OFFSET)

/* IOMUXC Pad Mux Register Addresses */

#define IMXRT_PADMUX_ADDRESS(n)                  (IMXRT_IOMUXC_BASE + IMXRT_PADMUX_OFFSET(n))

