apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define IMXRT_PADMUX_ADDRESS_LPSR(n)             (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_OFFSET_LPSR(n))

#define IMXRT_PADMUX_GPIO_LPSR_00                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_00_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_01                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_01_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_02                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_02_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_03                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_03_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_04                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_04_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_05                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_05_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_06                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_06_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_07                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_07_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_08                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_08_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_09                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_09_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_10                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_10_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_11                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_11_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_12                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_12_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_13                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_13_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_14                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_14_OFFSET)
#define IMXRT_PADMUX_GPIO_LPSR_15                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADMUX_GPIO_LPSR_15_OFFSET)

/* IOMUXC Pad Control Register Addresses */

#define IMXRT_PADCTL_ADDRESS(n)                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_OFFSET(n))

#define IMXRT_PADCTL_GPIO_EMC_B1_00              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_00_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_01              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_01_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_02              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_02_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_03              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_03_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_04              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_04_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_05              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_05_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_06              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_06_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_07              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_07_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_08              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_08_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_09              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_09_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_10              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_10_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_11              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_11_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_12              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_12_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_13              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_13_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_14              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_14_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_15              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_15_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_16              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_16_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_17              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_17_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_18              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_18_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_19              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_19_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_20              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_20_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_21              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_21_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_22              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_22_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_23              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_23_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_24              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_24_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_25              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_25_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_26              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_26_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_27              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_27_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_28              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_28_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_29              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_29_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_30              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_30_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_31              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_31_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_32              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_32_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_33              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_33_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_34              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_34_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_35              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_35_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_36              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_36_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_37              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_37_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_38              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_38_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_39              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_39_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_40              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_40_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B1_41              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B1_41_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_00              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_00_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_01              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_01_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_02              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_02_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_03              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_03_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_04              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_04_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_05              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_05_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_06              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_06_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_07              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_07_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_08              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_08_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_09              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_09_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_10              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_10_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_11              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_11_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_12              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_12_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_13              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_13_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_14              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_14_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_15              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_15_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_16              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_16_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_17              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_17_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_18              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_18_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_19              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_19_OFFSET)
#define IMXRT_PADCTL_GPIO_EMC_B2_20              (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_EMC_B2_20_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_00                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_00_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_01                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_01_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_02                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_02_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_03                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_03_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_04                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_04_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_05                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_05_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_06                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_06_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_07                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_07_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_08                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_08_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_09                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_09_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_10                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_10_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_11                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_11_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_12                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_12_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_13                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_13_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_14                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_14_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_15                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_15_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_16                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_16_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_17                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_17_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_18                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_18_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_19                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_19_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_20                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_20_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_21                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_21_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_22                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_22_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_23                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_23_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_24                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_24_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_25                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_25_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_26                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_26_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_27                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_27_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_28                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_28_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_29                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_29_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_30                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_30_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_31                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_31_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_32                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_32_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_33                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_33_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_34                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_34_OFFSET)
#define IMXRT_PADCTL_GPIO_AD_35                  (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_AD_35_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B1_00               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B1_00_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B1_01               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B1_01_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B1_02               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B1_02_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B1_03               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B1_03_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B1_04               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B1_04_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B1_05               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B1_05_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B2_00               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B2_00_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B2_01               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B2_01_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B2_02               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B2_02_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B2_03               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B2_03_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B2_04               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B2_04_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B2_05               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B2_05_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B2_06               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B2_06_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B2_07               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B2_07_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B2_08               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B2_08_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B2_09               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B2_09_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B2_10               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B2_10_OFFSET)
#define IMXRT_PADCTL_GPIO_SD_B2_11               (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_SD_B2_11_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B1_00             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B1_00_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B1_01             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B1_01_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B1_02             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B1_02_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B1_03             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B1_03_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B1_04             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B1_04_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B1_05             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B1_05_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B1_06             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B1_06_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B1_07             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B1_07_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B1_08             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B1_08_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B1_09             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B1_09_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B1_10             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B1_10_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B1_11             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B1_11_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_00             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_00_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_01             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_01_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_02             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_02_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_03             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_03_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_04             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_04_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_05             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_05_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_06             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_06_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_07             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_07_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_08             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_08_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_09             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_09_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_10             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_10_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_11             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_11_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_12             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_12_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_13             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_13_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_14             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_14_OFFSET)
#define IMXRT_PADCTL_GPIO_DISP_B2_15             (IMXRT_IOMUXC_BASE + IMXRT_PADCTL_GPIO_DISP_B2_15_OFFSET)

/* IOMUXC_SNVS Pad Control Register Addresses */

#define IMXRT_PADCTL_ADDRESS_SNVS(n)             (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_OFFSET_SNVS(n))

#define IMXRT_PADCTL_TEST_MODE                   (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_TEST_MODE_OFFSET)
#define IMXRT_PADCTL_POR_B                       (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_POR_B_OFFSET)
#define IMXRT_PADCTL_ONOFF                       (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_ONOFF_OFFSET)
#define IMXRT_PADCTL_WAKEUP                      (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_WAKEUP_OFFSET)
#define IMXRT_PADCTL_PMIC_ON_REQ                 (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_PMIC_ON_REQ_OFFSET)
#define IMXRT_PADCTL_PMIC_STBY_REQ               (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_PMIC_STBY_REQ_OFFSET)
#define IMXRT_PADCTL_GPIO_SNVS_00                (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_GPIO_SNVS_00_OFFSET)
#define IMXRT_PADCTL_GPIO_SNVS_01                (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_GPIO_SNVS_01_OFFSET)
#define IMXRT_PADCTL_GPIO_SNVS_02                (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_GPIO_SNVS_02_OFFSET)
#define IMXRT_PADCTL_GPIO_SNVS_03                (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_GPIO_SNVS_03_OFFSET)
#define IMXRT_PADCTL_GPIO_SNVS_04                (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_GPIO_SNVS_04_OFFSET)
#define IMXRT_PADCTL_GPIO_SNVS_05                (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_GPIO_SNVS_05_OFFSET)
#define IMXRT_PADCTL_GPIO_SNVS_06                (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_GPIO_SNVS_06_OFFSET)
#define IMXRT_PADCTL_GPIO_SNVS_07                (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_GPIO_SNVS_07_OFFSET)
#define IMXRT_PADCTL_GPIO_SNVS_08                (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_GPIO_SNVS_08_OFFSET)
#define IMXRT_PADCTL_GPIO_SNVS_09                (IMXRT_IOMUXCSNVS_BASE + IMXRT_PADCTL_GPIO_SNVS_09_OFFSET)

