apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
/* IOMUXC_LPSR Pad Control Register Addresses */

#define IMXRT_PADCTL_ADDRESS_LPSR(n)             (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_OFFSET_LPSR(n))

#define IMXRT_PADCTL_GPIO_LPSR_00                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_00_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_01                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_01_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_02                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_02_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_03                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_03_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_04                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_04_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_05                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_05_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_06                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_06_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_07                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_07_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_08                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_08_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_09                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_09_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_10                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_10_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_11                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_11_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_12                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_12_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_13                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_13_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_14                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_14_OFFSET)
#define IMXRT_PADCTL_GPIO_LPSR_15                (IMXRT_IOMUXCLPSR_BASE + IMXRT_PADCTL_GPIO_LPSR_15_OFFSET)

/* IOMUXC Select Input Daisy Chain Registers */

#define IMXRT_INPUT_FLEXCAN1_RX                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXCAN1_RX_OFFSET)
#define IMXRT_INPUT_FLEXCAN2_RX                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXCAN2_RX_OFFSET)
#define IMXRT_INPUT_CCM_ENET_QOS_REFCLK          (IMXRT_IOMUXC_BASE + IMXRT_INPUT_CCM_ENET_QOS_REFCLK_OFFSET)
#define IMXRT_INPUT_CCM_ENET_QOS_TXCLK           (IMXRT_IOMUXC_BASE + IMXRT_INPUT_CCM_ENET_QOS_TXCLK_OFFSET)
#define IMXRT_INPUT_ENET_IPG_CLK_RMII            (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_IPG_CLK_RMII_OFFSET)
#define IMXRT_INPUT_ENET_MDIO                    (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_MDIO_OFFSET)
#define IMXRT_INPUT_ENET_RXDATA0                 (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_RXDATA0_OFFSET)
#define IMXRT_INPUT_ENET_RXDATA1                 (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_RXDATA1_OFFSET)
#define IMXRT_INPUT_ENET_RXEN                    (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_RXEN_OFFSET)
#define IMXRT_INPUT_ENET_RXERR                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_RXERR_OFFSET)
#define IMXRT_INPUT_ENET_TXCLK                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_TXCLK_OFFSET)
#define IMXRT_INPUT_ENET_1G_IPG_CLK_RMII         (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_1G_IPG_CLK_RMII_OFFSET)
#define IMXRT_INPUT_ENET_1G_MDIO                 (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_1G_MDIO_OFFSET)
#define IMXRT_INPUT_ENET_1G_RXCLK                (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_1G_RXCLK_OFFSET)
#define IMXRT_INPUT_ENET_1G_RXDATA0              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_1G_RXDATA0_OFFSET)
#define IMXRT_INPUT_ENET_1G_RXDATA1              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_1G_RXDATA1_OFFSET)
#define IMXRT_INPUT_ENET_1G_RXDATA2              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_1G_RXDATA2_OFFSET)
#define IMXRT_INPUT_ENET_1G_RXDATA3              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_1G_RXDATA3_OFFSET)
#define IMXRT_INPUT_ENET_1G_RXEN                 (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_1G_RXEN_OFFSET)
#define IMXRT_INPUT_ENET_1G_RXERR                (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_1G_RXERR_OFFSET)
#define IMXRT_INPUT_ENET_1G_TXCLK                (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_1G_TXCLK_OFFSET)
#define IMXRT_INPUT_ENET_QOS_MDIO                (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_QOS_MDIO_OFFSET)
#define IMXRT_INPUT_ENET_QOS_RXDATA0             (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_QOS_RXDATA0_OFFSET)
#define IMXRT_INPUT_ENET_QOS_RXDATA1             (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_QOS_RXDATA1_OFFSET)
#define IMXRT_INPUT_ENET_QOS_RXDV                (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_QOS_RXDV_OFFSET)
#define IMXRT_INPUT_ENET_QOS_RXERR               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET_QOS_RXERR_OFFSET)
#define IMXRT_INPUT_FLEXPWM1_PWMA0               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM1_PWMA0_OFFSET)
#define IMXRT_INPUT_FLEXPWM1_PWMA1               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM1_PWMA1_OFFSET)
#define IMXRT_INPUT_FLEXPWM1_PWMA2               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM1_PWMA2_OFFSET)
#define IMXRT_INPUT_FLEXPWM1_PWMB0               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM1_PWMB0_OFFSET)
#define IMXRT_INPUT_FLEXPWM1_PWMB1               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM1_PWMB1_OFFSET)
#define IMXRT_INPUT_FLEXPWM1_PWMB2               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM1_PWMB2_OFFSET)
#define IMXRT_INPUT_FLEXPWM2_PWMA0               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM2_PWMA0_OFFSET)
#define IMXRT_INPUT_FLEXPWM2_PWMA1               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM2_PWMA1_OFFSET)
#define IMXRT_INPUT_FLEXPWM2_PWMA2               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM2_PWMA2_OFFSET)
#define IMXRT_INPUT_FLEXPWM2_PWMB0               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM2_PWMB0_OFFSET)
#define IMXRT_INPUT_FLEXPWM2_PWMB1               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM2_PWMB1_OFFSET)
#define IMXRT_INPUT_FLEXPWM2_PWMB2               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM2_PWMB2_OFFSET)
#define IMXRT_INPUT_FLEXPWM3_PWMA0               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM3_PWMA0_OFFSET)
#define IMXRT_INPUT_FLEXPWM3_PWMA1               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM3_PWMA1_OFFSET)
#define IMXRT_INPUT_FLEXPWM3_PWMA2               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM3_PWMA2_OFFSET)
#define IMXRT_INPUT_FLEXPWM3_PWMA3               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM3_PWMA3_OFFSET)
#define IMXRT_INPUT_FLEXPWM3_PWMB0               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM3_PWMB0_OFFSET)
#define IMXRT_INPUT_FLEXPWM3_PWMB1               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM3_PWMB1_OFFSET)
#define IMXRT_INPUT_FLEXPWM3_PWMB2               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM3_PWMB2_OFFSET)
#define IMXRT_INPUT_FLEXPWM3_PWMB3               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXPWM3_PWMB3_OFFSET)
#define IMXRT_INPUT_FLEXSPI1A_DQS                (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI1A_DQS_OFFSET)
#define IMXRT_INPUT_FLEXSPI1A_DATA0              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI1A_DATA0_OFFSET)
#define IMXRT_INPUT_FLEXSPI1A_DATA1              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI1A_DATA1_OFFSET)
#define IMXRT_INPUT_FLEXSPI1A_DATA2              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI1A_DATA2_OFFSET)
#define IMXRT_INPUT_FLEXSPI1A_DATA3              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI1A_DATA3_OFFSET)
#define IMXRT_INPUT_FLEXSPI1B_DATA0              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI1B_DATA0_OFFSET)
#define IMXRT_INPUT_FLEXSPI1B_DATA1              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI1B_DATA1_OFFSET)
#define IMXRT_INPUT_FLEXSPI1B_DATA2              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI1B_DATA2_OFFSET)
#define IMXRT_INPUT_FLEXSPI1B_DATA3              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI1B_DATA3_OFFSET)
#define IMXRT_INPUT_FLEXSPI1A_SCK                (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI1A_SCK_OFFSET)
#define IMXRT_INPUT_FLEXSPI1B_SCK                (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI1B_SCK_OFFSET)
#define IMXRT_INPUT_FLEXSPI2A_DATA0              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2A_DATA0_OFFSET)
#define IMXRT_INPUT_FLEXSPI2A_DATA1              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2A_DATA1_OFFSET)
#define IMXRT_INPUT_FLEXSPI2A_DATA2              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2A_DATA2_OFFSET)
#define IMXRT_INPUT_FLEXSPI2A_DATA3              (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2A_DATA3_OFFSET)
#define IMXRT_INPUT_FLEXSPI2A_SCK                (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2A_SCK_OFFSET)
#define IMXRT_INPUT_GPT3_CAPIN1                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_GPT3_CAPIN1_OFFSET)
#define IMXRT_INPUT_GPT3_CAPIN2                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_GPT3_CAPIN2_OFFSET)
#define IMXRT_INPUT_GPT3_CLKIN                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_GPT3_CLKIN_OFFSET)
#define IMXRT_INPUT_KPP_COL6                     (IMXRT_IOMUXC_BASE + IMXRT_INPUT_KPP_COL6_OFFSET)
#define IMXRT_INPUT_KPP_COL7                     (IMXRT_IOMUXC_BASE + IMXRT_INPUT_KPP_COL7_OFFSET)
#define IMXRT_INPUT_KPP_ROW6                     (IMXRT_IOMUXC_BASE + IMXRT_INPUT_KPP_ROW6_OFFSET)
#define IMXRT_INPUT_KPP_ROW7                     (IMXRT_IOMUXC_BASE + IMXRT_INPUT_KPP_ROW7_OFFSET)
#define IMXRT_INPUT_LPI2C1_SCL                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPI2C1_SCL_OFFSET)
#define IMXRT_INPUT_LPI2C1_SDA                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPI2C1_SDA_OFFSET)
#define IMXRT_INPUT_LPI2C2_SCL                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPI2C2_SCL_OFFSET)
#define IMXRT_INPUT_LPI2C2_SDA                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPI2C2_SDA_OFFSET)
#define IMXRT_INPUT_LPI2C3_SCL                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPI2C3_SCL_OFFSET)
#define IMXRT_INPUT_LPI2C3_SDA                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPI2C3_SDA_OFFSET)
#define IMXRT_INPUT_LPI2C4_SCL                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPI2C4_SCL_OFFSET)
#define IMXRT_INPUT_LPI2C4_SDA                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPI2C4_SDA_OFFSET)
#define IMXRT_INPUT_LPSPI1_PCS0                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI1_PCS0_OFFSET)
#define IMXRT_INPUT_LPSPI1_SCK                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI1_SCK_OFFSET)
#define IMXRT_INPUT_LPSPI1_SDI                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI1_SDI_OFFSET)
#define IMXRT_INPUT_LPSPI1_SDO                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI1_SDO_OFFSET)
#define IMXRT_INPUT_LPSPI2_PCS0                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI2_PCS0_OFFSET)
#define IMXRT_INPUT_LPSPI2_PCS1                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI2_PCS1_OFFSET)
#define IMXRT_INPUT_LPSPI2_SCK                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI2_SCK_OFFSET)
#define IMXRT_INPUT_LPSPI2_SDI                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI2_SDI_OFFSET)
#define IMXRT_INPUT_LPSPI2_SDO                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI2_SDO_OFFSET)
#define IMXRT_INPUT_LPSPI3_PCS0                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI3_PCS0_OFFSET)
#define IMXRT_INPUT_LPSPI3_PCS1                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI3_PCS1_OFFSET)
#define IMXRT_INPUT_LPSPI3_PCS2                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI3_PCS2_OFFSET)
#define IMXRT_INPUT_LPSPI3_PCS3                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI3_PCS3_OFFSET)
#define IMXRT_INPUT_LPSPI3_SCK                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI3_SCK_OFFSET)
#define IMXRT_INPUT_LPSPI3_SDI                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI3_SDI_OFFSET)
#define IMXRT_INPUT_LPSPI3_SDO                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI3_SDO_OFFSET)
#define IMXRT_INPUT_LPSPI4_PCS0                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI4_PCS0_OFFSET)
#define IMXRT_INPUT_LPSPI4_SCK                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI4_SCK_OFFSET)
#define IMXRT_INPUT_LPSPI4_SDI                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI4_SDI_OFFSET)
#define IMXRT_INPUT_LPSPI4_SDO                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPSPI4_SDO_OFFSET)
#define IMXRT_INPUT_LPUART1_RX                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPUART1_RX_OFFSET)
#define IMXRT_INPUT_LPUART1_TX                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPUART1_TX_OFFSET)
#define IMXRT_INPUT_LPUART10_RX                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPUART10_RX_OFFSET)
#define IMXRT_INPUT_LPUART10_TX                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPUART10_TX_OFFSET)
#define IMXRT_INPUT_LPUART7_RX                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPUART7_RX_OFFSET)
#define IMXRT_INPUT_LPUART7_TX                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPUART7_TX_OFFSET)
#define IMXRT_INPUT_LPUART8_RX                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPUART8_RX_OFFSET)
#define IMXRT_INPUT_LPUART8_TX                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_LPUART8_TX_OFFSET)
#define IMXRT_INPUT_QTIMER1_TIMER0               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_QTIMER1_TIMER0_OFFSET)
#define IMXRT_INPUT_QTIMER1_TIMER1               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_QTIMER1_TIMER1_OFFSET)
#define IMXRT_INPUT_QTIMER1_TIMER2               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_QTIMER1_TIMER2_OFFSET)
#define IMXRT_INPUT_QTIMER2_TIMER0               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_QTIMER2_TIMER0_OFFSET)
#define IMXRT_INPUT_QTIMER2_TIMER1               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_QTIMER2_TIMER1_OFFSET)
#define IMXRT_INPUT_QTIMER2_TIMER2               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_QTIMER2_TIMER2_OFFSET)
#define IMXRT_INPUT_QTIMER3_TIMER0               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_QTIMER3_TIMER0_OFFSET)
#define IMXRT_INPUT_QTIMER3_TIMER1               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_QTIMER3_TIMER1_OFFSET)
#define IMXRT_INPUT_QTIMER3_TIMER2               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_QTIMER3_TIMER2_OFFSET)
#define IMXRT_INPUT_QTIMER4_TIMER0               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_QTIMER4_TIMER0_OFFSET)
#define IMXRT_INPUT_QTIMER4_TIMER1               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_QTIMER4_TIMER1_OFFSET)
#define IMXRT_INPUT_QTIMER4_TIMER2               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_QTIMER4_TIMER2_OFFSET)
#define IMXRT_INPUT_SAI1_MCLK                    (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SAI1_MCLK_OFFSET)
#define IMXRT_INPUT_SAI1_RX_BCLK                 (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SAI1_RX_BCLK_OFFSET)
#define IMXRT_INPUT_SAI1_RX_DATA0                (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SAI1_RX_DATA0_OFFSET)
#define IMXRT_INPUT_SAI1_RX_SYNC                 (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SAI1_RX_SYNC_OFFSET)
#define IMXRT_INPUT_SAI1_TX_BCLK                 (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SAI1_TX_BCLK_OFFSET)
#define IMXRT_INPUT_SAI1_TX_SYNC                 (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SAI1_TX_SYNC_OFFSET)
#define IMXRT_INPUT_EMVSIM1_SIO                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_EMVSIM1_SIO_OFFSET)
#define IMXRT_INPUT_EMVSIM1_SIMPD                (IMXRT_IOMUXC_BASE + IMXRT_INPUT_EMVSIM1_SIMPD_OFFSET)
#define IMXRT_INPUT_EMVSIM1_POWER_FAIL           (IMXRT_IOMUXC_BASE + IMXRT_INPUT_EMVSIM1_POWER_FAIL_OFFSET)
#define IMXRT_INPUT_EMVSIM2_SIO                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_EMVSIM2_SIO_OFFSET)
#define IMXRT_INPUT_EMVSIM2_SIMPD                (IMXRT_IOMUXC_BASE + IMXRT_INPUT_EMVSIM2_SIMPD_OFFSET)
#define IMXRT_INPUT_EMVSIM2_POWER_FAIL           (IMXRT_IOMUXC_BASE + IMXRT_INPUT_EMVSIM2_POWER_FAIL_OFFSET)
#define IMXRT_INPUT_SPDIF_IN                     (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SPDIF_IN_OFFSET)
#define IMXRT_INPUT_USB_OTG2_OC                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_USB_OTG2_OC_OFFSET)
#define IMXRT_INPUT_USB_OTG1_OC                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_USB_OTG1_OC_OFFSET)
#define IMXRT_INPUT_USBPHY1_USB_ID               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_USBPHY1_USB_ID_OFFSET)
#define IMXRT_INPUT_USBPHY2_USB_ID               (IMXRT_IOMUXC_BASE + IMXRT_INPUT_USBPHY2_USB_ID_OFFSET)
#define IMXRT_INPUT_USDHC1_CD_B                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_USDHC1_CD_B_OFFSET)
#define IMXRT_INPUT_USDHC1_WP                    (IMXRT_IOMUXC_BASE + IMXRT_INPUT_USDHC1_WP_OFFSET)
#define IMXRT_INPUT_USDHC2_CD_B                  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_USDHC2_CD_B_OFFSET)
#define IMXRT_INPUT_USDHC2_WP                    (IMXRT_IOMUXC_BASE + IMXRT_INPUT_USDHC2_WP_OFFSET)
#define IMXRT_INPUT_XBAR1_IN20                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN20_OFFSET)
#define IMXRT_INPUT_XBAR1_IN21                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN21_OFFSET)
#define IMXRT_INPUT_XBAR1_IN22                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN22_OFFSET)
#define IMXRT_INPUT_XBAR1_IN23                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN23_OFFSET)
#define IMXRT_INPUT_XBAR1_IN24                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN24_OFFSET)
#define IMXRT_INPUT_XBAR1_IN25                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN25_OFFSET)
#define IMXRT_INPUT_XBAR1_IN26                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN26_OFFSET)
#define IMXRT_INPUT_XBAR1_IN27                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN27_OFFSET)
#define IMXRT_INPUT_XBAR1_IN28                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN28_OFFSET)
#define IMXRT_INPUT_XBAR1_IN29                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN29_OFFSET)
#define IMXRT_INPUT_XBAR1_IN30                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN30_OFFSET)
#define IMXRT_INPUT_XBAR1_IN31                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN31_OFFSET)
#define IMXRT_INPUT_XBAR1_IN32                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN32_OFFSET)
#define IMXRT_INPUT_XBAR1_IN33                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN33_OFFSET)
#define IMXRT_INPUT_XBAR1_IN34                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN34_OFFSET)
#define IMXRT_INPUT_XBAR1_IN35                   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_XBAR1_IN35_OFFSET)

/* IOMUXC_LPSR Select Input Daisy Chain Registers */

#define IMXRT_INPUT_LPSR_FLEXCAN3_RX             (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_FLEXCAN3_RX_OFFSET)
#define IMXRT_INPUT_LPSR_LPI2C5_SCL              (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_LPI2C5_SCL_OFFSET)
#define IMXRT_INPUT_LPSR_LPI2C5_SDA              (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_LPI2C5_SDA_OFFSET)
#define IMXRT_INPUT_LPSR_LPI2C6_SCL              (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_LPI2C6_SCL_OFFSET)
#define IMXRT_INPUT_LPSR_LPI2C6_SDA              (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_LPI2C6_SDA_OFFSET)
#define IMXRT_INPUT_LPSR_LPSPI5_PCS0             (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_LPSPI5_PCS0_OFFSET)
#define IMXRT_INPUT_LPSR_LPSPI5_SCK              (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_LPSPI5_SCK_OFFSET)
#define IMXRT_INPUT_LPSR_LPSPI5_SDI              (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_LPSPI5_SDI_OFFSET)
#define IMXRT_INPUT_LPSR_LPSPI5_SDO              (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_LPSPI5_SDO_OFFSET)
#define IMXRT_INPUT_LPSR_LPUART11_RX             (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_LPUART11_RX_OFFSET)
#define IMXRT_INPUT_LPSR_LPUART11_TX             (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_LPUART11_TX_OFFSET)
#define IMXRT_INPUT_LPSR_LPUART12_RX             (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_LPUART12_RX_OFFSET)
#define IMXRT_INPUT_LPSR_LPUART12_TX             (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_LPUART12_TX_OFFSET)
#define IMXRT_INPUT_LPSR_PDM_BITSTREAM0          (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_PDM_BITSTREAM0_OFFSET)
#define IMXRT_INPUT_LPSR_PDM_BITSTREAM1          (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_PDM_BITSTREAM1_OFFSET)
#define IMXRT_INPUT_LPSR_PDM_BITSTREAM2          (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_PDM_BITSTREAM2_OFFSET)
#define IMXRT_INPUT_LPSR_PDM_BITSTREAM3          (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_PDM_BITSTREAM3_OFFSET)
#define IMXRT_INPUT_LPSR_NMI_GLUE_NMI            (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_NMI_GLUE_NMI_OFFSET)
#define IMXRT_INPUT_LPSR_SAI4_MCLK               (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_SAI4_MCLK_OFFSET)
#define IMXRT_INPUT_LPSR_SAI4_RX_BCLK            (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_SAI4_RX_BCLK_OFFSET)
#define IMXRT_INPUT_LPSR_SAI4_RX_DATA0           (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_SAI4_RX_DATA0_OFFSET)
#define IMXRT_INPUT_LPSR_SAI4_RX_SYNC            (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_SAI4_RX_SYNC_OFFSET)
#define IMXRT_INPUT_LPSR_SAI4_TX_BCLK            (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_SAI4_TX_BCLK_OFFSET)
#define IMXRT_INPUT_LPSR_SAI4_TX_SYNC            (IMXRT_IOMUXCLPSR_BASE + IMXRT_INPUT_LPSR_SAI4_TX_SYNC_OFFSET)

/* Register Bit Definitions *************************************************/

/* Pad MUX Registers */

#define PADMUX_MUXMODE_SHIFT              (0)       /* Bit 0-3:    MUX Mode Select Field (MUX_MODE) */
#define PADMUX_MUXMODE_MASK               (0x0f << PADMUX_MUXMODE_SHIFT)
#  define PADMUX_MUXMODE_ALT0             (0 << PADMUX_MUXMODE_SHIFT)
#  define PADMUX_MUXMODE_ALT1             (1 << PADMUX_MUXMODE_SHIFT)
#  define PADMUX_MUXMODE_ALT2             (2 << PADMUX_MUXMODE_SHIFT)
#  define PADMUX_MUXMODE_ALT3             (3 << PADMUX_MUXMODE_SHIFT)
#  define PADMUX_MUXMODE_ALT4             (4 << PADMUX_MUXMODE_SHIFT)
#  define PADMUX_MUXMODE_ALT5             (5 << PADMUX_MUXMODE_SHIFT)
#  define PADMUX_MUXMODE_ALT6             (6 << PADMUX_MUXMODE_SHIFT)
#  define PADMUX_MUXMODE_ALT7             (7 << PADMUX_MUXMODE_SHIFT)
#  define PADMUX_MUXMODE_ALT8             (8 << PADMUX_MUXMODE_SHIFT)
#  define PADMUX_MUXMODE_ALT9             (9 << PADMUX_MUXMODE_SHIFT)
#  define PADMUX_MUXMODE_ALT10            (10 << PADMUX_MUXMODE_SHIFT)
#  define PADMUX_MUXMODE_ALT11            (11 << PADMUX_MUXMODE_SHIFT)
#define PADMUX_SION                       (1 << 4)  /* Bit 4:      Software Input On Field (SION) */
                                                    /* Bits 5-31:  Reserved */

