apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
                                                    /* Bit 0:      Reserved */
#define PADCTL_SD_DISP_B1_PDRV                 (1 << 1)  /* Bit 1:      PDRV Field (PDRV) */
#define PADCTL_SD_DISP_B1_PULL_SHIFT           (2)       /* Bits 2-3:   Pull Down / Pull Up Field (PULL) */
#define PADCTL_SD_DISP_B1_PULL_MASK            (0x03 << PADCTL_SD_DISP_B1_PULL_SHIFT)
#  define PADCTL_SD_DISP_B1_PULL_UP            (0x01 << PADCTL_SD_DISP_B1_PULL_SHIFT) /* Internal pullup resistor enabled */
#  define PADCTL_SD_DISP_B1_PULL_DOWN          (0x02 << PADCTL_SD_DISP_B1_PULL_SHIFT) /* Internal pulldown resistor enabled */
#  define PADCTL_SD_DISP_B1_PULL_NONE          (0x03 << PADCTL_SD_DISP_B1_PULL_SHIFT) /* No pull */

#define PADCTL_SD_DISP_B1_ODE                  (1 << 4)  /* Bit 4:      Open Drain Field (ODE) */
                                                         /* Bits 5-27:  Reserved */
#define PADCTL_SD_DISP_B1_DWP_SHIFT            (28)      /* Bits 28-29: Domain write protection (DWP) */
#define PADCTL_SD_DISP_B1_DWP_MASK             (0x03 << PADCTL_SD_DISP_B1_DWP_SHIFT)
#  define PADCTL_SD_DISP_B1_DWP_ALLOWBOTH      (0x00 << PADCTL_SD_DISP_B1_DWP_SHIFT) /* Both cores are allowed */
#  define PADCTL_SD_DISP_B1_DWP_DENYCM7        (0x01 << PADCTL_SD_DISP_B1_DWP_SHIFT) /* CM7 is forbidden */
#  define PADCTL_SD_DISP_B1_DWP_DENYCM4        (0x02 << PADCTL_SD_DISP_B1_DWP_SHIFT) /* CM4 is forbidden */
#  define PADCTL_SD_DISP_B1_DWP_DENYBOTH       (0x03 << PADCTL_SD_DISP_B1_DWP_SHIFT) /* Both cores are forbidden */

#define PADCTL_SD_DISP_B1_DWP_LOCK_SHIFT       (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define PADCTL_SD_DISP_B1_DWP_LOCK_MASK        (0x03 << PADCTL_SD_DISP_B1_DWP_LOCK_SHIFT)
#  define PADCTL_SD_DISP_B1_DWP_LOCK_NOLCK     (0x00 << PADCTL_SD_DISP_B1_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define PADCTL_SD_DISP_B1_DWP_LOCK_LCKLO     (0x01 << PADCTL_SD_DISP_B1_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define PADCTL_SD_DISP_B1_DWP_LOCK_LCKHI     (0x02 << PADCTL_SD_DISP_B1_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define PADCTL_SD_DISP_B1_DWP_LOCK_LCKBOTH   (0x03 << PADCTL_SD_DISP_B1_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* GPIO_SD_B2 Pad CTL Registers */

                                                    /* Bit 0:      Reserved */
#define PADCTL_SD_B2_PDRV                 (1 << 1)  /* Bit 1:      PDRV Field (PDRV) */
#define PADCTL_SD_B2_PULL_SHIFT           (2)       /* Bits 2-3:   Pull Down / Pull Up Field (PULL) */
#define PADCTL_SD_B2_PULL_MASK            (0x03 << PADCTL_SD_B2_PULL_SHIFT)
#  define PADCTL_SD_B2_PULL_UP            (0x01 << PADCTL_SD_B2_PULL_SHIFT) /* Internal pullup resistor enabled */
#  define PADCTL_SD_B2_PULL_DOWN          (0x02 << PADCTL_SD_B2_PULL_SHIFT) /* Internal pulldown resistor enabled */
#  define PADCTL_SD_B2_PULL_NONE          (0x03 << PADCTL_SD_B2_PULL_SHIFT) /* No pull */

#define PADCTL_SD_B2_ODE                  (1 << 4)  /* Bit 4:      Open Drain Field (ODE) */
                                                    /* Bits 5-27:  Reserved */
#define PADCTL_SD_B2_DWP_SHIFT            (28)      /* Bits 28-29: Domain write protection (DWP) */
#define PADCTL_SD_B2_DWP_MASK             (0x03 << PADCTL_SD_B2_DWP_SHIFT)
#  define PADCTL_SD_B2_DWP_ALLOWBOTH      (0x00 << PADCTL_SD_B2_DWP_SHIFT) /* Both cores are allowed */
#  define PADCTL_SD_B2_DWP_DENYCM7        (0x01 << PADCTL_SD_B2_DWP_SHIFT) /* CM7 is forbidden */
#  define PADCTL_SD_B2_DWP_DENYCM4        (0x02 << PADCTL_SD_B2_DWP_SHIFT) /* CM4 is forbidden */
#  define PADCTL_SD_B2_DWP_DENYBOTH       (0x03 << PADCTL_SD_B2_DWP_SHIFT) /* Both cores are forbidden */

#define PADCTL_SD_B2_DWP_LOCK_SHIFT       (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define PADCTL_SD_B2_DWP_LOCK_MASK        (0x03 << PADCTL_SD_B2_DWP_LOCK_SHIFT)
#  define PADCTL_SD_B2_DWP_LOCK_NOLCK     (0x00 << PADCTL_SD_B2_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define PADCTL_SD_B2_DWP_LOCK_LCKLO     (0x01 << PADCTL_SD_B2_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define PADCTL_SD_B2_DWP_LOCK_LCKHI     (0x02 << PADCTL_SD_B2_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define PADCTL_SD_B2_DWP_LOCK_LCKBOTH   (0x03 << PADCTL_SD_B2_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* GPIO_DISP_B2 Pad CTL Registers */

#define PADCTL_DISP_B2_SRE                (1 << 0)  /* Bit 0:      Slew Rate Field (SRE) */
#define PADCTL_DISP_B2_DSE                (1 << 1)  /* Bit 1:      Drive Strength Field (DSE) */
#define PADCTL_DISP_B2_PUE                (1 << 2)  /* Bit 2:      Pull / Keep Select Field (PUE) */
#define PADCTL_DISP_B2_PUS                (1 << 3)  /* Bit 3:      Pull Up / Down Config. Field (PUS) */
#  define PADCTL_DISP_B2_PULL_DOWN        (0 << 3)  /*             Weak pull down */
#  define PADCTL_DISP_B2_PULL_UP          (1 << 3)  /*             Weak pull up */
#define PADCTL_DISP_B2_ODE                (1 << 4)  /* Bit 4:      Open Drain Field (ODE) */
                                                    /* Bits 5-27:  Reserved */
#define PADCTL_DISP_B2_DWP_SHIFT          (28)      /* Bits 28-29: Domain write protection (DWP) */
#define PADCTL_DISP_B2_DWP_MASK           (0x03 << PADCTL_DISP_B2_DWP_SHIFT)
#  define PADCTL_DISP_B2_DWP_ALLOWBOTH    (0x00 << PADCTL_DISP_B2_DWP_SHIFT) /* Both cores are allowed */
#  define PADCTL_DISP_B2_DWP_DENYCM7      (0x01 << PADCTL_DISP_B2_DWP_SHIFT) /* CM7 is forbidden */
#  define PADCTL_DISP_B2_DWP_DENYCM4      (0x02 << PADCTL_DISP_B2_DWP_SHIFT) /* CM4 is forbidden */
#  define PADCTL_DISP_B2_DWP_DENYBOTH     (0x03 << PADCTL_DISP_B2_DWP_SHIFT) /* Both cores are forbidden */

#define PADCTL_DISP_B2_DWP_LOCK_SHIFT     (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define PADCTL_DISP_B2_DWP_LOCK_MASK      (0x03 << PADCTL_DISP_B2_DWP_LOCK_SHIFT)
#  define PADCTL_DISP_B2_DWP_LOCK_NOLCK   (0x00 << PADCTL_DISP_B2_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define PADCTL_DISP_B2_DWP_LOCK_LCKLO   (0x01 << PADCTL_DISP_B2_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define PADCTL_DISP_B2_DWP_LOCK_LCKHI   (0x02 << PADCTL_DISP_B2_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define PADCTL_DISP_B2_DWP_LOCK_LCKBOTH (0x03 << PADCTL_DISP_B2_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* GPIO_SNVS Pad CTL Registers */

