apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define PADCTL_SNVS_PUE                   (1 << 2)  /* Bit 2:      Pull / Keep Select Field (PUE) */
#define PADCTL_SNVS_PUS                   (1 << 3)  /* Bit 3:      Pull Up / Down Config. Field (PUS) */
#  define PADCTL_SNVS_PULL_DOWN           (0 << 3)  /*             Weak pull down */
#  define PADCTL_SNVS_PULL_UP             (1 << 3)  /*             Weak pull up */
                                                    /* Bits 4-5:   Reserved */
#define PADCTL_SNVS_ODE                   (1 << 6)  /* Bit 6:      Open Drain Field (ODE) */
                                                    /* Bits 7-27:  Reserved */
#define PADCTL_SNVS_DWP_SHIFT             (28)      /* Bits 28-29: Domain write protection (DWP) */
#define PADCTL_SNVS_DWP_MASK              (0x03 << PADCTL_SNVS_DWP_SHIFT)
#  define PADCTL_SNVS_DWP_ALLOWBOTH       (0x00 << PADCTL_SNVS_DWP_SHIFT) /* Both cores are allowed */
#  define PADCTL_SNVS_DWP_DENYCM7         (0x01 << PADCTL_SNVS_DWP_SHIFT) /* CM7 is forbidden */
#  define PADCTL_SNVS_DWP_DENYCM4         (0x02 << PADCTL_SNVS_DWP_SHIFT) /* CM4 is forbidden */
#  define PADCTL_SNVS_DWP_DENYBOTH        (0x03 << PADCTL_SNVS_DWP_SHIFT) /* Both cores are forbidden */

#define PADCTL_SNVS_DWP_LOCK_SHIFT        (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define PADCTL_SNVS_DWP_LOCK_MASK         (0x03 << PADCTL_SNVS_DWP_LOCK_SHIFT)
#  define PADCTL_SNVS_DWP_LOCK_NOLCK      (0x00 << PADCTL_SNVS_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define PADCTL_SNVS_DWP_LOCK_LCKLO      (0x01 << PADCTL_SNVS_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define PADCTL_SNVS_DWP_LOCK_LCKHI      (0x02 << PADCTL_SNVS_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define PADCTL_SNVS_DWP_LOCK_LCKBOTH    (0x03 << PADCTL_SNVS_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* GPIO_LPSR Pad CTL Registers */

#define PADCTL_LPSR_SRE                   (1 << 0)  /* Bit 0:      Slew Rate Field (SRE) */
#define PADCTL_LPSR_DSE                   (1 << 1)  /* Bit 1:      Drive Strength Field (DSE) */
#define PADCTL_LPSR_PUE                   (1 << 2)  /* Bit 2:      Pull / Keep Select Field (PUE) */
#define PADCTL_LPSR_PUS                   (1 << 3)  /* Bit 3:      Pull Up / Down Config. Field (PUS) */
#  define PADCTL_LPSR_PULL_DOWN           (0 << 3)  /*             Weak pull down */
#  define PADCTL_LPSR_PULL_UP             (1 << 3)  /*             Weak pull up */
                                                    /* Bit 4:      Reserved */
#define PADCTL_LPSR_ODE                   (1 << 5)  /* Bit 5:      Open Drain Field (ODE) */
                                                    /* Bits 6-27:  Reserved */
#define PADCTL_LPSR_DWP_SHIFT             (28)      /* Bits 28-29: Domain write protection (DWP) */
#define PADCTL_LPSR_DWP_MASK              (0x03 << PADCTL_LPSR_DWP_SHIFT)
#  define PADCTL_LPSR_DWP_ALLOWBOTH       (0x00 << PADCTL_LPSR_DWP_SHIFT) /* Both cores are allowed */
#  define PADCTL_LPSR_DWP_DENYCM7         (0x01 << PADCTL_LPSR_DWP_SHIFT) /* CM7 is forbidden */
#  define PADCTL_LPSR_DWP_DENYCM4         (0x02 << PADCTL_LPSR_DWP_SHIFT) /* CM4 is forbidden */
#  define PADCTL_LPSR_DWP_DENYBOTH        (0x03 << PADCTL_LPSR_DWP_SHIFT) /* Both cores are forbidden */

#define PADCTL_LPSR_DWP_LOCK_SHIFT        (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define PADCTL_LPSR_DWP_LOCK_MASK         (0x03 << PADCTL_LPSR_DWP_LOCK_SHIFT)
#  define PADCTL_LPSR_DWP_LOCK_NOLCK      (0x00 << PADCTL_LPSR_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define PADCTL_LPSR_DWP_LOCK_LCKLO      (0x01 << PADCTL_LPSR_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define PADCTL_LPSR_DWP_LOCK_LCKHI      (0x02 << PADCTL_LPSR_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define PADCTL_LPSR_DWP_LOCK_LCKBOTH    (0x03 << PADCTL_LPSR_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 0 (GPR0) */

#define GPR_GPR0_SAI1_MCLK1_SEL_SHIFT                    (0) /* Bits 0-2: SAI1 MCLK1 source select (SAI1_MCLK1_SEL) */
#define GPR_GPR0_SAI1_MCLK1_SEL_MASK                     (0x07 << GPR_GPR0_SAI1_MCLK1_SEL_SHIFT)
#  define GPR_GPR0_SAI1_MCLK1_SEL_SAI1_CLK_ROOT          (0x00 << GPR_GPR0_SAI1_MCLK1_SEL_SHIFT) /* SAI1_CLK_ROOT */
#  define GPR_GPR0_SAI1_MCLK1_SEL_SAI2_CLK_ROOT          (0x01 << GPR_GPR0_SAI1_MCLK1_SEL_SHIFT) /* SAI2_CLK_ROOT */
#  define GPR_GPR0_SAI1_MCLK1_SEL_SAI3_CLK_ROOT          (0x02 << GPR_GPR0_SAI1_MCLK1_SEL_SHIFT) /* SAI3_CLK_ROOT */
#  define GPR_GPR0_SAI1_MCLK1_SEL_SAI1_IPG_CLK_SAI_MCLK  (0x03 << GPR_GPR0_SAI1_MCLK1_SEL_SHIFT) /* SAI1_IPG_CLK_SAI_MCLK */
#  define GPR_GPR0_SAI1_MCLK1_SEL_SAI2_IPG_CLK_SAI_MCLK  (0x04 << GPR_GPR0_SAI1_MCLK1_SEL_SHIFT) /* SAI2_IPG_CLK_SAI_MCLK */
#  define GPR_GPR0_SAI1_MCLK1_SEL_SAI3_IPG_CLK_SAI_MCLK  (0x05 << GPR_GPR0_SAI1_MCLK1_SEL_SHIFT) /* SAI3_IPG_CLK_SAI_MCLK */

#define GPR_GPR0_SAI1_MCLK2_SEL_SHIFT                    (3) /* Bits 3-5: SAI1 MCLK2 source select (SAI1_MCLK2_SEL) */
#define GPR_GPR0_SAI1_MCLK2_SEL_MASK                     (0x07 << GPR_GPR0_SAI1_MCLK2_SEL_SHIFT)
#  define GPR_GPR0_SAI1_MCLK2_SEL_SAI1_CLK_ROOT          (0x00 << GPR_GPR0_SAI1_MCLK2_SEL_SHIFT) /* SAI1_CLK_ROOT */
#  define GPR_GPR0_SAI1_MCLK2_SEL_SAI2_CLK_ROOT          (0x01 << GPR_GPR0_SAI1_MCLK2_SEL_SHIFT) /* SAI2_CLK_ROOT */
#  define GPR_GPR0_SAI1_MCLK2_SEL_SAI3_CLK_ROOT          (0x02 << GPR_GPR0_SAI1_MCLK2_SEL_SHIFT) /* SAI3_CLK_ROOT */
#  define GPR_GPR0_SAI1_MCLK2_SEL_SAI1_IPG_CLK_SAI_MCLK  (0x03 << GPR_GPR0_SAI1_MCLK2_SEL_SHIFT) /* SAI1_IPG_CLK_SAI_MCLK */
#  define GPR_GPR0_SAI1_MCLK2_SEL_SAI2_IPG_CLK_SAI_MCLK  (0x04 << GPR_GPR0_SAI1_MCLK2_SEL_SHIFT) /* SAI2_IPG_CLK_SAI_MCLK */
#  define GPR_GPR0_SAI1_MCLK2_SEL_SAI3_IPG_CLK_SAI_MCLK  (0x05 << GPR_GPR0_SAI1_MCLK2_SEL_SHIFT) /* SAI3_IPG_CLK_SAI_MCLK */

#define GPR_GPR0_SAI1_MCLK3_SEL_SHIFT             (6) /* Bits 6-7: SAI1 MCLK3 source select (SAI1_MCLK3_SEL) */
#define GPR_GPR0_SAI1_MCLK3_SEL_MASK              (0x03 << GPR_GPR0_SAI1_MCLK3_SEL_SHIFT)
#  define GPR_GPR0_SAI1_MCLK3_SEL_SPDIF_CLK_ROOT  (0x00 << GPR_GPR0_SAI1_MCLK3_SEL_SHIFT) /* SPDIF_CLK_ROOT */
#  define GPR_GPR0_SAI1_MCLK3_SEL_SPDIF_TX_CLK2   (0x01 << GPR_GPR0_SAI1_MCLK3_SEL_SHIFT) /* SPDIF_TX_CLK2 */
#  define GPR_GPR0_SAI1_MCLK3_SEL_SPDIF_SRCLK     (0x02 << GPR_GPR0_SAI1_MCLK3_SEL_SHIFT) /* SPDIF_SRCLK */
#  define GPR_GPR0_SAI1_MCLK3_SEL_SPDIF_OUTCLOCK  (0x03 << GPR_GPR0_SAI1_MCLK3_SEL_SHIFT) /* SPDIF_OUTCLOCK */

#define GPR_GPR0_SAI1_MCLK_DIR            (1 << 8)  /* Bit 8:      SAI1_MCLK signal direction control (SAI1_MCLK_DIR) */
#  define GPR_GPR0_SAI1_MCLK_DIR_IN       (0 << 8)  /*             SAI1_MCLK is input signal */
#  define GPR_GPR0_SAI1_MCLK_DIR_OUT      (1 << 8)  /*             SAI1_MCLK is output signal */
                                                    /* Bits 9-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR0_DWP_SHIFT                (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR0_DWP_MASK                 (0x03 << GPR_GPR0_DWP_SHIFT)
#  define GPR_GPR0_DWP_ALLOWBOTH          (0x00 << GPR_GPR0_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR0_DWP_DENYCM7            (0x01 << GPR_GPR0_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR0_DWP_DENYCM4            (0x02 << GPR_GPR0_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR0_DWP_DENYBOTH           (0x03 << GPR_GPR0_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR0_DWP_LOCK_SHIFT           (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR0_DWP_LOCK_MASK            (0x03 << GPR_GPR0_DWP_LOCK_SHIFT)
#  define GPR_GPR0_DWP_LOCK_NOLCK         (0x00 << GPR_GPR0_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR0_DWP_LOCK_LCKLO         (0x01 << GPR_GPR0_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR0_DWP_LOCK_LCKHI         (0x02 << GPR_GPR0_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR0_DWP_LOCK_LCKBOTH       (0x03 << GPR_GPR0_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

