apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
/* General Purpose Register 1 (GPR1) */

#define GPR_GPR1_SAI2_MCLK3_SEL_SHIFT             (0) /* Bits 0-1: SAI2 MCLK3 source select (SAI2_MCLK3_SEL) */
#define GPR_GPR1_SAI2_MCLK3_SEL_MASK              (0x03 << GPR_GPR1_SAI2_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI2_MCLK3_SEL_SPDIF_CLK_ROOT  (0x00 << GPR_GPR1_SAI2_MCLK3_SEL_SHIFT) /* SPDIF_CLK_ROOT */
#  define GPR_GPR1_SAI2_MCLK3_SEL_SPDIF_TX_CLK2   (0x01 << GPR_GPR1_SAI2_MCLK3_SEL_SHIFT) /* SPDIF_TX_CLK2 */
#  define GPR_GPR1_SAI2_MCLK3_SEL_SPDIF_SRCLK     (0x02 << GPR_GPR1_SAI2_MCLK3_SEL_SHIFT) /* SPDIF_SRCLK */
#  define GPR_GPR1_SAI2_MCLK3_SEL_SPDIF_OUTCLOCK  (0x03 << GPR_GPR1_SAI2_MCLK3_SEL_SHIFT) /* SPDIF_OUTCLOCK */

                                                    /* Bits 2-7:   Reserved */
#define GPR_GPR1_SAI2_MCLK_DIR            (1 << 8)  /* Bit 8:      SAI2_MCLK signal direction control (SAI2_MCLK_DIR) */
#  define GPR_GPR1_SAI2_MCLK_DIR_IN       (0 << 8)  /*             SAI2_MCLK is input signal */
#  define GPR_GPR1_SAI2_MCLK_DIR_OUT      (1 << 8)  /*             SAI2_MCLK is output signal */
                                                    /* Bits 9-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR1_DWP_SHIFT                (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR1_DWP_MASK                 (0x03 << GPR_GPR1_DWP_SHIFT)
#  define GPR_GPR1_DWP_ALLOWBOTH          (0x00 << GPR_GPR1_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR1_DWP_DENYCM7            (0x01 << GPR_GPR1_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR1_DWP_DENYCM4            (0x02 << GPR_GPR1_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR1_DWP_DENYBOTH           (0x03 << GPR_GPR1_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR1_DWP_LOCK_SHIFT           (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR1_DWP_LOCK_MASK            (0x03 << GPR_GPR1_DWP_LOCK_SHIFT)
#  define GPR_GPR1_DWP_LOCK_NOLCK         (0x00 << GPR_GPR1_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR1_DWP_LOCK_LCKLO         (0x01 << GPR_GPR1_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR1_DWP_LOCK_LCKHI         (0x02 << GPR_GPR1_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR1_DWP_LOCK_LCKBOTH       (0x03 << GPR_GPR1_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 2 (GPR2) */

#define GPR_GPR2_SAI3_MCLK3_SEL_SHIFT             (0) /* Bits 0-1: SAI3 MCLK3 source select (SAI3_MCLK3_SEL) */
#define GPR_GPR2_SAI3_MCLK3_SEL_MASK              (0x03 << GPR_GPR2_SAI3_MCLK3_SEL_SHIFT)
#  define GPR_GPR2_SAI3_MCLK3_SEL_SPDIF_CLK_ROOT  (0x00 << GPR_GPR2_SAI3_MCLK3_SEL_SHIFT) /* SPDIF_CLK_ROOT */
#  define GPR_GPR2_SAI3_MCLK3_SEL_SPDIF_TX_CLK2   (0x01 << GPR_GPR2_SAI3_MCLK3_SEL_SHIFT) /* SPDIF_TX_CLK2 */
#  define GPR_GPR2_SAI3_MCLK3_SEL_SPDIF_SRCLK     (0x02 << GPR_GPR2_SAI3_MCLK3_SEL_SHIFT) /* SPDIF_SRCLK */
#  define GPR_GPR2_SAI3_MCLK3_SEL_SPDIF_OUTCLOCK  (0x03 << GPR_GPR2_SAI3_MCLK3_SEL_SHIFT) /* SPDIF_OUTCLOCK */

                                                    /* Bits 2-7:   Reserved */
#define GPR_GPR2_SAI3_MCLK_DIR            (1 << 8)  /* Bit 8:      SAI3_MCLK signal direction control (SAI3_MCLK_DIR) */
#  define GPR_GPR2_SAI3_MCLK_DIR_IN       (0 << 8)  /*             SAI3_MCLK is input signal */
#  define GPR_GPR2_SAI3_MCLK_DIR_OUT      (1 << 8)  /*             SAI3_MCLK is output signal */
#define GPR_GPR2_SAI4_MCLK_DIR            (1 << 9)  /* Bit 9:      SAI4_MCLK signal direction control (SAI4_MCLK_DIR) */
#  define GPR_GPR2_SAI4_MCLK_DIR_IN       (0 << 9)  /*             SAI4_MCLK is input signal */
#  define GPR_GPR2_SAI4_MCLK_DIR_OUT      (1 << 9)  /*             SAI4_MCLK is output signal */
                                                    /* Bits 10-15: Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR2_DWP_SHIFT                (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR2_DWP_MASK                 (0x03 << GPR_GPR2_DWP_SHIFT)
#  define GPR_GPR2_DWP_ALLOWBOTH          (0x00 << GPR_GPR2_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR2_DWP_DENYCM7            (0x01 << GPR_GPR2_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR2_DWP_DENYCM4            (0x02 << GPR_GPR2_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR2_DWP_DENYBOTH           (0x03 << GPR_GPR2_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR2_DWP_LOCK_SHIFT           (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR2_DWP_LOCK_MASK            (0x03 << GPR_GPR2_DWP_LOCK_SHIFT)
#  define GPR_GPR2_DWP_LOCK_NOLCK         (0x00 << GPR_GPR2_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR2_DWP_LOCK_LCKLO         (0x01 << GPR_GPR2_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR2_DWP_LOCK_LCKHI         (0x02 << GPR_GPR2_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR2_DWP_LOCK_LCKBOTH       (0x03 << GPR_GPR2_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 3 (GPR3) */

#define GPR_GPR3_MQS_CLK_DIV_SHIFT        (16)      /* Bits 0-7:   Divider ratio control for MCLK from HMCLK (MQS_CLK_DIV) */
#define GPR_GPR3_MQS_CLK_DIV_MASK         (0xff << GPR_GPR3_MQS_CLK_DIV_SHIFT)
#  define GPR_GPR3_MQS_CLK_DIV(n)         (((n)-1) << GPR_GPR3_MQS_CLK_DIV_SHIFT) /* f_MCLK = f_HMCLK / n */

#define GPR_GPR3_MQS_SW_RST               (1 << 8)  /* Bit 8:      MQS software reset (MQS_SW_RST) */
#define GPR_GPR3_MQS_EN                   (1 << 9)  /* Bit 9:      MQS enable (MQS_EN) */
#define GPR_GPR3_MQS_OVERSAMPLE           (1 << 10) /* Bit 10:     MQS oversample (MQS_OVERSAMPLE) */
#define GPR_GPR3_MQS_OVERSAMPLE_32        (0 << 10) /*             32x oversampling rate */
#define GPR_GPR3_MQS_OVERSAMPLE_64        (1 << 10) /*             64x oversampling rate */
                                                    /* Bits 11-15: Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR3_DWP_SHIFT                (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR3_DWP_MASK                 (0x03 << GPR_GPR3_DWP_SHIFT)
#  define GPR_GPR3_DWP_ALLOWBOTH          (0x00 << GPR_GPR3_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR3_DWP_DENYCM7            (0x01 << GPR_GPR3_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR3_DWP_DENYCM4            (0x02 << GPR_GPR3_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR3_DWP_DENYBOTH           (0x03 << GPR_GPR3_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR3_DWP_LOCK_SHIFT           (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR3_DWP_LOCK_MASK            (0x03 << GPR_GPR3_DWP_LOCK_SHIFT)
#  define GPR_GPR3_DWP_LOCK_NOLCK         (0x00 << GPR_GPR3_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR3_DWP_LOCK_LCKLO         (0x01 << GPR_GPR3_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR3_DWP_LOCK_LCKHI         (0x02 << GPR_GPR3_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR3_DWP_LOCK_LCKBOTH       (0x03 << GPR_GPR3_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 4 (GPR4) */

#define GPR_GPR4_ENET_TX_CLK_SEL          (1 << 0)  /* Bit 0:      ENET TX_CLK select (ENET_TX_CLK_SEL) */
#  define GPR_GPR4_ENET_TX_CLK_SEL_NS     (0 << 0)  /*             Not supported */
#  define GPR_GPR4_ENET_TX_CLK_SEL_PAD    (1 << 0)  /*             ENET TX_CLK is from pad */
#define GPR_GPR4_ENET_REF_CLK_DIR         (1 << 1)  /* Bit 1:      ENET_REF_CLK direction control (ENET_REF_CLK_DIR) */
#  define GPR_GPR4_ENET_REF_CLK_DIR_IN    (0 << 1)  /*             ENET_REF_CLK is input */
#  define GPR_GPR4_ENET_REF_CLK_DIR_OUT   (1 << 1)  /*             ENET_REF_CLK is output driven by ENET1_CLK_ROOT */
#define GPR_GPR4_ENET_TIME_SEL            (1 << 2)  /* Bit 2:      ENET master timer source select (ENET_TIME_SEL) */
#  define GPR_GPR4_ENET_TIME_SEL_1G       (0 << 2)  /*             Master counter value is from ENET_1G module */
#  define GPR_GPR4_ENET_TIME_SEL_QOS      (1 << 2)  /*             Master counter value is from ENET_QOS module */
#define GPR_GPR4_ENET_EVENT0IN_SEL        (1 << 3)  /* Bit 3:      ENET_1588_EVENT0_IN source select (ENET_EVENT0IN_SEL) */
#  define GPR_GPR4_ENET_EVENT0IN_SEL_PAD  (0 << 3)  /*             ENET_1588_EVENT0_IN input is from pad */
#  define GPR_GPR4_ENET_EVENT0IN_SEL_GPT2 (1 << 3)  /*             ENET_1588_EVENT0_IN input is from GPT2 COMPARE1 output */
                                                    /* Bits 4-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR4_DWP_SHIFT                (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR4_DWP_MASK                 (0x03 << GPR_GPR4_DWP_SHIFT)
#  define GPR_GPR4_DWP_ALLOWBOTH          (0x00 << GPR_GPR4_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR4_DWP_DENYCM7            (0x01 << GPR_GPR4_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR4_DWP_DENYCM4            (0x02 << GPR_GPR4_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR4_DWP_DENYBOTH           (0x03 << GPR_GPR4_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR4_DWP_LOCK_SHIFT           (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR4_DWP_LOCK_MASK            (0x03 << GPR_GPR4_DWP_LOCK_SHIFT)
#  define GPR_GPR4_DWP_LOCK_NOLCK         (0x00 << GPR_GPR4_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR4_DWP_LOCK_LCKLO         (0x01 << GPR_GPR4_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR4_DWP_LOCK_LCKHI         (0x02 << GPR_GPR4_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR4_DWP_LOCK_LCKBOTH       (0x03 << GPR_GPR4_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 5 (GPR5) */

