apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define GPR_GPR5_ENET1G_TX_CLK_SEL        (1 << 0)  /* Bit 0:      ENET1G TX_CLK select (ENET1G_TX_CLK_SEL) */
#  define GPR_GPR5_ENET1G_TX_CLK_SEL_CLK  (0 << 0)  /*             ENET1G TX_CLK is driven by ENET2_CLK_ROOT */
#  define GPR_GPR5_ENET1G_TX_CLK_SEL_PAD  (1 << 0)  /*             ENET1G TX_CLK is from pad */
#define GPR_GPR5_ENET1G_REF_CLK_DIR       (1 << 1)  /* Bit 1:      ENET1G_REF_CLK direction control (ENET1G_REF_CLK_DIR) */
#  define GPR_GPR5_ENET1G_REF_CLK_DIR_IN  (0 << 1)  /*             ENET1G_REF_CLK is input */
#  define GPR_GPR5_ENET1G_REF_CLK_DIR_OUT (1 << 1)  /*             ENET1G_REF_CLK is output driven by ENET2_CLK_ROOT */
#define GPR_GPR5_ENET1G_RGMII_EN          (1 << 2)  /* Bit 2:      ENET1G RGMII TX clock output enable (ENET1G_RGMII_EN) */
#define GPR_GPR5_ENET1G_TIME_SEL          (1 << 3)  /* Bit 3:      ENET1G master timer source select (ENET1G_TIME_SEL) */
#  define GPR_GPR5_ENET1G_TIME_SEL_ENET   (0 << 3)  /*             Master counter value is from ENET module */
#  define GPR_GPR5_ENET1G_TIME_SEL_QOS    (1 << 3)  /*             Master counter value is from ENET_QOS module */

#define GPR_GPR5_ENET1G_EVENT0IN_SEL        (1 << 4) /* Bit 4:     ENET_1588_EVENT0_IN source select (ENET1G_EVENT0IN_SEL) */
#  define GPR_GPR5_ENET1G_EVENT0IN_SEL_PAD  (0 << 4) /*            ENET_1588_EVENT0_IN input is from pad */
#  define GPR_GPR5_ENET1G_EVENT0IN_SEL_GPT2 (1 << 4) /*            ENET_1588_EVENT0_IN input is from GPT2 COMPARE1 output */

                                                    /* Bits 5-15:  Reserved */

                                                    /* Bits 16-27: Reserved */

#define GPR_GPR5_DWP_SHIFT                (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR5_DWP_MASK                 (0x03 << GPR_GPR5_DWP_SHIFT)
#  define GPR_GPR5_DWP_ALLOWBOTH          (0x00 << GPR_GPR5_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR5_DWP_DENYCM7            (0x01 << GPR_GPR5_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR5_DWP_DENYCM4            (0x02 << GPR_GPR5_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR5_DWP_DENYBOTH           (0x03 << GPR_GPR5_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR5_DWP_LOCK_SHIFT           (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR5_DWP_LOCK_MASK            (0x03 << GPR_GPR5_DWP_LOCK_SHIFT)
#  define GPR_GPR5_DWP_LOCK_NOLCK         (0x00 << GPR_GPR5_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR5_DWP_LOCK_LCKLO         (0x01 << GPR_GPR5_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR5_DWP_LOCK_LCKHI         (0x02 << GPR_GPR5_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR5_DWP_LOCK_LCKBOTH       (0x03 << GPR_GPR5_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 6 (GPR6) */

#define GPR_GPR6_ENET_QOS_REF_CLK_DIR       (1 << 0) /* Bit 0:     ENET_QOS_REF_CLK direction control (ENET_QOS_REF_CLK_DIR) */
#  define GPR_GPR6_ENET_QOS_REF_CLK_DIR_IN  (0 << 0) /*            ENET_QOS_REF_CLK is input */
#  define GPR_GPR6_ENET_QOS_REF_CLK_DIR_OUT (1 << 0) /*            ENET_QOS_REF_CLK is output driven by ENET_QOS_CLK_ROOT */

#define GPR_GPR6_ENET_QOS_RGMII_EN        (1 << 1)  /* Bit 1:      ENET_QOS RGMII TX clock output enable (ENET_QOS_RGMII_EN) */
#define GPR_GPR6_ENET_QOS_TIME_SEL        (1 << 2)  /* Bit 2:      ENET_QOS master timer source select (ENET_QOS_TIME_SEL) */
#  define GPR_GPR6_ENET_QOS_TIME_SEL_ENET (0 << 2)  /*             Master counter value is from ENET module */
#  define GPR_GPR6_ENET_QOS_TIME_SEL_1G   (1 << 2)  /*             Master counter value is from ENET_1G module */

#define GPR_GPR6_ENET_QOS_INTF_SEL_SHIFT   (3)      /* Bits 3-5:   ENET_QOS PHY interface select (ENET_QOS_INTF_SEL) */
#define GPR_GPR6_ENET_QOS_INTF_SEL_MASK    (0x07 << GPR_GPR6_ENET_QOS_INTF_SEL_SHIFT)
#  define GPR_GPR6_ENET_QOS_INTF_SEL_MII   (0x00 << GPR_GPR6_ENET_QOS_INTF_SEL_SHIFT) /* MII */
#  define GPR_GPR6_ENET_QOS_INTF_SEL_RGMII (0x01 << GPR_GPR6_ENET_QOS_INTF_SEL_SHIFT) /* RGMII */
#  define GPR_GPR6_ENET_QOS_INTF_SEL_RMII  (0x04 << GPR_GPR6_ENET_QOS_INTF_SEL_SHIFT) /* RMII */

#define GPR_GPR6_ENET_QOS_CLKGEN_EN       (1 << 6)  /* Bit 6:      ENET_QOS clock generator enable (ENET_QOS_CLKGEN_EN) */

#define GPR_GPR6_ENET_QOS_EVENT0IN_SEL        (1 << 7) /* Bit 7:   ENET_1588_EVENT0_IN source select (ENET_QOS_EVENT0IN_SEL) */
#  define GPR_GPR6_ENET_QOS_EVENT0IN_SEL_PAD  (0 << 7) /*          ENET_1588_EVENT0_IN input is from pad */
#  define GPR_GPR6_ENET_QOS_EVENT0IN_SEL_GPT3 (1 << 7) /*          ENET_1588_EVENT0_IN input is from GPT3 COMPARE1 output */

                                                    /* Bits 8-15:  Reserved */

                                                    /* Bits 16-27: Reserved */

#define GPR_GPR6_DWP_SHIFT                (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR6_DWP_MASK                 (0x03 << GPR_GPR6_DWP_SHIFT)
#  define GPR_GPR6_DWP_ALLOWBOTH          (0x00 << GPR_GPR6_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR6_DWP_DENYCM7            (0x01 << GPR_GPR6_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR6_DWP_DENYCM4            (0x02 << GPR_GPR6_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR6_DWP_DENYBOTH           (0x03 << GPR_GPR6_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR6_DWP_LOCK_SHIFT           (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR6_DWP_LOCK_MASK            (0x03 << GPR_GPR6_DWP_LOCK_SHIFT)
#  define GPR_GPR6_DWP_LOCK_NOLCK         (0x00 << GPR_GPR6_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR6_DWP_LOCK_LCKLO         (0x01 << GPR_GPR6_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR6_DWP_LOCK_LCKHI         (0x02 << GPR_GPR6_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR6_DWP_LOCK_LCKBOTH       (0x03 << GPR_GPR6_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 7 (GPR7) */

#define GPR_GPR7_GINT                     (1 << 0)  /* Bit 0:      Global interrupt (GINT) */
                                                    /* Bits 1-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR7_DWP_SHIFT                (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR7_DWP_MASK                 (0x03 << GPR_GPR7_DWP_SHIFT)
#  define GPR_GPR7_DWP_ALLOWBOTH          (0x00 << GPR_GPR7_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR7_DWP_DENYCM7            (0x01 << GPR_GPR7_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR7_DWP_DENYCM4            (0x02 << GPR_GPR7_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR7_DWP_DENYBOTH           (0x03 << GPR_GPR7_DWP_SHIFT) /* Both cores are forbidden */

