apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define GPR_GPR7_DWP_LOCK_SHIFT           (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR7_DWP_LOCK_MASK            (0x03 << GPR_GPR7_DWP_LOCK_SHIFT)
#  define GPR_GPR7_DWP_LOCK_NOLCK         (0x00 << GPR_GPR7_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR7_DWP_LOCK_LCKLO         (0x01 << GPR_GPR7_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR7_DWP_LOCK_LCKHI         (0x02 << GPR_GPR7_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR7_DWP_LOCK_LCKBOTH       (0x03 << GPR_GPR7_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 8 (GPR8) */

#define GPR_GPR8_WDOG1_MASK               (1 << 0)  /* Bit 0:      WDOG1 timeout mask for WDOG_ANY (WDOG1_MASK) */
                                                    /* Bits 1-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR8_DWP_SHIFT                (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR8_DWP_MASK                 (0x03 << GPR_GPR8_DWP_SHIFT)
#  define GPR_GPR8_DWP_ALLOWBOTH          (0x00 << GPR_GPR8_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR8_DWP_DENYCM7            (0x01 << GPR_GPR8_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR8_DWP_DENYCM4            (0x02 << GPR_GPR8_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR8_DWP_DENYBOTH           (0x03 << GPR_GPR8_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR8_DWP_LOCK_SHIFT           (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR8_DWP_LOCK_MASK            (0x03 << GPR_GPR8_DWP_LOCK_SHIFT)
#  define GPR_GPR8_DWP_LOCK_NOLCK         (0x00 << GPR_GPR8_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR8_DWP_LOCK_LCKLO         (0x01 << GPR_GPR8_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR8_DWP_LOCK_LCKHI         (0x02 << GPR_GPR8_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR8_DWP_LOCK_LCKBOTH       (0x03 << GPR_GPR8_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 9 (GPR9) */

#define GPR_GPR9_WDOG2_MASK               (1 << 0)  /* Bit 0:      WDOG2 timeout mask for WDOG_ANY (WDOG2_MASK) */
                                                    /* Bits 1-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR9_DWP_SHIFT                (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR9_DWP_MASK                 (0x03 << GPR_GPR9_DWP_SHIFT)
#  define GPR_GPR9_DWP_ALLOWBOTH          (0x00 << GPR_GPR9_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR9_DWP_DENYCM7            (0x01 << GPR_GPR9_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR9_DWP_DENYCM4            (0x02 << GPR_GPR9_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR9_DWP_DENYBOTH           (0x03 << GPR_GPR9_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR9_DWP_LOCK_SHIFT           (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR9_DWP_LOCK_MASK            (0x03 << GPR_GPR9_DWP_LOCK_SHIFT)
#  define GPR_GPR9_DWP_LOCK_NOLCK         (0x00 << GPR_GPR9_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR9_DWP_LOCK_LCKLO         (0x01 << GPR_GPR9_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR9_DWP_LOCK_LCKHI         (0x02 << GPR_GPR9_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR9_DWP_LOCK_LCKBOTH       (0x03 << GPR_GPR9_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 10 (GPR10) - Reserved */

/* General Purpose Register 11 (GPR11) - Reserved */

/* General Purpose Register 12 (GPR12) */

#define GPR_GPR12_QTIMER1_TMR_CNTS_FREEZE (1 << 0)  /* Bit 0:      QTIMER1 timer counter freeze (QTIMER1_TMR_CNTS_FREEZE) */
                                                    /* Bits 1-7:   Reserved */

#define GPR_GPR12_QTIMER1_TMR0_INPUT_SEL         (1 << 8)  /* Bit 8:  QTIMER1 TMR0 input select */
#  define GPR_GPR12_QTIMER1_TMR0_INPUT_SEL_IOMUX (0 << 8)  /*         input from IOMUX */
#  define GPR_GPR12_QTIMER1_TMR0_INPUT_SEL_XBAR  (1 << 8)  /*         input from XBAR */
#define GPR_GPR12_QTIMER1_TMR1_INPUT_SEL         (1 << 9)  /* Bit 9:  QTIMER1 TMR1 input select */
#  define GPR_GPR12_QTIMER1_TMR1_INPUT_SEL_IOMUX (0 << 9)  /*         input from IOMUX */
#  define GPR_GPR12_QTIMER1_TMR1_INPUT_SEL_XBAR  (1 << 9)  /*         input from XBAR */
#define GPR_GPR12_QTIMER1_TMR2_INPUT_SEL         (1 << 10) /* Bit 10: QTIMER1 TMR2 input select */
#  define GPR_GPR12_QTIMER1_TMR2_INPUT_SEL_IOMUX (0 << 10) /*         input from IOMUX */
#  define GPR_GPR12_QTIMER1_TMR2_INPUT_SEL_XBAR  (1 << 10) /*         input from XBAR */
#define GPR_GPR12_QTIMER1_TMR3_INPUT_SEL         (1 << 11) /* Bit 11: QTIMER1 TMR3 input select */
#  define GPR_GPR12_QTIMER1_TMR3_INPUT_SEL_IOMUX (0 << 11) /*         input from IOMUX */
#  define GPR_GPR12_QTIMER1_TMR3_INPUT_SEL_XBAR  (1 << 11) /*         input from XBAR */

                                                    /* Bits 12-15: Reserved */

                                                    /* Bits 16-27: Reserved */

#define GPR_GPR12_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR12_DWP_MASK                (0x03 << GPR_GPR12_DWP_SHIFT)
#  define GPR_GPR12_DWP_ALLOWBOTH         (0x00 << GPR_GPR12_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR12_DWP_DENYCM7           (0x01 << GPR_GPR12_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR12_DWP_DENYCM4           (0x02 << GPR_GPR12_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR12_DWP_DENYBOTH          (0x03 << GPR_GPR12_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR12_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR12_DWP_LOCK_MASK           (0x03 << GPR_GPR12_DWP_LOCK_SHIFT)
#  define GPR_GPR12_DWP_LOCK_NOLCK        (0x00 << GPR_GPR12_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR12_DWP_LOCK_LCKLO        (0x01 << GPR_GPR12_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR12_DWP_LOCK_LCKHI        (0x02 << GPR_GPR12_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR12_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR12_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

