apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
/* General Purpose Register 13 (GPR13) */

#define GPR_GPR13_QTIMER2_TMR_CNTS_FREEZE (1 << 0)  /* Bit 0:      QTIMER2 timer counter freeze (QTIMER2_TMR_CNTS_FREEZE) */
                                                    /* Bits 1-7:   Reserved */

#define GPR_GPR13_QTIMER2_TMR0_INPUT_SEL         (1 << 8)  /* Bit 8:  QTIMER2 TMR0 input select */
#  define GPR_GPR13_QTIMER2_TMR0_INPUT_SEL_IOMUX (0 << 8)  /*         input from IOMUX */
#  define GPR_GPR13_QTIMER2_TMR0_INPUT_SEL_XBAR  (1 << 8)  /*         input from XBAR */
#define GPR_GPR13_QTIMER2_TMR1_INPUT_SEL         (1 << 9)  /* Bit 9:  QTIMER2 TMR1 input select */
#  define GPR_GPR13_QTIMER2_TMR1_INPUT_SEL_IOMUX (0 << 9)  /*         input from IOMUX */
#  define GPR_GPR13_QTIMER2_TMR1_INPUT_SEL_XBAR  (1 << 9)  /*         input from XBAR */
#define GPR_GPR13_QTIMER2_TMR2_INPUT_SEL         (1 << 10) /* Bit 10: QTIMER2 TMR2 input select */
#  define GPR_GPR13_QTIMER2_TMR2_INPUT_SEL_IOMUX (0 << 10) /*         input from IOMUX */
#  define GPR_GPR13_QTIMER2_TMR2_INPUT_SEL_XBAR  (1 << 10) /*         input from XBAR */
#define GPR_GPR13_QTIMER2_TMR3_INPUT_SEL         (1 << 11) /* Bit 11: QTIMER2 TMR3 input select */
#  define GPR_GPR13_QTIMER2_TMR3_INPUT_SEL_IOMUX (0 << 11) /*         input from IOMUX */
#  define GPR_GPR13_QTIMER2_TMR3_INPUT_SEL_XBAR  (1 << 11) /*         input from XBAR */

                                                    /* Bits 12-15: Reserved */

                                                    /* Bits 16-27: Reserved */

#define GPR_GPR13_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR13_DWP_MASK                (0x03 << GPR_GPR13_DWP_SHIFT)
#  define GPR_GPR13_DWP_ALLOWBOTH         (0x00 << GPR_GPR13_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR13_DWP_DENYCM7           (0x01 << GPR_GPR13_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR13_DWP_DENYCM4           (0x02 << GPR_GPR13_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR13_DWP_DENYBOTH          (0x03 << GPR_GPR13_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR13_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR13_DWP_LOCK_MASK           (0x03 << GPR_GPR13_DWP_LOCK_SHIFT)
#  define GPR_GPR13_DWP_LOCK_NOLCK        (0x00 << GPR_GPR13_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR13_DWP_LOCK_LCKLO        (0x01 << GPR_GPR13_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR13_DWP_LOCK_LCKHI        (0x02 << GPR_GPR13_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR13_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR13_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 14 (GPR14) */

#define GPR_GPR14_QTIMER3_TMR_CNTS_FREEZE (1 << 0)  /* Bit 0:      QTIMER3 timer counter freeze (QTIMER3_TMR_CNTS_FREEZE) */
                                                    /* Bits 1-7:   Reserved */

#define GPR_GPR14_QTIMER3_TMR0_INPUT_SEL         (1 << 8)  /* Bit 8:  QTIMER3 TMR0 input select */
#  define GPR_GPR14_QTIMER3_TMR0_INPUT_SEL_IOMUX (0 << 8)  /*         input from IOMUX */
#  define GPR_GPR14_QTIMER3_TMR0_INPUT_SEL_XBAR  (1 << 8)  /*         input from XBAR */
#define GPR_GPR14_QTIMER3_TMR1_INPUT_SEL         (1 << 9)  /* Bit 9:  QTIMER3 TMR1 input select */
#  define GPR_GPR14_QTIMER3_TMR1_INPUT_SEL_IOMUX (0 << 9)  /*         input from IOMUX */
#  define GPR_GPR14_QTIMER3_TMR1_INPUT_SEL_XBAR  (1 << 9)  /*         input from XBAR */
#define GPR_GPR14_QTIMER3_TMR2_INPUT_SEL         (1 << 10) /* Bit 10: QTIMER3 TMR2 input select */
#  define GPR_GPR14_QTIMER3_TMR2_INPUT_SEL_IOMUX (0 << 10) /*         input from IOMUX */
#  define GPR_GPR14_QTIMER3_TMR2_INPUT_SEL_XBAR  (1 << 10) /*         input from XBAR */
#define GPR_GPR14_QTIMER3_TMR3_INPUT_SEL         (1 << 11) /* Bit 11: QTIMER3 TMR3 input select */
#  define GPR_GPR14_QTIMER3_TMR3_INPUT_SEL_IOMUX (0 << 11) /*         input from IOMUX */
#  define GPR_GPR14_QTIMER3_TMR3_INPUT_SEL_XBAR  (1 << 11) /*         input from XBAR */

                                                    /* Bits 12-15: Reserved */

                                                    /* Bits 16-27: Reserved */

#define GPR_GPR14_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR14_DWP_MASK                (0x03 << GPR_GPR14_DWP_SHIFT)
#  define GPR_GPR14_DWP_ALLOWBOTH         (0x00 << GPR_GPR14_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR14_DWP_DENYCM7           (0x01 << GPR_GPR14_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR14_DWP_DENYCM4           (0x02 << GPR_GPR14_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR14_DWP_DENYBOTH          (0x03 << GPR_GPR14_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR14_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR14_DWP_LOCK_MASK           (0x03 << GPR_GPR14_DWP_LOCK_SHIFT)
#  define GPR_GPR14_DWP_LOCK_NOLCK        (0x00 << GPR_GPR14_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR14_DWP_LOCK_LCKLO        (0x01 << GPR_GPR14_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR14_DWP_LOCK_LCKHI        (0x02 << GPR_GPR14_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR14_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR14_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 15 (GPR15) */

#define GPR_GPR15_QTIMER4_TMR_CNTS_FREEZE (1 << 0)  /* Bit 0:      QTIMER4 timer counter freeze (QTIMER4_TMR_CNTS_FREEZE) */
                                                    /* Bits 1-7:   Reserved */

#define GPR_GPR15_QTIMER4_TMR0_INPUT_SEL         (1 << 8)  /* Bit 8:  QTIMER4 TMR0 input select */
#  define GPR_GPR15_QTIMER4_TMR0_INPUT_SEL_IOMUX (0 << 8)  /*         input from IOMUX */
#  define GPR_GPR15_QTIMER4_TMR0_INPUT_SEL_XBAR  (1 << 8)  /*         input from XBAR */
#define GPR_GPR15_QTIMER4_TMR1_INPUT_SEL         (1 << 9)  /* Bit 9:  QTIMER4 TMR1 input select */
#  define GPR_GPR15_QTIMER4_TMR1_INPUT_SEL_IOMUX (0 << 9)  /*         input from IOMUX */
#  define GPR_GPR15_QTIMER4_TMR1_INPUT_SEL_XBAR  (1 << 9)  /*         input from XBAR */
#define GPR_GPR15_QTIMER4_TMR2_INPUT_SEL         (1 << 10) /* Bit 10: QTIMER4 TMR2 input select */
#  define GPR_GPR15_QTIMER4_TMR2_INPUT_SEL_IOMUX (0 << 10) /*         input from IOMUX */
#  define GPR_GPR15_QTIMER4_TMR2_INPUT_SEL_XBAR  (1 << 10) /*         input from XBAR */
#define GPR_GPR15_QTIMER4_TMR3_INPUT_SEL         (1 << 11) /* Bit 11: QTIMER4 TMR3 input select */
#  define GPR_GPR15_QTIMER4_TMR3_INPUT_SEL_IOMUX (0 << 11) /*         input from IOMUX */
#  define GPR_GPR15_QTIMER4_TMR3_INPUT_SEL_XBAR  (1 << 11) /*         input from XBAR */

