apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
                                                    /* Bits 12-15: Reserved */

                                                    /* Bits 16-27: Reserved */

#define GPR_GPR15_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR15_DWP_MASK                (0x03 << GPR_GPR15_DWP_SHIFT)
#  define GPR_GPR15_DWP_ALLOWBOTH         (0x00 << GPR_GPR15_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR15_DWP_DENYCM7           (0x01 << GPR_GPR15_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR15_DWP_DENYCM4           (0x02 << GPR_GPR15_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR15_DWP_DENYBOTH          (0x03 << GPR_GPR15_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR15_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR15_DWP_LOCK_MASK           (0x03 << GPR_GPR15_DWP_LOCK_SHIFT)
#  define GPR_GPR15_DWP_LOCK_NOLCK        (0x00 << GPR_GPR15_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR15_DWP_LOCK_LCKLO        (0x01 << GPR_GPR15_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR15_DWP_LOCK_LCKHI        (0x02 << GPR_GPR15_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR15_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR15_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 16 (GPR16) */

                                                    /* Bits 0-1:   Reserved */

#define GPR_GPR16_FLEXRAM_BANK_CFG_SEL        (1 << 2) /* Bit 2:   FlexRAM bank config source select (FLEXRAM_BANK_CFG_SEL) */
#  define GPR_GPR16_FLEXRAM_BANK_CFG_SEL_FUSE (0 << 2) /*          Use fuse value to configure */
#  define GPR_GPR16_FLEXRAM_BANK_CFG_SEL_REG  (1 << 2) /*          Use FLEXRAM_BANK_CFG to configure */

                                                    /* Bit 4:      Reserved */

#define GPR_GPR16_M7_GPC_SLEEP_SEL             (1 << 5) /* Bit 5:  CM7 sleep request selection (M7_GPC_SLEEP_SEL) */
#  define GPR_GPR16_M7_GPC_SLEEP_SEL_SLEEPDEEP (0 << 5) /*         CM7 SLEEPDEEP is sent to GPC */
#  define GPR_GPR16_M7_GPC_SLEEP_SEL_SLEEPING  (1 << 5) /*         CM7 SLEEPING is sent to GPC */

                                                    /* Bits 6-7:   Reserved */

                                                    /* Bits 8-15:  Reserved */

                                                    /* Bits 16-27: Reserved */

#define GPR_GPR16_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR16_DWP_MASK                (0x03 << GPR_GPR16_DWP_SHIFT)
#  define GPR_GPR16_DWP_ALLOWBOTH         (0x00 << GPR_GPR16_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR16_DWP_DENYCM7           (0x01 << GPR_GPR16_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR16_DWP_DENYCM4           (0x02 << GPR_GPR16_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR16_DWP_DENYBOTH          (0x03 << GPR_GPR16_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR16_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR16_DWP_LOCK_MASK           (0x03 << GPR_GPR16_DWP_LOCK_SHIFT)
#  define GPR_GPR16_DWP_LOCK_NOLCK        (0x00 << GPR_GPR16_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR16_DWP_LOCK_LCKLO        (0x01 << GPR_GPR16_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR16_DWP_LOCK_LCKHI        (0x02 << GPR_GPR16_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR16_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR16_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 17 (GPR17) */

#define GPR_GPR17_FLEXRAM_BANK_CFG_LOW_SHIFT  (0)   /* Bits 0-15:  FlexRAM bank config value (FLEXRAM_BANK_CFG_LOW) */
#define GPR_GPR17_FLEXRAM_BANK_CFG_LOW_MASK   (0xffffffff << GPR_GPR17_FLEXRAM_BANK_CFG_LOW_SHIFT)
#define GPR_GPR17_FLEXRAM_BANK_CFG_LOW(n)     (((uint32_t)(n)) << GPR_GPR17_FLEXRAM_BANK_CFG_LOW_SHIFT)
#define GPR_GPR17_FLEXRAM_BANK0_CFG_SHIFT     (0)   /* Bits 0-1:   FlexRAM bank 0 config value */
#define GPR_GPR17_FLEXRAM_BANK0_CFG_MASK      (0x03 << GPR_GPR17_FLEXRAM_BANK0_CFG_SHIFT)
#  define GPR_GPR17_FLEXRAM_BANK0_CFG_NOTUSED (0x00 << GPR_GPR17_FLEXRAM_BANK0_CFG_SHIFT) /* RAM bank 0 is not used */
#  define GPR_GPR17_FLEXRAM_BANK0_CFG_OCRAM   (0x01 << GPR_GPR17_FLEXRAM_BANK0_CFG_SHIFT) /* RAM bank 0 is OCRAM */
#  define GPR_GPR17_FLEXRAM_BANK0_CFG_DTCM    (0x02 << GPR_GPR17_FLEXRAM_BANK0_CFG_SHIFT) /* RAM bank 0 is DTCM */
#  define GPR_GPR17_FLEXRAM_BANK0_CFG_ITCM    (0x03 << GPR_GPR17_FLEXRAM_BANK0_CFG_SHIFT) /* RAM bank 0 is ITCM */

#define GPR_GPR17_FLEXRAM_BANK1_CFG_SHIFT     (2)   /* Bits 2-3:   FlexRAM bank 1 config value */
#define GPR_GPR17_FLEXRAM_BANK1_CFG_MASK      (0x03 << GPR_GPR17_FLEXRAM_BANK1_CFG_SHIFT)
#  define GPR_GPR17_FLEXRAM_BANK1_CFG_NOTUSED (0x00 << GPR_GPR17_FLEXRAM_BANK1_CFG_SHIFT) /* RAM bank 1 is not used */
#  define GPR_GPR17_FLEXRAM_BANK1_CFG_OCRAM   (0x01 << GPR_GPR17_FLEXRAM_BANK1_CFG_SHIFT) /* RAM bank 1 is OCRAM */
#  define GPR_GPR17_FLEXRAM_BANK1_CFG_DTCM    (0x02 << GPR_GPR17_FLEXRAM_BANK1_CFG_SHIFT) /* RAM bank 1 is DTCM */
#  define GPR_GPR17_FLEXRAM_BANK1_CFG_ITCM    (0x03 << GPR_GPR17_FLEXRAM_BANK1_CFG_SHIFT) /* RAM bank 1 is ITCM */

#define GPR_GPR17_FLEXRAM_BANK2_CFG_SHIFT     (4)   /* Bits 4-5:   FlexRAM bank 2 config value */
#define GPR_GPR17_FLEXRAM_BANK2_CFG_MASK      (0x03 << GPR_GPR17_FLEXRAM_BANK2_CFG_SHIFT)
#  define GPR_GPR17_FLEXRAM_BANK2_CFG_NOTUSED (0x00 << GPR_GPR17_FLEXRAM_BANK2_CFG_SHIFT) /* RAM bank 2 is not used */
#  define GPR_GPR17_FLEXRAM_BANK2_CFG_OCRAM   (0x01 << GPR_GPR17_FLEXRAM_BANK2_CFG_SHIFT) /* RAM bank 2 is OCRAM */
#  define GPR_GPR17_FLEXRAM_BANK2_CFG_DTCM    (0x02 << GPR_GPR17_FLEXRAM_BANK2_CFG_SHIFT) /* RAM bank 2 is DTCM */
#  define GPR_GPR17_FLEXRAM_BANK2_CFG_ITCM    (0x03 << GPR_GPR17_FLEXRAM_BANK2_CFG_SHIFT) /* RAM bank 2 is ITCM */

#define GPR_GPR17_FLEXRAM_BANK3_CFG_SHIFT     (6)   /* Bits 6-7:   FlexRAM bank 3 config value */
#define GPR_GPR17_FLEXRAM_BANK3_CFG_MASK      (0x03 << GPR_GPR17_FLEXRAM_BANK3_CFG_SHIFT)
#  define GPR_GPR17_FLEXRAM_BANK3_CFG_NOTUSED (0x00 << GPR_GPR17_FLEXRAM_BANK3_CFG_SHIFT) /* RAM bank 3 is not used */
#  define GPR_GPR17_FLEXRAM_BANK3_CFG_OCRAM   (0x01 << GPR_GPR17_FLEXRAM_BANK3_CFG_SHIFT) /* RAM bank 3 is OCRAM */
#  define GPR_GPR17_FLEXRAM_BANK3_CFG_DTCM    (0x02 << GPR_GPR17_FLEXRAM_BANK3_CFG_SHIFT) /* RAM bank 3 is DTCM */
#  define GPR_GPR17_FLEXRAM_BANK3_CFG_ITCM    (0x03 << GPR_GPR17_FLEXRAM_BANK3_CFG_SHIFT) /* RAM bank 3 is ITCM */

#define GPR_GPR17_FLEXRAM_BANK4_CFG_SHIFT     (8)   /* Bits 8-9:   FlexRAM bank 4 config value */
#define GPR_GPR17_FLEXRAM_BANK4_CFG_MASK      (0x03 << GPR_GPR17_FLEXRAM_BANK4_CFG_SHIFT)
#  define GPR_GPR17_FLEXRAM_BANK4_CFG_NOTUSED (0x00 << GPR_GPR17_FLEXRAM_BANK4_CFG_SHIFT) /* RAM bank 4 is not used */
#  define GPR_GPR17_FLEXRAM_BANK4_CFG_OCRAM   (0x01 << GPR_GPR17_FLEXRAM_BANK4_CFG_SHIFT) /* RAM bank 4 is OCRAM */
#  define GPR_GPR17_FLEXRAM_BANK4_CFG_DTCM    (0x02 << GPR_GPR17_FLEXRAM_BANK4_CFG_SHIFT) /* RAM bank 4 is DTCM */
#  define GPR_GPR17_FLEXRAM_BANK4_CFG_ITCM    (0x03 << GPR_GPR17_FLEXRAM_BANK4_CFG_SHIFT) /* RAM bank 4 is ITCM */

#define GPR_GPR17_FLEXRAM_BANK5_CFG_SHIFT     (10)  /* Bits 10-11: FlexRAM bank 5 config value */
#define GPR_GPR17_FLEXRAM_BANK5_CFG_MASK      (0x03 << GPR_GPR17_FLEXRAM_BANK5_CFG_SHIFT)
#  define GPR_GPR17_FLEXRAM_BANK5_CFG_NOTUSED (0x00 << GPR_GPR17_FLEXRAM_BANK5_CFG_SHIFT) /* RAM bank 5 is not used */
#  define GPR_GPR17_FLEXRAM_BANK5_CFG_OCRAM   (0x01 << GPR_GPR17_FLEXRAM_BANK5_CFG_SHIFT) /* RAM bank 5 is OCRAM */
#  define GPR_GPR17_FLEXRAM_BANK5_CFG_DTCM    (0x02 << GPR_GPR17_FLEXRAM_BANK5_CFG_SHIFT) /* RAM bank 5 is DTCM */
#  define GPR_GPR17_FLEXRAM_BANK5_CFG_ITCM    (0x03 << GPR_GPR17_FLEXRAM_BANK5_CFG_SHIFT) /* RAM bank 5 is ITCM */

#define GPR_GPR17_FLEXRAM_BANK6_CFG_SHIFT     (12)  /* Bits 12-13: FlexRAM bank 6 config value */
#define GPR_GPR17_FLEXRAM_BANK6_CFG_MASK      (0x03 << GPR_GPR17_FLEXRAM_BANK6_CFG_SHIFT)
#  define GPR_GPR17_FLEXRAM_BANK6_CFG_NOTUSED (0x00 << GPR_GPR17_FLEXRAM_BANK6_CFG_SHIFT) /* RAM bank 6 is not used */
#  define GPR_GPR17_FLEXRAM_BANK6_CFG_OCRAM   (0x01 << GPR_GPR17_FLEXRAM_BANK6_CFG_SHIFT) /* RAM bank 6 is OCRAM */
#  define GPR_GPR17_FLEXRAM_BANK6_CFG_DTCM    (0x02 << GPR_GPR17_FLEXRAM_BANK6_CFG_SHIFT) /* RAM bank 6 is DTCM */
#  define GPR_GPR17_FLEXRAM_BANK6_CFG_ITCM    (0x03 << GPR_GPR17_FLEXRAM_BANK6_CFG_SHIFT) /* RAM bank 6 is ITCM */

#define GPR_GPR17_FLEXRAM_BANK7_CFG_SHIFT     (14)  /* Bits 14-15: FlexRAM bank 7 config value */
#define GPR_GPR17_FLEXRAM_BANK7_CFG_MASK      (0x03 << GPR_GPR17_FLEXRAM_BANK7_CFG_SHIFT)
#  define GPR_GPR17_FLEXRAM_BANK7_CFG_NOTUSED (0x00 << GPR_GPR17_FLEXRAM_BANK7_CFG_SHIFT) /* RAM bank 7 is not used */
#  define GPR_GPR17_FLEXRAM_BANK7_CFG_OCRAM   (0x01 << GPR_GPR17_FLEXRAM_BANK7_CFG_SHIFT) /* RAM bank 7 is OCRAM */
#  define GPR_GPR17_FLEXRAM_BANK7_CFG_DTCM    (0x02 << GPR_GPR17_FLEXRAM_BANK7_CFG_SHIFT) /* RAM bank 7 is DTCM */
#  define GPR_GPR17_FLEXRAM_BANK7_CFG_ITCM    (0x03 << GPR_GPR17_FLEXRAM_BANK7_CFG_SHIFT) /* RAM bank 7 is ITCM */

                                                    /* Bits 16-27: Reserved */

#define GPR_GPR17_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR17_DWP_MASK                (0x03 << GPR_GPR17_DWP_SHIFT)
#  define GPR_GPR17_DWP_ALLOWBOTH         (0x00 << GPR_GPR17_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR17_DWP_DENYCM7           (0x01 << GPR_GPR17_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR17_DWP_DENYCM4           (0x02 << GPR_GPR17_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR17_DWP_DENYBOTH          (0x03 << GPR_GPR17_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR17_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR17_DWP_LOCK_MASK           (0x03 << GPR_GPR17_DWP_LOCK_SHIFT)
#  define GPR_GPR17_DWP_LOCK_NOLCK        (0x00 << GPR_GPR17_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR17_DWP_LOCK_LCKLO        (0x01 << GPR_GPR17_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR17_DWP_LOCK_LCKHI        (0x02 << GPR_GPR17_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR17_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR17_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 18 (GPR18) */

#define GPR_GPR18_FLEXRAM_BANK_CFG_HIGH_SHIFT  (0)   /* Bits 0-15:  FlexRAM bank config value (FLEXRAM_BANK_CFG_HIGH) */
#define GPR_GPR18_FLEXRAM_BANK_CFG_HIGH_MASK   (0xffff << GPR_GPR18_FLEXRAM_BANK_CFG_HIGH_SHIFT)
#define GPR_GPR18_FLEXRAM_BANK_CFG_HIGH(n)     (((uint32_t)(n)) << GPR_GPR18_FLEXRAM_BANK_CFG_HIGH_SHIFT)
#define GPR_GPR18_FLEXRAM_BANK8_CFG_SHIFT      (0)   /* Bits 0-1:   FlexRAM bank 8 config value */
#define GPR_GPR18_FLEXRAM_BANK8_CFG_MASK       (0x03 << GPR_GPR18_FLEXRAM_BANK0_CFG_SHIFT)
#  define GPR_GPR18_FLEXRAM_BANK8_CFG_NOTUSED  (0x00 << GPR_GPR18_FLEXRAM_BANK8_CFG_SHIFT) /* RAM bank 8 is not used */
#  define GPR_GPR18_FLEXRAM_BANK8_CFG_OCRAM    (0x01 << GPR_GPR18_FLEXRAM_BANK8_CFG_SHIFT) /* RAM bank 8 is OCRAM */
#  define GPR_GPR18_FLEXRAM_BANK8_CFG_DTCM     (0x02 << GPR_GPR18_FLEXRAM_BANK8_CFG_SHIFT) /* RAM bank 8 is DTCM */
#  define GPR_GPR18_FLEXRAM_BANK8_CFG_ITCM     (0x03 << GPR_GPR18_FLEXRAM_BANK8_CFG_SHIFT) /* RAM bank 8 is ITCM */

#define GPR_GPR18_FLEXRAM_BANK9_CFG_SHIFT      (2)   /* Bits 2-3:   FlexRAM bank 9 config value */
#define GPR_GPR18_FLEXRAM_BANK9_CFG_MASK       (0x03 << GPR_GPR18_FLEXRAM_BANK1_CFG_SHIFT)
#  define GPR_GPR18_FLEXRAM_BANK9_CFG_NOTUSED  (0x00 << GPR_GPR18_FLEXRAM_BANK9_CFG_SHIFT) /* RAM bank 9 is not used */
#  define GPR_GPR18_FLEXRAM_BANK9_CFG_OCRAM    (0x01 << GPR_GPR18_FLEXRAM_BANK9_CFG_SHIFT) /* RAM bank 9 is OCRAM */
#  define GPR_GPR18_FLEXRAM_BANK9_CFG_DTCM     (0x02 << GPR_GPR18_FLEXRAM_BANK9_CFG_SHIFT) /* RAM bank 9 is DTCM */
#  define GPR_GPR18_FLEXRAM_BANK9_CFG_ITCM     (0x03 << GPR_GPR18_FLEXRAM_BANK9_CFG_SHIFT) /* RAM bank 9 is ITCM */

#define GPR_GPR18_FLEXRAM_BANK10_CFG_SHIFT     (4)   /* Bits 4-5:   FlexRAM bank 10 config value */
#define GPR_GPR18_FLEXRAM_BANK10_CFG_MASK      (0x03 << GPR_GPR18_FLEXRAM_BANK10_CFG_SHIFT)
#  define GPR_GPR18_FLEXRAM_BANK10_CFG_NOTUSED (0x00 << GPR_GPR18_FLEXRAM_BANK10_CFG_SHIFT) /* RAM bank 10 is not used */
#  define GPR_GPR18_FLEXRAM_BANK10_CFG_OCRAM   (0x01 << GPR_GPR18_FLEXRAM_BANK10_CFG_SHIFT) /* RAM bank 10 is OCRAM */
#  define GPR_GPR18_FLEXRAM_BANK10_CFG_DTCM    (0x02 << GPR_GPR18_FLEXRAM_BANK10_CFG_SHIFT) /* RAM bank 10 is DTCM */
#  define GPR_GPR18_FLEXRAM_BANK10_CFG_ITCM    (0x03 << GPR_GPR18_FLEXRAM_BANK10_CFG_SHIFT) /* RAM bank 10 is ITCM */

#define GPR_GPR18_FLEXRAM_BANK11_CFG_SHIFT     (6)   /* Bits 6-7:   FlexRAM bank 11 config value */
#define GPR_GPR18_FLEXRAM_BANK11_CFG_MASK      (0x03 << GPR_GPR18_FLEXRAM_BANK11_CFG_SHIFT)
#  define GPR_GPR18_FLEXRAM_BANK11_CFG_NOTUSED (0x00 << GPR_GPR18_FLEXRAM_BANK11_CFG_SHIFT) /* RAM bank 11 is not used */
#  define GPR_GPR18_FLEXRAM_BANK11_CFG_OCRAM   (0x01 << GPR_GPR18_FLEXRAM_BANK11_CFG_SHIFT) /* RAM bank 11 is OCRAM */
#  define GPR_GPR18_FLEXRAM_BANK11_CFG_DTCM    (0x02 << GPR_GPR18_FLEXRAM_BANK11_CFG_SHIFT) /* RAM bank 11 is DTCM */
#  define GPR_GPR18_FLEXRAM_BANK11_CFG_ITCM    (0x03 << GPR_GPR18_FLEXRAM_BANK11_CFG_SHIFT) /* RAM bank 11 is ITCM */

#define GPR_GPR18_FLEXRAM_BANK12_CFG_SHIFT     (8)   /* Bits 8-9:   FlexRAM bank 12 config value */
#define GPR_GPR18_FLEXRAM_BANK12_CFG_MASK      (0x03 << GPR_GPR18_FLEXRAM_BANK12_CFG_SHIFT)
#  define GPR_GPR18_FLEXRAM_BANK12_CFG_NOTUSED (0x00 << GPR_GPR18_FLEXRAM_BANK12_CFG_SHIFT) /* RAM bank 12 is not used */
#  define GPR_GPR18_FLEXRAM_BANK12_CFG_OCRAM   (0x01 << GPR_GPR18_FLEXRAM_BANK12_CFG_SHIFT) /* RAM bank 12 is OCRAM */
#  define GPR_GPR18_FLEXRAM_BANK12_CFG_DTCM    (0x02 << GPR_GPR18_FLEXRAM_BANK12_CFG_SHIFT) /* RAM bank 12 is DTCM */
#  define GPR_GPR18_FLEXRAM_BANK12_CFG_ITCM    (0x03 << GPR_GPR18_FLEXRAM_BANK12_CFG_SHIFT) /* RAM bank 12 is ITCM */

#define GPR_GPR18_FLEXRAM_BANK13_CFG_SHIFT     (10)  /* Bits 10-11: FlexRAM bank 13 config value */
#define GPR_GPR18_FLEXRAM_BANK13_CFG_MASK      (0x03 << GPR_GPR18_FLEXRAM_BANK13_CFG_SHIFT)
#  define GPR_GPR18_FLEXRAM_BANK13_CFG_NOTUSED (0x00 << GPR_GPR18_FLEXRAM_BANK13_CFG_SHIFT) /* RAM bank 13 is not used */
#  define GPR_GPR18_FLEXRAM_BANK13_CFG_OCRAM   (0x01 << GPR_GPR18_FLEXRAM_BANK13_CFG_SHIFT) /* RAM bank 13 is OCRAM */
#  define GPR_GPR18_FLEXRAM_BANK13_CFG_DTCM    (0x02 << GPR_GPR18_FLEXRAM_BANK13_CFG_SHIFT) /* RAM bank 13 is DTCM */
#  define GPR_GPR18_FLEXRAM_BANK13_CFG_ITCM    (0x03 << GPR_GPR18_FLEXRAM_BANK13_CFG_SHIFT) /* RAM bank 13 is ITCM */

#define GPR_GPR18_FLEXRAM_BANK14_CFG_SHIFT     (12)  /* Bits 12-13: FlexRAM bank 14 config value */
#define GPR_GPR18_FLEXRAM_BANK14_CFG_MASK      (0x03 << GPR_GPR18_FLEXRAM_BANK14_CFG_SHIFT)
#  define GPR_GPR18_FLEXRAM_BANK14_CFG_NOTUSED (0x00 << GPR_GPR18_FLEXRAM_BANK14_CFG_SHIFT) /* RAM bank 14 is not used */
#  define GPR_GPR18_FLEXRAM_BANK14_CFG_OCRAM   (0x01 << GPR_GPR18_FLEXRAM_BANK14_CFG_SHIFT) /* RAM bank 14 is OCRAM */
#  define GPR_GPR18_FLEXRAM_BANK14_CFG_DTCM    (0x02 << GPR_GPR18_FLEXRAM_BANK14_CFG_SHIFT) /* RAM bank 14 is DTCM */
#  define GPR_GPR18_FLEXRAM_BANK14_CFG_ITCM    (0x03 << GPR_GPR18_FLEXRAM_BANK14_CFG_SHIFT) /* RAM bank 14 is ITCM */

#define GPR_GPR18_FLEXRAM_BANK15_CFG_SHIFT     (14)  /* Bits 14-15: FlexRAM bank 15 config value */
#define GPR_GPR18_FLEXRAM_BANK15_CFG_MASK      (0x03 << GPR_GPR18_FLEXRAM_BANK15_CFG_SHIFT)
#  define GPR_GPR18_FLEXRAM_BANK15_CFG_NOTUSED (0x00 << GPR_GPR18_FLEXRAM_BANK15_CFG_SHIFT) /* RAM bank 15 is not used */
#  define GPR_GPR18_FLEXRAM_BANK15_CFG_OCRAM   (0x01 << GPR_GPR18_FLEXRAM_BANK15_CFG_SHIFT) /* RAM bank 15 is OCRAM */
#  define GPR_GPR18_FLEXRAM_BANK15_CFG_DTCM    (0x02 << GPR_GPR18_FLEXRAM_BANK15_CFG_SHIFT) /* RAM bank 15 is DTCM */
#  define GPR_GPR18_FLEXRAM_BANK15_CFG_ITCM    (0x03 << GPR_GPR18_FLEXRAM_BANK15_CFG_SHIFT) /* RAM bank 15 is ITCM */

                                                    /* Bits 16-27: Reserved */

