apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define GPR_GPR18_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR18_DWP_MASK                (0x03 << GPR_GPR18_DWP_SHIFT)
#  define GPR_GPR18_DWP_ALLOWBOTH         (0x00 << GPR_GPR18_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR18_DWP_DENYCM7           (0x01 << GPR_GPR18_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR18_DWP_DENYCM4           (0x02 << GPR_GPR18_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR18_DWP_DENYBOTH          (0x03 << GPR_GPR18_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR18_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR18_DWP_LOCK_MASK           (0x03 << GPR_GPR18_DWP_LOCK_SHIFT)
#  define GPR_GPR18_DWP_LOCK_NOLCK        (0x00 << GPR_GPR18_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR18_DWP_LOCK_LCKLO        (0x01 << GPR_GPR18_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR18_DWP_LOCK_LCKHI        (0x02 << GPR_GPR18_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR18_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR18_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 20 (GPR20) */

#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_4        (1 << 0)  /* Bit 0:  IOMUXC XBAR_INOUT4 function direction select (IOMUXC_XBAR_DIR_SEL_4) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_4_IN   (0 << 0)  /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_4_OUT  (1 << 0)  /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_5        (1 << 1)  /* Bit 1:  IOMUXC XBAR_INOUT5 function direction select (IOMUXC_XBAR_DIR_SEL_5) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_5_IN   (0 << 1)  /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_5_OUT  (1 << 1)  /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_6        (1 << 2)  /* Bit 2:  IOMUXC XBAR_INOUT6 function direction select (IOMUXC_XBAR_DIR_SEL_6) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_6_IN   (0 << 2)  /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_6_OUT  (1 << 2)  /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_7        (1 << 3)  /* Bit 3:  IOMUXC XBAR_INOUT7 function direction select (IOMUXC_XBAR_DIR_SEL_7) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_7_IN   (0 << 3)  /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_7_OUT  (1 << 3)  /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_8        (1 << 4)  /* Bit 4:  IOMUXC XBAR_INOUT8 function direction select (IOMUXC_XBAR_DIR_SEL_8) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_8_IN   (0 << 4)  /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_8_OUT  (1 << 4)  /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_9        (1 << 5)  /* Bit 5:  IOMUXC XBAR_INOUT9 function direction select (IOMUXC_XBAR_DIR_SEL_9) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_9_IN   (0 << 5)  /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_9_OUT  (1 << 5)  /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_10       (1 << 6)  /* Bit 6:  IOMUXC XBAR_INOUT10 function direction select (IOMUXC_XBAR_DIR_SEL_10) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_10_IN  (0 << 6)  /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_10_OUT (1 << 6)  /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_11       (1 << 7)  /* Bit 7:  IOMUXC XBAR_INOUT11 function direction select (IOMUXC_XBAR_DIR_SEL_11) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_11_IN  (0 << 7)  /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_11_OUT (1 << 7)  /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_12       (1 << 8)  /* Bit 8:  IOMUXC XBAR_INOUT12 function direction select (IOMUXC_XBAR_DIR_SEL_12) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_12_IN  (0 << 8)  /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_12_OUT (1 << 8)  /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_13       (1 << 9)  /* Bit 9:  IOMUXC XBAR_INOUT13 function direction select (IOMUXC_XBAR_DIR_SEL_13) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_13_IN  (0 << 9)  /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_13_OUT (1 << 9)  /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_14       (1 << 10) /* Bit 10: IOMUXC XBAR_INOUT14 function direction select (IOMUXC_XBAR_DIR_SEL_14) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_14_IN  (0 << 10) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_14_OUT (1 << 10) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_15       (1 << 11) /* Bit 11: IOMUXC XBAR_INOUT15 function direction select (IOMUXC_XBAR_DIR_SEL_15) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_15_IN  (0 << 11) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_15_OUT (1 << 11) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_16       (1 << 12) /* Bit 12: IOMUXC XBAR_INOUT16 function direction select (IOMUXC_XBAR_DIR_SEL_16) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_16_IN  (0 << 12) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_16_OUT (1 << 12) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_17       (1 << 13) /* Bit 13: IOMUXC XBAR_INOUT17 function direction select (IOMUXC_XBAR_DIR_SEL_17) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_17_IN  (0 << 13) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_17_OUT (1 << 13) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_18       (1 << 14) /* Bit 14: IOMUXC XBAR_INOUT18 function direction select (IOMUXC_XBAR_DIR_SEL_18) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_18_IN  (0 << 14) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_18_OUT (1 << 14) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_19       (1 << 15) /* Bit 15: IOMUXC XBAR_INOUT19 function direction select (IOMUXC_XBAR_DIR_SEL_19) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_19_IN  (0 << 15) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_19_OUT (1 << 15) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_20       (1 << 16) /* Bit 16: IOMUXC XBAR_INOUT20 function direction select (IOMUXC_XBAR_DIR_SEL_20) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_20_IN  (0 << 16) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_20_OUT (1 << 16) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_21       (1 << 17) /* Bit 17: IOMUXC XBAR_INOUT21 function direction select (IOMUXC_XBAR_DIR_SEL_21) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_21_IN  (0 << 17) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_21_OUT (1 << 17) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_22       (1 << 18) /* Bit 18: IOMUXC XBAR_INOUT22 function direction select (IOMUXC_XBAR_DIR_SEL_22) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_22_IN  (0 << 18) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_22_OUT (1 << 18) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_23       (1 << 19) /* Bit 19: IOMUXC XBAR_INOUT23 function direction select (IOMUXC_XBAR_DIR_SEL_23) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_23_IN  (0 << 19) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_23_OUT (1 << 19) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_24       (1 << 20) /* Bit 20: IOMUXC XBAR_INOUT24 function direction select (IOMUXC_XBAR_DIR_SEL_24) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_24_IN  (0 << 20) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_24_OUT (1 << 20) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_25       (1 << 21) /* Bit 21: IOMUXC XBAR_INOUT25 function direction select (IOMUXC_XBAR_DIR_SEL_25) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_25_IN  (0 << 21) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_25_OUT (1 << 21) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_26       (1 << 22) /* Bit 22: IOMUXC XBAR_INOUT26 function direction select (IOMUXC_XBAR_DIR_SEL_26) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_26_IN  (0 << 22) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_26_OUT (1 << 22) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_27       (1 << 23) /* Bit 23: IOMUXC XBAR_INOUT27 function direction select (IOMUXC_XBAR_DIR_SEL_27) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_27_IN  (0 << 23) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_27_OUT (1 << 23) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_28       (1 << 24) /* Bit 24: IOMUXC XBAR_INOUT28 function direction select (IOMUXC_XBAR_DIR_SEL_28) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_28_IN  (0 << 24) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_28_OUT (1 << 24) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_29       (1 << 25) /* Bit 25: IOMUXC XBAR_INOUT29 function direction select (IOMUXC_XBAR_DIR_SEL_29) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_29_IN  (0 << 25) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_29_OUT (1 << 25) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_30       (1 << 26) /* Bit 26: IOMUXC XBAR_INOUT30 function direction select (IOMUXC_XBAR_DIR_SEL_30) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_30_IN  (0 << 26) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_30_OUT (1 << 26) /*         XBAR_INOUT as output */
#define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_31       (1 << 27) /* Bit 27: IOMUXC XBAR_INOUT31 function direction select (IOMUXC_XBAR_DIR_SEL_31) */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_31_IN  (0 << 27) /*         XBAR_INOUT as input */
#  define GPR_GPR20_IOMUXC_XBAR_DIR_SEL_31_OUT (1 << 27) /*         XBAR_INOUT as output */

#define GPR_GPR20_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR20_DWP_MASK                (0x03 << GPR_GPR20_DWP_SHIFT)
#  define GPR_GPR20_DWP_ALLOWBOTH         (0x00 << GPR_GPR20_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR20_DWP_DENYCM7           (0x01 << GPR_GPR20_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR20_DWP_DENYCM4           (0x02 << GPR_GPR20_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR20_DWP_DENYBOTH          (0x03 << GPR_GPR20_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR20_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR20_DWP_LOCK_MASK           (0x03 << GPR_GPR20_DWP_LOCK_SHIFT)
#  define GPR_GPR20_DWP_LOCK_NOLCK        (0x00 << GPR_GPR20_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR20_DWP_LOCK_LCKLO        (0x01 << GPR_GPR20_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR20_DWP_LOCK_LCKHI        (0x02 << GPR_GPR20_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR20_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR20_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 21 (GPR21) */

#define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_32       (1 << 0)  /* Bit 0:  IOMUXC XBAR_INOUT32 function direction select (IOMUXC_XBAR_DIR_SEL_32) */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_32_IN  (0 << 0)  /*         XBAR_INOUT as input */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_32_OUT (1 << 0)  /*         XBAR_INOUT as output */
#define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_33       (1 << 1)  /* Bit 1:  IOMUXC XBAR_INOUT33 function direction select (IOMUXC_XBAR_DIR_SEL_33) */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_33_IN  (0 << 1)  /*         XBAR_INOUT as input */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_33_OUT (1 << 1)  /*         XBAR_INOUT as output */
#define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_34       (1 << 2)  /* Bit 2:  IOMUXC XBAR_INOUT34 function direction select (IOMUXC_XBAR_DIR_SEL_34) */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_34_IN  (0 << 2)  /*         XBAR_INOUT as input */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_34_OUT (1 << 2)  /*         XBAR_INOUT as output */
#define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_35       (1 << 3)  /* Bit 3:  IOMUXC XBAR_INOUT35 function direction select (IOMUXC_XBAR_DIR_SEL_35) */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_35_IN  (0 << 3)  /*         XBAR_INOUT as input */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_35_OUT (1 << 3)  /*         XBAR_INOUT as output */
#define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_36       (1 << 4)  /* Bit 4:  IOMUXC XBAR_INOUT36 function direction select (IOMUXC_XBAR_DIR_SEL_36) */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_36_IN  (0 << 4)  /*         XBAR_INOUT as input */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_36_OUT (1 << 4)  /*         XBAR_INOUT as output */
#define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_37       (1 << 5)  /* Bit 5:  IOMUXC XBAR_INOUT37 function direction select (IOMUXC_XBAR_DIR_SEL_37) */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_37_IN  (0 << 5)  /*         XBAR_INOUT as input */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_37_OUT (1 << 5)  /*         XBAR_INOUT as output */
#define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_38       (1 << 6)  /* Bit 6:  IOMUXC XBAR_INOUT38 function direction select (IOMUXC_XBAR_DIR_SEL_38) */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_38_IN  (0 << 6)  /*         XBAR_INOUT as input */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_38_OUT (1 << 6)  /*         XBAR_INOUT as output */
#define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_39       (1 << 7)  /* Bit 7:  IOMUXC XBAR_INOUT39 function direction select (IOMUXC_XBAR_DIR_SEL_39) */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_39_IN  (0 << 7)  /*         XBAR_INOUT as input */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_39_OUT (1 << 7)  /*         XBAR_INOUT as output */
#define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_40       (1 << 8)  /* Bit 8:  IOMUXC XBAR_INOUT40 function direction select (IOMUXC_XBAR_DIR_SEL_40) */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_40_IN  (0 << 8)  /*         XBAR_INOUT as input */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_40_OUT (1 << 8)  /*         XBAR_INOUT as output */
#define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_41       (1 << 9)  /* Bit 9:  IOMUXC XBAR_INOUT41 function direction select (IOMUXC_XBAR_DIR_SEL_41) */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_41_IN  (0 << 9)  /*         XBAR_INOUT as input */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_41_OUT (1 << 9)  /*         XBAR_INOUT as output */
#define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_42       (1 << 10) /* Bit 10: IOMUXC XBAR_INOUT42 function direction select (IOMUXC_XBAR_DIR_SEL_42) */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_42_IN  (0 << 10) /*         XBAR_INOUT as input */
#  define GPR_GPR21_IOMUXC_XBAR_DIR_SEL_42_OUT (1 << 10) /*         XBAR_INOUT as output */

