apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
                                                    /* Bits 11-15: Reserved */

                                                    /* Bits 16-27: Reserved */

#define GPR_GPR21_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR21_DWP_MASK                (0x03 << GPR_GPR21_DWP_SHIFT)
#  define GPR_GPR21_DWP_ALLOWBOTH         (0x00 << GPR_GPR21_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR21_DWP_DENYCM7           (0x01 << GPR_GPR21_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR21_DWP_DENYCM4           (0x02 << GPR_GPR21_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR21_DWP_DENYBOTH          (0x03 << GPR_GPR21_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR21_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR21_DWP_LOCK_MASK           (0x03 << GPR_GPR21_DWP_LOCK_SHIFT)
#  define GPR_GPR21_DWP_LOCK_NOLCK        (0x00 << GPR_GPR21_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR21_DWP_LOCK_LCKLO        (0x01 << GPR_GPR21_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR21_DWP_LOCK_LCKHI        (0x02 << GPR_GPR21_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR21_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR21_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 22 (GPR22) */

#define GPR_GPR22_REF_1M_CLK_GPT1         (1 << 0)  /* Bit 0:      GPT1 1 MHz clock source select (REF_1M_CLK_GPT1) */
#define GPR_GPR22_REF_1M_CLK_GPT1_CLKROOT (0 << 0)  /*             GPT1 IPG_CLK_HIGHFREQ driven by GPT1_CLK_ROOT */
#define GPR_GPR22_REF_1M_CLK_GPT1_RCOSC   (1 << 0)  /*             GPT1 IPG_CLK_HIGHFREQ driven by 1 MHz clock derived from RCOSC_400M */
                                                    /* Bits 1-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR22_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR22_DWP_MASK                (0x03 << GPR_GPR22_DWP_SHIFT)
#  define GPR_GPR22_DWP_ALLOWBOTH         (0x00 << GPR_GPR22_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR22_DWP_DENYCM7           (0x01 << GPR_GPR22_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR22_DWP_DENYCM4           (0x02 << GPR_GPR22_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR22_DWP_DENYBOTH          (0x03 << GPR_GPR22_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR22_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR22_DWP_LOCK_MASK           (0x03 << GPR_GPR22_DWP_LOCK_SHIFT)
#  define GPR_GPR22_DWP_LOCK_NOLCK        (0x00 << GPR_GPR22_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR22_DWP_LOCK_LCKLO        (0x01 << GPR_GPR22_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR22_DWP_LOCK_LCKHI        (0x02 << GPR_GPR22_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR22_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR22_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 23 (GPR23) */

#define GPR_GPR23_REF_1M_CLK_GPT2         (1 << 0)  /* Bit 0:      GPT2 1 MHz clock source select (REF_1M_CLK_GPT2) */
#define GPR_GPR23_REF_1M_CLK_GPT2_CLKROOT (0 << 0)  /*             GPT2 IPG_CLK_HIGHFREQ driven by GPT2_CLK_ROOT */
#define GPR_GPR23_REF_1M_CLK_GPT2_RCOSC   (1 << 0)  /*             GPT2 IPG_CLK_HIGHFREQ driven by 1 MHz clock derived from RCOSC_400M */
#define GPR_GPR23_GPT2_CAPIN1_SEL         (1 << 1)  /* Bit 1:      GPT2 input capture channel 1 source select (GPT2_CAPIN1_SEL) */
#define GPR_GPR23_GPT2_CAPIN1_SEL_PAD     (0 << 1)  /*             Source from pad */
#define GPR_GPR23_GPT2_CAPIN1_SEL_ENET    (1 << 1)  /*             Source from ENET_1588_EVENT1_OUT */
#define GPR_GPR23_GPT2_CAPIN2_SEL         (1 << 2)  /* Bit 2:      GPT2 input capture channel 2 source select (GPT2_CAPIN2_SEL) */
#define GPR_GPR23_GPT2_CAPIN2_SEL_PAD     (0 << 2)  /*             Source from pad */
#define GPR_GPR23_GPT2_CAPIN2_SEL_ENET    (1 << 2)  /*             Source from ENET1G_1588_EVENT1_OUT */
                                                    /* Bits 3-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR23_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR23_DWP_MASK                (0x03 << GPR_GPR23_DWP_SHIFT)
#  define GPR_GPR23_DWP_ALLOWBOTH         (0x00 << GPR_GPR23_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR23_DWP_DENYCM7           (0x01 << GPR_GPR23_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR23_DWP_DENYCM4           (0x02 << GPR_GPR23_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR23_DWP_DENYBOTH          (0x03 << GPR_GPR23_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR23_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR23_DWP_LOCK_MASK           (0x03 << GPR_GPR23_DWP_LOCK_SHIFT)
#  define GPR_GPR23_DWP_LOCK_NOLCK        (0x00 << GPR_GPR23_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR23_DWP_LOCK_LCKLO        (0x01 << GPR_GPR23_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR23_DWP_LOCK_LCKHI        (0x02 << GPR_GPR23_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR23_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR23_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 24 (GPR24) */

#define GPR_GPR24_REF_1M_CLK_GPT3         (1 << 0)  /* Bit 0:      GPT3 1 MHz clock source select (REF_1M_CLK_GPT3) */
#define GPR_GPR24_REF_1M_CLK_GPT3_CLKROOT (0 << 0)  /*             GPT3 IPG_CLK_HIGHFREQ driven by GPT3_CLK_ROOT */
#define GPR_GPR24_REF_1M_CLK_GPT3_RCOSC   (1 << 0)  /*             GPT3 IPG_CLK_HIGHFREQ driven by 1 MHz clock derived from RCOSC_400M */
#define GPR_GPR24_GPT3_CAPIN1_SEL         (1 << 1)  /* Bit 1:      GPT3 input capture channel 1 source select (GPT3_CAPIN1_SEL) */
#define GPR_GPR24_GPT3_CAPIN1_SEL_PAD     (0 << 1)  /*             Source from pad */
#define GPR_GPR24_GPT3_CAPIN1_SEL_ENET    (1 << 1)  /*             Source from ENET_QOS PTP_PPS_O[1] */
                                                    /* Bits 2-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR24_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR24_DWP_MASK                (0x03 << GPR_GPR24_DWP_SHIFT)
#  define GPR_GPR24_DWP_ALLOWBOTH         (0x00 << GPR_GPR24_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR24_DWP_DENYCM7           (0x01 << GPR_GPR24_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR24_DWP_DENYCM4           (0x02 << GPR_GPR24_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR24_DWP_DENYBOTH          (0x03 << GPR_GPR24_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR24_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR24_DWP_LOCK_MASK           (0x03 << GPR_GPR24_DWP_LOCK_SHIFT)
#  define GPR_GPR24_DWP_LOCK_NOLCK        (0x00 << GPR_GPR24_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR24_DWP_LOCK_LCKLO        (0x01 << GPR_GPR24_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR24_DWP_LOCK_LCKHI        (0x02 << GPR_GPR24_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR24_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR24_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

