apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
/* General Purpose Register 25 (GPR25) */

#define GPR_GPR25_REF_1M_CLK_GPT4         (1 << 0)  /* Bit 0:      GPT4 1 MHz clock source select (REF_1M_CLK_GPT4) */
#define GPR_GPR25_REF_1M_CLK_GPT4_CLKROOT (0 << 0)  /*             GPT4 IPG_CLK_HIGHFREQ driven by GPT4_CLK_ROOT */
#define GPR_GPR25_REF_1M_CLK_GPT4_RCOSC   (1 << 0)  /*             GPT4 IPG_CLK_HIGHFREQ driven by 1 MHz clock derived from RCOSC_400M */
                                                    /* Bits 1-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR25_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR25_DWP_MASK                (0x03 << GPR_GPR25_DWP_SHIFT)
#  define GPR_GPR25_DWP_ALLOWBOTH         (0x00 << GPR_GPR25_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR25_DWP_DENYCM7           (0x01 << GPR_GPR25_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR25_DWP_DENYCM4           (0x02 << GPR_GPR25_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR25_DWP_DENYBOTH          (0x03 << GPR_GPR25_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR25_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR25_DWP_LOCK_MASK           (0x03 << GPR_GPR25_DWP_LOCK_SHIFT)
#  define GPR_GPR25_DWP_LOCK_NOLCK        (0x00 << GPR_GPR25_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR25_DWP_LOCK_LCKLO        (0x01 << GPR_GPR25_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR25_DWP_LOCK_LCKHI        (0x02 << GPR_GPR25_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR25_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR25_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 26 (GPR26) */

#define GPR_GPR26_REF_1M_CLK_GPT5         (1 << 0)  /* Bit 0:      GPT5 1 MHz clock source select (REF_1M_CLK_GPT5) */
#define GPR_GPR26_REF_1M_CLK_GPT5_CLKROOT (0 << 0)  /*             GPT5 IPG_CLK_HIGHFREQ driven by GPT5_CLK_ROOT */
#define GPR_GPR26_REF_1M_CLK_GPT5_RCOSC   (1 << 0)  /*             GPT5 IPG_CLK_HIGHFREQ driven by 1 MHz clock derived from RCOSC_400M */
                                                    /* Bits 1-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR26_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR26_DWP_MASK                (0x03 << GPR_GPR26_DWP_SHIFT)
#  define GPR_GPR26_DWP_ALLOWBOTH         (0x00 << GPR_GPR26_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR26_DWP_DENYCM7           (0x01 << GPR_GPR26_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR26_DWP_DENYCM4           (0x02 << GPR_GPR26_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR26_DWP_DENYBOTH          (0x03 << GPR_GPR26_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR26_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR26_DWP_LOCK_MASK           (0x03 << GPR_GPR26_DWP_LOCK_SHIFT)
#  define GPR_GPR26_DWP_LOCK_NOLCK        (0x00 << GPR_GPR26_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR26_DWP_LOCK_LCKLO        (0x01 << GPR_GPR26_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR26_DWP_LOCK_LCKHI        (0x02 << GPR_GPR26_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR26_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR26_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 27 (GPR27) */

#define GPR_GPR27_REF_1M_CLK_GPT6         (1 << 0)  /* Bit 0:      GPT6 1 MHz clock source select (REF_1M_CLK_GPT6) */
#define GPR_GPR27_REF_1M_CLK_GPT6_CLKROOT (0 << 0)  /*             GPT6 IPG_CLK_HIGHFREQ driven by GPT6_CLK_ROOT */
#define GPR_GPR27_REF_1M_CLK_GPT6_RCOSC   (1 << 0)  /*             GPT6 IPG_CLK_HIGHFREQ driven by 1 MHz clock derived from RCOSC_400M */
                                                    /* Bits 1-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR27_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR27_DWP_MASK                (0x03 << GPR_GPR27_DWP_SHIFT)
#  define GPR_GPR27_DWP_ALLOWBOTH         (0x00 << GPR_GPR27_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR27_DWP_DENYCM7           (0x01 << GPR_GPR27_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR27_DWP_DENYCM4           (0x02 << GPR_GPR27_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR27_DWP_DENYBOTH          (0x03 << GPR_GPR27_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR27_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR27_DWP_LOCK_MASK           (0x03 << GPR_GPR27_DWP_LOCK_SHIFT)
#  define GPR_GPR27_DWP_LOCK_NOLCK        (0x00 << GPR_GPR27_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR27_DWP_LOCK_LCKLO        (0x01 << GPR_GPR27_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR27_DWP_LOCK_LCKHI        (0x02 << GPR_GPR27_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR27_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR27_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 28 (GPR28) */

#define GPR_GPR28_ARCACHE_USDHC           (1 << 0)  /* Bit 0:      uSDHC block cacheable attribute value of AXI read transactions (ARCACHE_USDHC) */
#define GPR_GPR28_AWCACHE_USDHC           (1 << 1)  /* Bit 1:      uSDHC block cacheable attribute value of AXI write transactions (AWCACHE_USDHC) */
                                                    /* Bits 2-4:   Reserved */
#define GPR_GPR28_CACHE_ENET1G            (1 << 5)  /* Bit 5:      ENET1G block cacheable attribute value of AXI transactions (CACHE_ENET1G) */
                                                    /* Bit 6:      Reserved */
#define GPR_GPR28_CACHE_ENET              (1 << 7)  /* Bit 7:      ENET block cacheable attribute value of AXI transactions (CACHE_ENET) */
                                                    /* Bits 8-12:  Reserved */
#define GPR_GPR28_CACHE_USB               (1 << 13) /* Bit 13:     USB block cacheable attribute value of AXI transactions (CACHE_USB) */
                                                    /* Bits 14-15: Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR28_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR28_DWP_MASK                (0x03 << GPR_GPR28_DWP_SHIFT)
#  define GPR_GPR28_DWP_ALLOWBOTH         (0x00 << GPR_GPR28_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR28_DWP_DENYCM7           (0x01 << GPR_GPR28_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR28_DWP_DENYCM4           (0x02 << GPR_GPR28_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR28_DWP_DENYBOTH          (0x03 << GPR_GPR28_DWP_SHIFT) /* Both cores are forbidden */

