apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define GPR_GPR28_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR28_DWP_LOCK_MASK           (0x03 << GPR_GPR28_DWP_LOCK_SHIFT)
#  define GPR_GPR28_DWP_LOCK_NOLCK        (0x00 << GPR_GPR28_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR28_DWP_LOCK_LCKLO        (0x01 << GPR_GPR28_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR28_DWP_LOCK_LCKHI        (0x02 << GPR_GPR28_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR28_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR28_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 29 (GPR29) */

#define GPR_GPR29_USBPHY1_IPG_CLK_ACTIVE  (1 << 0)  /* Bit 0:      USBPHY1 register access clock enable (USBPHY1_IPG_CLK_ACTIVE) */
                                                    /* Bits 1-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR29_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR29_DWP_MASK                (0x03 << GPR_GPR29_DWP_SHIFT)
#  define GPR_GPR29_DWP_ALLOWBOTH         (0x00 << GPR_GPR29_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR29_DWP_DENYCM7           (0x01 << GPR_GPR29_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR29_DWP_DENYCM4           (0x02 << GPR_GPR29_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR29_DWP_DENYBOTH          (0x03 << GPR_GPR29_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR29_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR29_DWP_LOCK_MASK           (0x03 << GPR_GPR29_DWP_LOCK_SHIFT)
#  define GPR_GPR29_DWP_LOCK_NOLCK        (0x00 << GPR_GPR29_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR29_DWP_LOCK_LCKLO        (0x01 << GPR_GPR29_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR29_DWP_LOCK_LCKHI        (0x02 << GPR_GPR29_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR29_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR29_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 30 (GPR30) */

#define GPR_GPR30_USBPHY2_IPG_CLK_ACTIVE  (1 << 0)  /* Bit 0:      USBPHY2 register access clock enable (USBPHY2_IPG_CLK_ACTIVE) */
                                                    /* Bits 1-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR30_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR30_DWP_MASK                (0x03 << GPR_GPR30_DWP_SHIFT)
#  define GPR_GPR30_DWP_ALLOWBOTH         (0x00 << GPR_GPR30_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR30_DWP_DENYCM7           (0x01 << GPR_GPR30_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR30_DWP_DENYCM4           (0x02 << GPR_GPR30_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR30_DWP_DENYBOTH          (0x03 << GPR_GPR30_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR30_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR30_DWP_LOCK_MASK           (0x03 << GPR_GPR30_DWP_LOCK_SHIFT)
#  define GPR_GPR30_DWP_LOCK_NOLCK        (0x00 << GPR_GPR30_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR30_DWP_LOCK_LCKLO        (0x01 << GPR_GPR30_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR30_DWP_LOCK_LCKHI        (0x02 << GPR_GPR30_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR30_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR30_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 31 (GPR31) */

#define GPR_GPR31_RMW2_WAIT_BVALID_CPL    (1 << 0)  /* Bit 0:      OCRAM M7 RMW wait enable (RMW2_WAIT_BVALID_CPL) */
                                                    /* Bit 1:      Reserved */
#define GPR_GPR31_OCRAM_M7_CLK_GATING     (1 << 2)  /* Bit 2:      OCRAM M7 clock gating enable (OCRAM_M7_CLK_GATING) */
                                                    /* Bits 3-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR31_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR31_DWP_MASK                (0x03 << GPR_GPR31_DWP_SHIFT)
#  define GPR_GPR31_DWP_ALLOWBOTH         (0x00 << GPR_GPR31_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR31_DWP_DENYCM7           (0x01 << GPR_GPR31_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR31_DWP_DENYCM4           (0x02 << GPR_GPR31_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR31_DWP_DENYBOTH          (0x03 << GPR_GPR31_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR31_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR31_DWP_LOCK_MASK           (0x03 << GPR_GPR31_DWP_LOCK_SHIFT)
#  define GPR_GPR31_DWP_LOCK_NOLCK        (0x00 << GPR_GPR31_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR31_DWP_LOCK_LCKLO        (0x01 << GPR_GPR31_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR31_DWP_LOCK_LCKHI        (0x02 << GPR_GPR31_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR31_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR31_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 32 (GPR32) */

#define GPR_GPR32_RMW1_WAIT_BVALID_CPL    (1 << 0)  /* Bit 0:      OCRAM1 RMW wait enable (RMW1_WAIT_BVALID_CPL) */
                                                    /* Bits 1-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR32_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR32_DWP_MASK                (0x03 << GPR_GPR32_DWP_SHIFT)
#  define GPR_GPR32_DWP_ALLOWBOTH         (0x00 << GPR_GPR32_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR32_DWP_DENYCM7           (0x01 << GPR_GPR32_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR32_DWP_DENYCM4           (0x02 << GPR_GPR32_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR32_DWP_DENYBOTH          (0x03 << GPR_GPR32_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR32_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR32_DWP_LOCK_MASK           (0x03 << GPR_GPR32_DWP_LOCK_SHIFT)
#  define GPR_GPR32_DWP_LOCK_NOLCK        (0x00 << GPR_GPR32_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR32_DWP_LOCK_LCKLO        (0x01 << GPR_GPR32_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR32_DWP_LOCK_LCKHI        (0x02 << GPR_GPR32_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR32_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR32_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

