apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
/* General Purpose Register 33 (GPR33) */

#define GPR_GPR33_RMW2_WAIT_BVALID_CPL    (1 << 0)  /* Bit 0:      OCRAM2 RMW wait enable (RMW2_WAIT_BVALID_CPL) */
                                                    /* Bits 1-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR33_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR33_DWP_MASK                (0x03 << GPR_GPR33_DWP_SHIFT)
#  define GPR_GPR33_DWP_ALLOWBOTH         (0x00 << GPR_GPR33_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR33_DWP_DENYCM7           (0x01 << GPR_GPR33_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR33_DWP_DENYCM4           (0x02 << GPR_GPR33_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR33_DWP_DENYBOTH          (0x03 << GPR_GPR33_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR33_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR33_DWP_LOCK_MASK           (0x03 << GPR_GPR33_DWP_LOCK_SHIFT)
#  define GPR_GPR33_DWP_LOCK_NOLCK        (0x00 << GPR_GPR33_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR33_DWP_LOCK_LCKLO        (0x01 << GPR_GPR33_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR33_DWP_LOCK_LCKHI        (0x02 << GPR_GPR33_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR33_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR33_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 34 (GPR34) */

#define GPR_GPR34_XECC_FLEXSPI1_WAIT_BVALID_CPL (1 << 0) /* Bit 0: XECC_FLEXSPI1 RMW wait enable (XECC_FLEXSPI1_WAIT_BVALID_CPL) */

#define GPR_GPR34_FLEXSPI1_OTFAD_EN       (1 << 1)  /* Bit 1: FlexSPI1 OTFAD enable (FLEXSPI1_OTFAD_EN) */
                                                    /* Bits 2-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR34_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR34_DWP_MASK                (0x03 << GPR_GPR34_DWP_SHIFT)
#  define GPR_GPR34_DWP_ALLOWBOTH         (0x00 << GPR_GPR34_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR34_DWP_DENYCM7           (0x01 << GPR_GPR34_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR34_DWP_DENYCM4           (0x02 << GPR_GPR34_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR34_DWP_DENYBOTH          (0x03 << GPR_GPR34_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR34_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR34_DWP_LOCK_MASK           (0x03 << GPR_GPR34_DWP_LOCK_SHIFT)
#  define GPR_GPR34_DWP_LOCK_NOLCK        (0x00 << GPR_GPR34_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR34_DWP_LOCK_LCKLO        (0x01 << GPR_GPR34_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR34_DWP_LOCK_LCKHI        (0x02 << GPR_GPR34_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR34_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR34_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 35 (GPR35) */

#define GPR_GPR35_XECC_FLEXSPI2_WAIT_BVALID_CPL (1 << 0) /* Bit 0: XECC_FLEXSPI2 RMW wait enable (XECC_FLEXSPI2_WAIT_BVALID_CPL) */

#define GPR_GPR35_FLEXSPI2_OTFAD_EN       (1 << 1)  /* Bit 1: FlexSPI2 OTFAD enable (FLEXSPI2_OTFAD_EN) */
                                                    /* Bits 2-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR35_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR35_DWP_MASK                (0x03 << GPR_GPR35_DWP_SHIFT)
#  define GPR_GPR35_DWP_ALLOWBOTH         (0x00 << GPR_GPR35_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR35_DWP_DENYCM7           (0x01 << GPR_GPR35_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR35_DWP_DENYCM4           (0x02 << GPR_GPR35_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR35_DWP_DENYBOTH          (0x03 << GPR_GPR35_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR35_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR35_DWP_LOCK_MASK           (0x03 << GPR_GPR35_DWP_LOCK_SHIFT)
#  define GPR_GPR35_DWP_LOCK_NOLCK        (0x00 << GPR_GPR35_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR35_DWP_LOCK_LCKLO        (0x01 << GPR_GPR35_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR35_DWP_LOCK_LCKHI        (0x02 << GPR_GPR35_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR35_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR35_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 36 (GPR36) */

#define GPR_GPR36_XECC_SEMC_WAIT_BVALID_CPL (1 << 0) /* Bit 0: XECC_SEMC RMW wait enable (XECC_SEMC_WAIT_BVALID_CPL) */

                                                    /* Bits 1-15:  Reserved */

                                                    /* Bits 16-27: Reserved */

#define GPR_GPR36_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR36_DWP_MASK                (0x03 << GPR_GPR36_DWP_SHIFT)
#  define GPR_GPR36_DWP_ALLOWBOTH         (0x00 << GPR_GPR36_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR36_DWP_DENYCM7           (0x01 << GPR_GPR36_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR36_DWP_DENYCM4           (0x02 << GPR_GPR36_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR36_DWP_DENYBOTH          (0x03 << GPR_GPR36_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR36_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR36_DWP_LOCK_MASK           (0x03 << GPR_GPR36_DWP_LOCK_SHIFT)
#  define GPR_GPR36_DWP_LOCK_NOLCK        (0x00 << GPR_GPR36_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR36_DWP_LOCK_LCKLO        (0x01 << GPR_GPR36_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR36_DWP_LOCK_LCKHI        (0x02 << GPR_GPR36_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR36_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR36_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 37 (GPR37) */

#define GPR_GPR37_NIDEN                   (1 << 0)  /* Bit 0:      ARM non-secure (non-invasive) debug enable (NIDEN) */
#define GPR_GPR37_DBG_EN                  (1 << 1)  /* Bit 1:      ARM invasive debug enable (DBG_EN) */
                                                    /* Bit 2:      Reserved */
#define GPR_GPR37_EXC_MON                           /* Bit 3:      Exclusive monitor response select of illegal command (EXC_MON) */
                                                    /* Bit 4:      Reserved */
#define GPR_GPR37_M7_DBG_ACK_MASK                   /* Bit 5:      CM7 debug halt mask (M7_DBG_ACK_MASK) */
#define GPR_GPR37_M4_DBG_ACK_MASK                   /* Bit 6:      CM4 debug halt mask (M4_DBG_ACK_MASK) */
                                                    /* Bits 7-15:  Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR37_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR37_DWP_MASK                (0x03 << GPR_GPR37_DWP_SHIFT)
#  define GPR_GPR37_DWP_ALLOWBOTH         (0x00 << GPR_GPR37_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR37_DWP_DENYCM7           (0x01 << GPR_GPR37_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR37_DWP_DENYCM4           (0x02 << GPR_GPR37_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR37_DWP_DENYBOTH          (0x03 << GPR_GPR37_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR37_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR37_DWP_LOCK_MASK           (0x03 << GPR_GPR37_DWP_LOCK_SHIFT)
#  define GPR_GPR37_DWP_LOCK_NOLCK        (0x00 << GPR_GPR37_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR37_DWP_LOCK_LCKLO        (0x01 << GPR_GPR37_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR37_DWP_LOCK_LCKHI        (0x02 << GPR_GPR37_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR37_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR37_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 38 (GPR38) - Reserved */

