apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
/* General Purpose Register 39 (GPR39) - Reserved */

/* General Purpose Register 40 (GPR40) */

#define GPR_GPR40_GPIO_MUX2_GPIO_SEL_LOW_SHIFT      (0) /* Bits 0-15: GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function (GPIO_MUX2_GPIO_SEL_LOW) */
#define GPR_GPR40_GPIO_MUX2_GPIO_SEL_LOW_MASK       (0xffff << GPR_GPR40_GPIO_MUX2_GPIO_SEL_LOW_SHIFT)
#  define GPR_GPR40_GPIO_MUX2_GPIO0_SEL_GPIO2       (0 << 0)   /* Select GPIO2_0 */
#  define GPR_GPR40_GPIO_MUX2_GPIO0_SEL_CM7_GPIO2   (1 << 0)   /* Select CM7_GPIO2_0 */
#  define GPR_GPR40_GPIO_MUX2_GPIO1_SEL_GPIO2       (0 << 1)   /* Select GPIO2_1 */
#  define GPR_GPR40_GPIO_MUX2_GPIO1_SEL_CM7_GPIO2   (1 << 1)   /* Select CM7_GPIO2_1 */
#  define GPR_GPR40_GPIO_MUX2_GPIO2_SEL_GPIO2       (0 << 2)   /* Select GPIO2_2 */
#  define GPR_GPR40_GPIO_MUX2_GPIO2_SEL_CM7_GPIO2   (1 << 2)   /* Select CM7_GPIO2_2 */
#  define GPR_GPR40_GPIO_MUX2_GPIO3_SEL_GPIO2       (0 << 3)   /* Select GPIO2_3 */
#  define GPR_GPR40_GPIO_MUX2_GPIO3_SEL_CM7_GPIO2   (1 << 3)   /* Select CM7_GPIO2_3 */
#  define GPR_GPR40_GPIO_MUX2_GPIO4_SEL_GPIO2       (0 << 4)   /* Select GPIO2_4 */
#  define GPR_GPR40_GPIO_MUX2_GPIO4_SEL_CM7_GPIO2   (1 << 4)   /* Select CM7_GPIO2_4 */
#  define GPR_GPR40_GPIO_MUX2_GPIO5_SEL_GPIO2       (0 << 5)   /* Select GPIO2_5 */
#  define GPR_GPR40_GPIO_MUX2_GPIO5_SEL_CM7_GPIO2   (1 << 5)   /* Select CM7_GPIO2_5 */
#  define GPR_GPR40_GPIO_MUX2_GPIO6_SEL_GPIO2       (0 << 6)   /* Select GPIO2_6 */
#  define GPR_GPR40_GPIO_MUX2_GPIO6_SEL_CM7_GPIO2   (1 << 6)   /* Select CM7_GPIO2_6 */
#  define GPR_GPR40_GPIO_MUX2_GPIO7_SEL_GPIO2       (0 << 7)   /* Select GPIO2_7 */
#  define GPR_GPR40_GPIO_MUX2_GPIO7_SEL_CM7_GPIO2   (1 << 7)   /* Select CM7_GPIO2_7 */
#  define GPR_GPR40_GPIO_MUX2_GPIO8_SEL_GPIO2       (0 << 8)   /* Select GPIO2_8 */
#  define GPR_GPR40_GPIO_MUX2_GPIO8_SEL_CM7_GPIO2   (1 << 8)   /* Select CM7_GPIO2_8 */
#  define GPR_GPR40_GPIO_MUX2_GPIO9_SEL_GPIO2       (0 << 9)   /* Select GPIO2_9 */
#  define GPR_GPR40_GPIO_MUX2_GPIO9_SEL_CM7_GPIO2   (1 << 9)   /* Select CM7_GPIO2_9 */
#  define GPR_GPR40_GPIO_MUX2_GPIO10_SEL_GPIO2      (0 << 10)  /* Select GPIO2_10 */
#  define GPR_GPR40_GPIO_MUX2_GPIO10_SEL_CM7_GPIO2  (1 << 10)  /* Select CM7_GPIO2_10 */
#  define GPR_GPR40_GPIO_MUX2_GPIO11_SEL_GPIO2      (0 << 11)  /* Select GPIO2_11 */
#  define GPR_GPR40_GPIO_MUX2_GPIO11_SEL_CM7_GPIO2  (1 << 11)  /* Select CM7_GPIO2_11 */
#  define GPR_GPR40_GPIO_MUX2_GPIO12_SEL_GPIO2      (0 << 12)  /* Select GPIO2_12 */
#  define GPR_GPR40_GPIO_MUX2_GPIO12_SEL_CM7_GPIO2  (1 << 12)  /* Select CM7_GPIO2_12 */
#  define GPR_GPR40_GPIO_MUX2_GPIO13_SEL_GPIO2      (0 << 13)  /* Select GPIO2_13 */
#  define GPR_GPR40_GPIO_MUX2_GPIO13_SEL_CM7_GPIO2  (1 << 13)  /* Select CM7_GPIO2_13 */
#  define GPR_GPR40_GPIO_MUX2_GPIO14_SEL_GPIO2      (0 << 14)  /* Select GPIO2_14 */
#  define GPR_GPR40_GPIO_MUX2_GPIO14_SEL_CM7_GPIO2  (1 << 14)  /* Select CM7_GPIO2_14 */
#  define GPR_GPR40_GPIO_MUX2_GPIO15_SEL_GPIO2      (0 << 15)  /* Select GPIO2_15 */
#  define GPR_GPR40_GPIO_MUX2_GPIO15_SEL_CM7_GPIO2  (1 << 15)  /* Select CM7_GPIO2_15 */
#  define GPR_GPR40_GPIO_MUX2_GPIO_SEL_GPIO2(n)     (0 << (n)) /* Select GPIO2_n */
#  define GPR_GPR40_GPIO_MUX2_GPIO_SEL_CM7_GPIO2(n) (1 << (n)) /* Select CM7_GPIO2_n */

                                                    /* Bits 16-27: Reserved */
#define GPR_GPR40_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR40_DWP_MASK                (0x03 << GPR_GPR40_DWP_SHIFT)
#  define GPR_GPR40_DWP_ALLOWBOTH         (0x00 << GPR_GPR40_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR40_DWP_DENYCM7           (0x01 << GPR_GPR40_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR40_DWP_DENYCM4           (0x02 << GPR_GPR40_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR40_DWP_DENYBOTH          (0x03 << GPR_GPR40_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR40_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR40_DWP_LOCK_MASK           (0x03 << GPR_GPR40_DWP_LOCK_SHIFT)
#  define GPR_GPR40_DWP_LOCK_NOLCK        (0x00 << GPR_GPR40_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR40_DWP_LOCK_LCKLO        (0x01 << GPR_GPR40_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR40_DWP_LOCK_LCKHI        (0x02 << GPR_GPR40_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR40_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR40_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 41 (GPR41) */

#define GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH_SHIFT     (0) /* Bits 0-15: GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function (GPIO_MUX2_GPIO_SEL_HIGH) */
#define GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH_MASK      (0xffff << GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH_SHIFT)
#  define GPR_GPR41_GPIO_MUX2_GPIO16_SEL_GPIO2      (0 << 0)       /* Select GPIO2_16 */
#  define GPR_GPR41_GPIO_MUX2_GPIO16_SEL_CM7_GPIO2  (1 << 0)       /* Select CM7_GPIO2_16 */
#  define GPR_GPR41_GPIO_MUX2_GPIO17_SEL_GPIO2      (0 << 1)       /* Select GPIO2_17 */
#  define GPR_GPR41_GPIO_MUX2_GPIO17_SEL_CM7_GPIO2  (1 << 1)       /* Select CM7_GPIO2_17 */
#  define GPR_GPR41_GPIO_MUX2_GPIO18_SEL_GPIO2      (0 << 2)       /* Select GPIO2_18 */
#  define GPR_GPR41_GPIO_MUX2_GPIO18_SEL_CM7_GPIO2  (1 << 2)       /* Select CM7_GPIO2_18 */
#  define GPR_GPR41_GPIO_MUX2_GPIO19_SEL_GPIO2      (0 << 3)       /* Select GPIO2_19 */
#  define GPR_GPR41_GPIO_MUX2_GPIO19_SEL_CM7_GPIO2  (1 << 3)       /* Select CM7_GPIO2_19 */
#  define GPR_GPR41_GPIO_MUX2_GPIO20_SEL_GPIO2      (0 << 4)       /* Select GPIO2_20 */
#  define GPR_GPR41_GPIO_MUX2_GPIO20_SEL_CM7_GPIO2  (1 << 4)       /* Select CM7_GPIO2_20 */
#  define GPR_GPR41_GPIO_MUX2_GPIO21_SEL_GPIO2      (0 << 5)       /* Select GPIO2_21 */
#  define GPR_GPR41_GPIO_MUX2_GPIO21_SEL_CM7_GPIO2  (1 << 5)       /* Select CM7_GPIO2_21 */
#  define GPR_GPR41_GPIO_MUX2_GPIO22_SEL_GPIO2      (0 << 6)       /* Select GPIO2_22 */
#  define GPR_GPR41_GPIO_MUX2_GPIO22_SEL_CM7_GPIO2  (1 << 6)       /* Select CM7_GPIO2_22 */
#  define GPR_GPR41_GPIO_MUX2_GPIO23_SEL_GPIO2      (0 << 7)       /* Select GPIO2_23 */
#  define GPR_GPR41_GPIO_MUX2_GPIO23_SEL_CM7_GPIO2  (1 << 7)       /* Select CM7_GPIO2_23 */
#  define GPR_GPR41_GPIO_MUX2_GPIO24_SEL_GPIO2      (0 << 8)       /* Select GPIO2_24 */
#  define GPR_GPR41_GPIO_MUX2_GPIO24_SEL_CM7_GPIO2  (1 << 8)       /* Select CM7_GPIO2_24 */
#  define GPR_GPR41_GPIO_MUX2_GPIO25_SEL_GPIO2      (0 << 9)       /* Select GPIO2_25 */
#  define GPR_GPR41_GPIO_MUX2_GPIO25_SEL_CM7_GPIO2  (1 << 9)       /* Select CM7_GPIO2_25 */
#  define GPR_GPR41_GPIO_MUX2_GPIO26_SEL_GPIO2      (0 << 10)      /* Select GPIO2_26 */
#  define GPR_GPR41_GPIO_MUX2_GPIO26_SEL_CM7_GPIO2  (1 << 10)      /* Select CM7_GPIO2_26 */
#  define GPR_GPR41_GPIO_MUX2_GPIO27_SEL_GPIO2      (0 << 11)      /* Select GPIO2_27 */
#  define GPR_GPR41_GPIO_MUX2_GPIO27_SEL_CM7_GPIO2  (1 << 11)      /* Select CM7_GPIO2_27 */
#  define GPR_GPR41_GPIO_MUX2_GPIO28_SEL_GPIO2      (0 << 12)      /* Select GPIO2_28 */
#  define GPR_GPR41_GPIO_MUX2_GPIO28_SEL_CM7_GPIO2  (1 << 12)      /* Select CM7_GPIO2_28 */
#  define GPR_GPR41_GPIO_MUX2_GPIO29_SEL_GPIO2      (0 << 13)      /* Select GPIO2_29 */
#  define GPR_GPR41_GPIO_MUX2_GPIO29_SEL_CM7_GPIO2  (1 << 13)      /* Select CM7_GPIO2_29 */
#  define GPR_GPR41_GPIO_MUX2_GPIO30_SEL_GPIO2      (0 << 14)      /* Select GPIO2_30 */
#  define GPR_GPR41_GPIO_MUX2_GPIO30_SEL_CM7_GPIO2  (1 << 14)      /* Select CM7_GPIO2_30 */
#  define GPR_GPR41_GPIO_MUX2_GPIO31_SEL_GPIO2      (0 << 15)      /* Select GPIO2_31 */
#  define GPR_GPR41_GPIO_MUX2_GPIO31_SEL_CM7_GPIO2  (1 << 15)      /* Select CM7_GPIO2_31 */
#  define GPR_GPR41_GPIO_MUX2_GPIO_SEL_GPIO2(n)     (0 << ((n)-16) /* Select GPIO2_n */
#  define GPR_GPR41_GPIO_MUX2_GPIO_SEL_CM7_GPIO2(n) (1 << ((n)-16) /* Select CM7_GPIO2_n */

                                                    /* Bits 16-27: Reserved */
#define GPR_GPR41_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR41_DWP_MASK                (0x03 << GPR_GPR41_DWP_SHIFT)
#  define GPR_GPR41_DWP_ALLOWBOTH         (0x00 << GPR_GPR41_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR41_DWP_DENYCM7           (0x01 << GPR_GPR41_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR41_DWP_DENYCM4           (0x02 << GPR_GPR41_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR41_DWP_DENYBOTH          (0x03 << GPR_GPR41_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR41_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR41_DWP_LOCK_MASK           (0x03 << GPR_GPR41_DWP_LOCK_SHIFT)
#  define GPR_GPR41_DWP_LOCK_NOLCK        (0x00 << GPR_GPR41_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR41_DWP_LOCK_LCKLO        (0x01 << GPR_GPR41_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR41_DWP_LOCK_LCKHI        (0x02 << GPR_GPR41_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR41_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR41_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 42 (GPR42) */

#define GPR_GPR42_GPIO_MUX3_GPIO_SEL_LOW_SHIFT      (0) /* Bits 0-15: GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function (GPIO_MUX3_GPIO_SEL_LOW) */
#define GPR_GPR42_GPIO_MUX3_GPIO_SEL_LOW_MASK       (0xffff << GPR_GPR42_GPIO_MUX3_GPIO_SEL_LOW_SHIFT)
#  define GPR_GPR42_GPIO_MUX3_GPIO0_SEL_GPIO3       (0 << 0)   /* Select GPIO3_0 */
#  define GPR_GPR42_GPIO_MUX3_GPIO0_SEL_CM7_GPIO3   (1 << 0)   /* Select CM7_GPIO3_0 */
#  define GPR_GPR42_GPIO_MUX3_GPIO1_SEL_GPIO3       (0 << 1)   /* Select GPIO3_1 */
#  define GPR_GPR42_GPIO_MUX3_GPIO1_SEL_CM7_GPIO3   (1 << 1)   /* Select CM7_GPIO3_1 */
#  define GPR_GPR42_GPIO_MUX3_GPIO2_SEL_GPIO3       (0 << 2)   /* Select GPIO3_2 */
#  define GPR_GPR42_GPIO_MUX3_GPIO2_SEL_CM7_GPIO3   (1 << 2)   /* Select CM7_GPIO3_2 */
#  define GPR_GPR42_GPIO_MUX3_GPIO3_SEL_GPIO3       (0 << 3)   /* Select GPIO3_3 */
#  define GPR_GPR42_GPIO_MUX3_GPIO3_SEL_CM7_GPIO3   (1 << 3)   /* Select CM7_GPIO3_3 */
#  define GPR_GPR42_GPIO_MUX3_GPIO4_SEL_GPIO3       (0 << 4)   /* Select GPIO3_4 */
#  define GPR_GPR42_GPIO_MUX3_GPIO4_SEL_CM7_GPIO3   (1 << 4)   /* Select CM7_GPIO3_4 */
#  define GPR_GPR42_GPIO_MUX3_GPIO5_SEL_GPIO3       (0 << 5)   /* Select GPIO3_5 */
#  define GPR_GPR42_GPIO_MUX3_GPIO5_SEL_CM7_GPIO3   (1 << 5)   /* Select CM7_GPIO3_5 */
#  define GPR_GPR42_GPIO_MUX3_GPIO6_SEL_GPIO3       (0 << 6)   /* Select GPIO3_6 */
#  define GPR_GPR42_GPIO_MUX3_GPIO6_SEL_CM7_GPIO3   (1 << 6)   /* Select CM7_GPIO3_6 */
#  define GPR_GPR42_GPIO_MUX3_GPIO7_SEL_GPIO3       (0 << 7)   /* Select GPIO3_7 */
#  define GPR_GPR42_GPIO_MUX3_GPIO7_SEL_CM7_GPIO3   (1 << 7)   /* Select CM7_GPIO3_7 */
#  define GPR_GPR42_GPIO_MUX3_GPIO8_SEL_GPIO3       (0 << 8)   /* Select GPIO3_8 */
#  define GPR_GPR42_GPIO_MUX3_GPIO8_SEL_CM7_GPIO3   (1 << 8)   /* Select CM7_GPIO3_8 */
#  define GPR_GPR42_GPIO_MUX3_GPIO9_SEL_GPIO3       (0 << 9)   /* Select GPIO3_9 */
#  define GPR_GPR42_GPIO_MUX3_GPIO9_SEL_CM7_GPIO3   (1 << 9)   /* Select CM7_GPIO3_9 */
#  define GPR_GPR42_GPIO_MUX3_GPIO10_SEL_GPIO3      (0 << 10)  /* Select GPIO3_10 */
#  define GPR_GPR42_GPIO_MUX3_GPIO10_SEL_CM7_GPIO3  (1 << 10)  /* Select CM7_GPIO3_10 */
#  define GPR_GPR42_GPIO_MUX3_GPIO11_SEL_GPIO3      (0 << 11)  /* Select GPIO3_11 */
#  define GPR_GPR42_GPIO_MUX3_GPIO11_SEL_CM7_GPIO3  (1 << 11)  /* Select CM7_GPIO3_11 */
#  define GPR_GPR42_GPIO_MUX3_GPIO12_SEL_GPIO3      (0 << 12)  /* Select GPIO3_12 */
#  define GPR_GPR42_GPIO_MUX3_GPIO12_SEL_CM7_GPIO3  (1 << 12)  /* Select CM7_GPIO3_12 */
#  define GPR_GPR42_GPIO_MUX3_GPIO13_SEL_GPIO3      (0 << 13)  /* Select GPIO3_13 */
#  define GPR_GPR42_GPIO_MUX3_GPIO13_SEL_CM7_GPIO3  (1 << 13)  /* Select CM7_GPIO3_13 */
#  define GPR_GPR42_GPIO_MUX3_GPIO14_SEL_GPIO3      (0 << 14)  /* Select GPIO3_14 */
#  define GPR_GPR42_GPIO_MUX3_GPIO14_SEL_CM7_GPIO3  (1 << 14)  /* Select CM7_GPIO3_14 */
#  define GPR_GPR42_GPIO_MUX3_GPIO15_SEL_GPIO3      (0 << 15)  /* Select GPIO3_15 */
#  define GPR_GPR42_GPIO_MUX3_GPIO15_SEL_CM7_GPIO3  (1 << 15)  /* Select CM7_GPIO3_15 */
#  define GPR_GPR42_GPIO_MUX3_GPIO_SEL_GPIO3(n)     (0 << (n)) /* Select GPIO3_n */
#  define GPR_GPR42_GPIO_MUX3_GPIO_SEL_CM7_GPIO3(n) (1 << (n)) /* Select CM7_GPIO3_n */

                                                    /* Bits 16-27: Reserved */
#define GPR_GPR42_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR42_DWP_MASK                (0x03 << GPR_GPR42_DWP_SHIFT)
#  define GPR_GPR42_DWP_ALLOWBOTH         (0x00 << GPR_GPR42_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR42_DWP_DENYCM7           (0x01 << GPR_GPR42_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR42_DWP_DENYCM4           (0x02 << GPR_GPR42_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR42_DWP_DENYBOTH          (0x03 << GPR_GPR42_DWP_SHIFT) /* Both cores are forbidden */

