apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define GPR_GPR42_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR42_DWP_LOCK_MASK           (0x03 << GPR_GPR42_DWP_LOCK_SHIFT)
#  define GPR_GPR42_DWP_LOCK_NOLCK        (0x00 << GPR_GPR42_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR42_DWP_LOCK_LCKLO        (0x01 << GPR_GPR42_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR42_DWP_LOCK_LCKHI        (0x02 << GPR_GPR42_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR42_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR42_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 43 (GPR43) */

#define GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_SHIFT     (0) /* Bits 0-15: GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function (GPIO_MUX3_GPIO_SEL_HIGH) */
#define GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_MASK      (0xffff << GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_SHIFT)
#  define GPR_GPR43_GPIO_MUX3_GPIO16_SEL_GPIO3      (0 << 0)       /* Select GPIO3_16 */
#  define GPR_GPR43_GPIO_MUX3_GPIO16_SEL_CM7_GPIO3  (1 << 0)       /* Select CM7_GPIO3_16 */
#  define GPR_GPR43_GPIO_MUX3_GPIO17_SEL_GPIO3      (0 << 1)       /* Select GPIO3_17 */
#  define GPR_GPR43_GPIO_MUX3_GPIO17_SEL_CM7_GPIO3  (1 << 1)       /* Select CM7_GPIO3_17 */
#  define GPR_GPR43_GPIO_MUX3_GPIO18_SEL_GPIO3      (0 << 2)       /* Select GPIO3_18 */
#  define GPR_GPR43_GPIO_MUX3_GPIO18_SEL_CM7_GPIO3  (1 << 2)       /* Select CM7_GPIO3_18 */
#  define GPR_GPR43_GPIO_MUX3_GPIO19_SEL_GPIO3      (0 << 3)       /* Select GPIO3_19 */
#  define GPR_GPR43_GPIO_MUX3_GPIO19_SEL_CM7_GPIO3  (1 << 3)       /* Select CM7_GPIO3_19 */
#  define GPR_GPR43_GPIO_MUX3_GPIO20_SEL_GPIO3      (0 << 4)       /* Select GPIO3_20 */
#  define GPR_GPR43_GPIO_MUX3_GPIO20_SEL_CM7_GPIO3  (1 << 4)       /* Select CM7_GPIO3_20 */
#  define GPR_GPR43_GPIO_MUX3_GPIO21_SEL_GPIO3      (0 << 5)       /* Select GPIO3_21 */
#  define GPR_GPR43_GPIO_MUX3_GPIO21_SEL_CM7_GPIO3  (1 << 5)       /* Select CM7_GPIO3_21 */
#  define GPR_GPR43_GPIO_MUX3_GPIO22_SEL_GPIO3      (0 << 6)       /* Select GPIO3_22 */
#  define GPR_GPR43_GPIO_MUX3_GPIO22_SEL_CM7_GPIO3  (1 << 6)       /* Select CM7_GPIO3_22 */
#  define GPR_GPR43_GPIO_MUX3_GPIO23_SEL_GPIO3      (0 << 7)       /* Select GPIO3_23 */
#  define GPR_GPR43_GPIO_MUX3_GPIO23_SEL_CM7_GPIO3  (1 << 7)       /* Select CM7_GPIO3_23 */
#  define GPR_GPR43_GPIO_MUX3_GPIO24_SEL_GPIO3      (0 << 8)       /* Select GPIO3_24 */
#  define GPR_GPR43_GPIO_MUX3_GPIO24_SEL_CM7_GPIO3  (1 << 8)       /* Select CM7_GPIO3_24 */
#  define GPR_GPR43_GPIO_MUX3_GPIO25_SEL_GPIO3      (0 << 9)       /* Select GPIO3_25 */
#  define GPR_GPR43_GPIO_MUX3_GPIO25_SEL_CM7_GPIO3  (1 << 9)       /* Select CM7_GPIO3_25 */
#  define GPR_GPR43_GPIO_MUX3_GPIO26_SEL_GPIO3      (0 << 10)      /* Select GPIO3_26 */
#  define GPR_GPR43_GPIO_MUX3_GPIO26_SEL_CM7_GPIO3  (1 << 10)      /* Select CM7_GPIO3_26 */
#  define GPR_GPR43_GPIO_MUX3_GPIO27_SEL_GPIO3      (0 << 11)      /* Select GPIO3_27 */
#  define GPR_GPR43_GPIO_MUX3_GPIO27_SEL_CM7_GPIO3  (1 << 11)      /* Select CM7_GPIO3_27 */
#  define GPR_GPR43_GPIO_MUX3_GPIO28_SEL_GPIO3      (0 << 12)      /* Select GPIO3_28 */
#  define GPR_GPR43_GPIO_MUX3_GPIO28_SEL_CM7_GPIO3  (1 << 12)      /* Select CM7_GPIO3_28 */
#  define GPR_GPR43_GPIO_MUX3_GPIO29_SEL_GPIO3      (0 << 13)      /* Select GPIO3_29 */
#  define GPR_GPR43_GPIO_MUX3_GPIO29_SEL_CM7_GPIO3  (1 << 13)      /* Select CM7_GPIO3_29 */
#  define GPR_GPR43_GPIO_MUX3_GPIO30_SEL_GPIO3      (0 << 14)      /* Select GPIO3_40 */
#  define GPR_GPR43_GPIO_MUX3_GPIO30_SEL_CM7_GPIO3  (1 << 14)      /* Select CM7_GPIO3_30 */
#  define GPR_GPR43_GPIO_MUX3_GPIO31_SEL_GPIO3      (0 << 15)      /* Select GPIO3_31 */
#  define GPR_GPR43_GPIO_MUX3_GPIO31_SEL_CM7_GPIO3  (1 << 15)      /* Select CM7_GPIO3_31 */
#  define GPR_GPR43_GPIO_MUX3_GPIO_SEL_GPIO3(n)     (0 << ((n)-16) /* Select GPIO3_n */
#  define GPR_GPR43_GPIO_MUX3_GPIO_SEL_CM7_GPIO3(n) (1 << ((n)-16) /* Select CM7_GPIO3_n */

                                                    /* Bits 16-27: Reserved */
#define GPR_GPR43_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR43_DWP_MASK                (0x03 << GPR_GPR43_DWP_SHIFT)
#  define GPR_GPR43_DWP_ALLOWBOTH         (0x00 << GPR_GPR43_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR43_DWP_DENYCM7           (0x01 << GPR_GPR43_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR43_DWP_DENYCM4           (0x02 << GPR_GPR43_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR43_DWP_DENYBOTH          (0x03 << GPR_GPR43_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR43_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR43_DWP_LOCK_MASK           (0x03 << GPR_GPR43_DWP_LOCK_SHIFT)
#  define GPR_GPR43_DWP_LOCK_NOLCK        (0x00 << GPR_GPR43_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR43_DWP_LOCK_LCKLO        (0x01 << GPR_GPR43_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR43_DWP_LOCK_LCKHI        (0x02 << GPR_GPR43_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR43_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR43_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 44 (GPR44) - Reserved */

/* General Purpose Register 45 (GPR45) - Reserved */

/* General Purpose Register 46 (GPR46) - Reserved */

/* General Purpose Register 47 (GPR47) - Reserved */

/* General Purpose Register 48 (GPR48) - Reserved */

/* General Purpose Register 49 (GPR49) - Reserved */

/* General Purpose Register 50 (GPR50) */

#define GPR_GPR50_CAAM_IPS_MGR_SHIFT      (0)       /* Bits 0-4:   CAAM manager processor identifier (CAAM_IPS_MGR) */
#define GPR_GPR50_CAAM_IPS_MGR_MASK       (0x1f << GPR_GPR50_CAAM_IPS_MGR_SHIFT)
                                                    /* Bits 5-19:  Reserved */
                                                    /* Bits 20-27: Reserved */
#define GPR_GPR50_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR50_DWP_MASK                (0x03 << GPR_GPR50_DWP_SHIFT)
#  define GPR_GPR50_DWP_ALLOWBOTH         (0x00 << GPR_GPR50_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR50_DWP_DENYCM7           (0x01 << GPR_GPR50_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR50_DWP_DENYCM4           (0x02 << GPR_GPR50_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR50_DWP_DENYBOTH          (0x03 << GPR_GPR50_DWP_SHIFT) /* Both cores are forbidden */

