apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define GPR_GPR50_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR50_DWP_LOCK_MASK           (0x03 << GPR_GPR50_DWP_LOCK_SHIFT)
#  define GPR_GPR50_DWP_LOCK_NOLCK        (0x00 << GPR_GPR50_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR50_DWP_LOCK_LCKLO        (0x01 << GPR_GPR50_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR50_DWP_LOCK_LCKHI        (0x02 << GPR_GPR50_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR50_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR50_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 51 (GPR51) */

#define GPR_GPR51_M7_NMI_CLEAR            (1 << 0)  /* Bit 0:      Clear CM7 NMI holding register (M7_NMI_CLEAR) */
                                                    /* Bits 1-19:  Reserved */
                                                    /* Bits 20-27: Reserved */
#define GPR_GPR51_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR51_DWP_MASK                (0x03 << GPR_GPR51_DWP_SHIFT)
#  define GPR_GPR51_DWP_ALLOWBOTH         (0x00 << GPR_GPR51_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR51_DWP_DENYCM7           (0x01 << GPR_GPR51_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR51_DWP_DENYCM4           (0x02 << GPR_GPR51_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR51_DWP_DENYBOTH          (0x03 << GPR_GPR51_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR51_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR51_DWP_LOCK_MASK           (0x03 << GPR_GPR51_DWP_LOCK_SHIFT)
#  define GPR_GPR51_DWP_LOCK_NOLCK        (0x00 << GPR_GPR51_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR51_DWP_LOCK_LCKLO        (0x01 << GPR_GPR51_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR51_DWP_LOCK_LCKHI        (0x02 << GPR_GPR51_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR51_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR51_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 52 (GPR52) - Reserved */

/* General Purpose Register 53 (GPR53) - Reserved */

/* General Purpose Register 54 (GPR54) - Reserved */

/* General Purpose Register 55 (GPR55) - Reserved */

/* General Purpose Register 59 (GPR59) */

#define GPR_GPR59_MIPI_CSI_AUTO_PD_EN     (1 << 0)  /* Bit 0:      Powers down inactive lanes reported by CSI2X_CFG_NUM_LANES (MIPI_CSI_AUTO_PD_EN) */
#define GPR_GPR59_MIPI_CSI_SOFT_RST_N     (1 << 1)  /* Bit 1:      MIPI CSI APB clock domain and user interface clock domain software reset bit (MIPI_CSI_SOFT_RST_N) */
#define GPR_GPR59_MIPI_CSI_CONT_CLK_MODE  (1 << 2)  /* Bit 2:      Enables the slave clock lane feature to maintain HS reception state during continuous clock mode operation (MIPI_CSI_CONT_CLK_MODE) */
#define GPR_GPR59_MIPI_CSI_DDR_CLK_EN     (1 << 3)  /* Bit 3:      When high, enables received DDR clock on CLK_DRXHS (MIPI_CSI_DDR_CLK_EN) */
#define GPR_GPR59_MIPI_CSI_PD_RX          (1 << 4)  /* Bit 4:      Power down input for MIPI CSI PHY (MIPI_CSI_PD_RX) */
#define GPR_GPR59_MIPI_CSI_RX_ENABLE      (1 << 5)  /* Bit 5:      Assert to enable MIPI CSI receive enable (MIPI_CSI_RX_ENABLE) */
#define GPR_GPR59_MIPI_CSI_RX_RCAL_SHIFT  (6)       /* Bits 6-7:   MIPI CSI PHY on-chip termination control bits (MIPI_CSI_RX_RCAL) */
#define GPR_GPR59_MIPI_CSI_RX_RCAL_MASK   (0x03 << GPR_GPR59_MIPI_CSI_RX_RCAL_SHIFT)
#  define GPR_GPR59_MIPI_CSI_RX_RCAL_20PH (0x00 << GPR_GPR59_MIPI_CSI_RX_RCAL_SHIFT) /* 20% higher than mid range */
#  define GPR_GPR59_MIPI_CSI_RX_RCAL_MID  (0x01 << GPR_GPR59_MIPI_CSI_RX_RCAL_SHIFT) /* Mid range impedance setting */
#  define GPR_GPR59_MIPI_CSI_RX_RCAL_15PL (0x02 << GPR_GPR59_MIPI_CSI_RX_RCAL_SHIFT) /* 15% lower than mid range */
#  define GPR_GPR59_MIPI_CSI_RX_RCAL_25PL (0x03 << GPR_GPR59_MIPI_CSI_RX_RCAL_SHIFT) /* 25% lower than mid range */

#define GPR_GPR59_MIPI_CSI_RXCDRP_SHIFT   (8)       /* Bits 8-9:   Programming bits that adjust the threshold voltage of LP-CD (MIPI_CSI_RXCDRP) */
#define GPR_GPR59_MIPI_CSI_RXCDRP_MASK    (0x03 << GPR_GPR59_MIPI_CSI_RXCDRP_SHIFT)
#  define GPR_GPR59_MIPI_CSI_RXCDRP_344MV (0x00 << GPR_GPR59_MIPI_CSI_RXCDRP_SHIFT) /* 344 mV */
#  define GPR_GPR59_MIPI_CSI_RXCDRP_325MV (0x01 << GPR_GPR59_MIPI_CSI_RXCDRP_SHIFT) /* 325 mV */
#  define GPR_GPR59_MIPI_CSI_RXCDRP_307MV (0x02 << GPR_GPR59_MIPI_CSI_RXCDRP_SHIFT) /* 307 mV */
#  define GPR_GPR59_MIPI_CSI_RXCDRP_INV   (0x03 << GPR_GPR59_MIPI_CSI_RXCDRP_SHIFT) /* Invalid */

#define GPR_GPR59_MIPI_CSI_RXLPRP_SHIFT   (10)      /* Bits 10-11:   Programming bits that adjust the threshold voltage of LP-RX (MIPI_CSI_RXLPRP) */
#define GPR_GPR59_MIPI_CSI_RXLPRP_MASK    (0x03 << GPR_GPR59_MIPI_CSI_RXLPRP_SHIFT)
#  define GPR_GPR59_MIPI_CSI_RXLPRP_B00   (0x00 << GPR_GPR59_MIPI_CSI_RXLPRP_SHIFT) /* High threshold: 782 mV, low threshold: 730 mV */
#  define GPR_GPR59_MIPI_CSI_RXLPRP_B01   (0x01 << GPR_GPR59_MIPI_CSI_RXLPRP_SHIFT) /* High threshold: 745 mV, low threshold: 692 mV */
#  define GPR_GPR59_MIPI_CSI_RXLPRP_B10   (0x02 << GPR_GPR59_MIPI_CSI_RXLPRP_SHIFT) /* High threshold: 708 mV, low threshold: 655 mV */
#  define GPR_GPR59_MIPI_CSI_RXLPRP_B11   (0x03 << GPR_GPR59_MIPI_CSI_RXLPRP_SHIFT) /* High threshold: invalid, low threshold: invalid */

#define GPR_GPR59_MIPI_CSI_S_PRG_RXHS_SETTLE_SHIFT (12) /* Bits 12-17: Bits used to program T_HS_SETTLE (MIPI_CSI_S_PRG_RXHS_SETTLE) */
#define GPR_GPR59_MIPI_CSI_S_PRG_RXHS_SETTLE_MASK  (0x3f << GPR_GPR59_MIPI_CSI_S_PRG_RXHS_SETTLE_SHIFT)

                                                    /* Bits 18-27: Reserved */
#define GPR_GPR59_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR59_DWP_MASK                (0x03 << GPR_GPR59_DWP_SHIFT)
#  define GPR_GPR59_DWP_ALLOWBOTH         (0x00 << GPR_GPR59_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR59_DWP_DENYCM7           (0x01 << GPR_GPR59_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR59_DWP_DENYCM4           (0x02 << GPR_GPR59_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR59_DWP_DENYBOTH          (0x03 << GPR_GPR59_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR59_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR59_DWP_LOCK_MASK           (0x03 << GPR_GPR59_DWP_LOCK_SHIFT)
#  define GPR_GPR59_DWP_LOCK_NOLCK        (0x00 << GPR_GPR59_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR59_DWP_LOCK_LCKLO        (0x01 << GPR_GPR59_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR59_DWP_LOCK_LCKHI        (0x02 << GPR_GPR59_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR59_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR59_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 62 (GPR62) */

#define GPR_GPR60_MIPI_DSI_CLK_TM_SHIFT   (0)       /* Bits 0-2:   MIPI DSI clock lane trimming bits (MIPI_DSI_CLK_TM) */
#define GPR_GPR60_MIPI_DSI_CLK_TM_MASK    (0x07 << GPR_GPR60_MIPI_DSI_CLK_TM_SHIFT)

#define GPR_GPR60_MIPI_DSI_D0_TM_SHIFT    (3)       /* Bits 3-5:   MIPI DSI data lane 0 trimming bits (MIPI_DSI_D0_TM) */
#define GPR_GPR60_MIPI_DSI_D0_TM_MASK     (0x07 << GPR_GPR60_MIPI_DSI_D0_TM_SHIFT)

#define GPR_GPR60_MIPI_DSI_D1_TM_SHIFT    (6)       /* Bits 6-8:   MIPI DSI data lane 1 trimming bits (MIPI_DSI_D1_TM) */
#define GPR_GPR60_MIPI_DSI_D1_TM_MASK     (0x07 << GPR_GPR60_MIPI_DSI_D1_TM_SHIFT)

#define GPR_GPR60_MIPI_DSI_TX_RCAL_SHIFT  (9)       /* Bits 9-10:  MIPI DSI PHY on-chip termination control bits (MIPI_DSI_TX_RCAL) */
#define GPR_GPR60_MIPI_DSI_TX_RCAL_MASK   (0x03 << GPR_GPR60_MIPI_DSI_TX_RCAL_SHIFT)
#  define GPR_GPR60_MIPI_DSI_TX_RCAL_20PH (0x00 << GPR_GPR60_MIPI_DSI_TX_RCAL_SHIFT) /* 20% higher than mid range */
#  define GPR_GPR60_MIPI_DSI_TX_RCAL_MID  (0x01 << GPR_GPR60_MIPI_DSI_TX_RCAL_SHIFT) /* Mid range impedance setting */
#  define GPR_GPR60_MIPI_DSI_TX_RCAL_15PL (0x02 << GPR_GPR60_MIPI_DSI_TX_RCAL_SHIFT) /* 15% lower than mid range */
#  define GPR_GPR60_MIPI_DSI_TX_RCAL_25PL (0x03 << GPR_GPR60_MIPI_DSI_TX_RCAL_SHIFT) /* 25% lower than mid range */

