apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define GPR_GPR60_MIPI_DSI_TX_ULPS_ENABLE_SHIFT (11) /* Bits 11-13: DSI transmit ULPS mode enable (MIPI_DSI_TX_ULPS_ENABLE) */
#define GPR_GPR60_MIPI_DSI_TX_ULPS_ENABLE_MASK  (0x07 << GPR_GPR60_MIPI_DSI_TX_ULPS_ENABLE_SHIFT)
#  define GPR_GPR60_MIPI_DSI_TX_ULPS_ENABLE_CLK (0x01 << GPR_GPR60_MIPI_DSI_TX_ULPS_ENABLE_SHIFT) /* Clock lane */
#  define GPR_GPR60_MIPI_DSI_TX_ULPS_ENABLE_D0  (0x02 << GPR_GPR60_MIPI_DSI_TX_ULPS_ENABLE_SHIFT) /* Data lane 0 */
#  define GPR_GPR60_MIPI_DSI_TX_ULPS_ENABLE_D1  (0x04 << GPR_GPR60_MIPI_DSI_TX_ULPS_ENABLE_SHIFT) /* Data lane 1 */

                                                    /* Bits 14-15: Reserved */

#define GPR_GPR60_MIPI_DSI_PCLK_SOFT_RESET_N (1 << 16) /* Bit 16:  MIPI DSI APB clock domain software reset bit (MIPI_DSI_PCLK_SOFT_RESET_N) */
#define GPR_GPR60_MIPI_DSI_BYTE_SOFT_RESET_N (1 << 17) /* Bit 17:  MIPI DSI byte clock domain software reset bit (MIPI_DSI_BYTE_SOFT_RESET_N) */
#define GPR_GPR60_MIPI_DSI_DPI_SOFT_RESET_N  (1 << 18) /* Bit 18:  MIPI DSI pixel clock domain software reset bit (MIPI_DSI_DPI_SOFT_RESET_N) */
#define GPR_GPR60_MIPI_DSI_ESC_SOFT_RESET_N  (1 << 19) /* Bit 19:  MIPI DSI escape clock domain software reset bit (MIPI_DSI_ESC_SOFT_RESET_N) */

                                                    /* Bits 20-27: Reserved */
#define GPR_GPR62_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR62_DWP_MASK                (0x03 << GPR_GPR62_DWP_SHIFT)
#  define GPR_GPR62_DWP_ALLOWBOTH         (0x00 << GPR_GPR62_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR62_DWP_DENYCM7           (0x01 << GPR_GPR62_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR62_DWP_DENYCM4           (0x02 << GPR_GPR62_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR62_DWP_DENYBOTH          (0x03 << GPR_GPR62_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR62_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR62_DWP_LOCK_MASK           (0x03 << GPR_GPR62_DWP_LOCK_SHIFT)
#  define GPR_GPR62_DWP_LOCK_NOLCK        (0x00 << GPR_GPR62_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR62_DWP_LOCK_LCKLO        (0x01 << GPR_GPR62_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR62_DWP_LOCK_LCKHI        (0x02 << GPR_GPR62_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR62_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR62_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 63 (GPR63) */

#define GPR_GPR63_MIPI_DSI_TX_ULPS_ACTIVE_SHIFT (0) /* Bits 0-2:   DSI transmit ULPS mode enable (MIPI_DSI_TX_ULPS_ENABLE) */
#define GPR_GPR63_MIPI_DSI_TX_ULPS_ACTIVE_MASK  (0x07 << GPR_GPR63_MIPI_DSI_TX_ULPS_ACTIVE_SHIFT)
#  define GPR_GPR63_MIPI_DSI_TX_ULPS_ACTIVE_CLK (0x01 << GPR_GPR63_MIPI_DSI_TX_ULPS_ACTIVE_SHIFT) /* Clock lane */
#  define GPR_GPR63_MIPI_DSI_TX_ULPS_ACTIVE_D0  (0x02 << GPR_GPR63_MIPI_DSI_TX_ULPS_ACTIVE_SHIFT) /* Data lane 0 */
#  define GPR_GPR63_MIPI_DSI_TX_ULPS_ACTIVE_D1  (0x04 << GPR_GPR63_MIPI_DSI_TX_ULPS_ACTIVE_SHIFT) /* Data lane 1 */

                                                    /* Bits 3-31:  Reserved */

/* General Purpose Register 64 (GPR64) */

#define GPR_GPR64_GPIO_DISP1_FREEZE       (1 << 0)  /* Bit 0:      Compensation code freeze (GPIO_DISP1_FREEZE) */
#define GPR_GPR64_GPIO_DISP1_COMPTQ       (1 << 1)  /* Bit 1:      COMPEN and COMPTQ control the operating modes of the compensation cell (GPIO_DISP1_COMPTQ) */
#define GPR_GPR64_GPIO_DISP1_COMPEN       (1 << 2)  /* Bit 2:      COMPEN and COMPTQ control the operating modes of the compensation cell (GPIO_DISP1_COMPEN) */
#define GPR_GPR64_GPIO_DISP1_FASTFRZ_EN   (1 << 3)  /* Bit 3:      Compensation code fast freeze (GPIO_DISP1_FASTFRZ_EN) */
#define GPR_GPR64_GPIO_DISP1_RASRCP_SHIFT (4)       /* Bits 4-7:   GPIO_DISP_B1 IO bank's 4-bit PMOS compensation codes from core (GPIO_DISP1_RASRCP) */
#define GPR_GPR64_GPIO_DISP1_RASRCP_MASK  (0x0f << GPR_GPR64_GPIO_DISP1_RASRCP_SHIFT)
#define GPR_GPR64_GPIO_DISP1_RASRCN_SHIFT (8)       /* Bits 8-11:  GPIO_DISP_B1 IO bank's 4-bit NMOS compensation codes from core (GPIO_DISP1_RASRCN) */
#define GPR_GPR64_GPIO_DISP1_RASRCN_MASK  (0x0f << GPR_GPR64_GPIO_DISP1_RASRCN_SHIFT)
#define GPR_GPR64_GPIO_DISP1_SELECT_NASRC (1 << 12) /* Bit 12:     GPIO_DISP1_NASRC selection (GPIO_DISP1_SELECT_NASRC) */
#define GPR_GPR64_GPIO_DISP1_REFGEN_SLEEP (1 << 13) /* Bit 13:     GPIO_DISP_B1 IO bank reference voltage generator cell sleep enable (GPIO_DISP1_REFGEN_SLEEP) */

#define GPR_GPR64_GPIO_DISP1_SUPLYDET_LATCH (1 << 14) /* Bit 14:   GPIO_DISP_B1 IO bank power supply mode latch enable (GPIO_DISP1_SUPLYDET_LATCH) */

                                                    /* Bits 15-19: Reserved */

#define GPR_GPR64_GPIO_DISP1_COMPOK       (1 << 20) /* Bit 20:     GPIO_DISP_B1 IO bank compensation OK flag (GPIO_DISP1_COMPOK) */
#define GPR_GPR64_GPIO_DISP1_NASRC_SHIFT  (21)      /* Bits 21-24: GPIO_DISP_B1 IO bank compensation codes (GPIO_DISP1_NASRC) */
#define GPR_GPR64_GPIO_DISP1_NASRC_MASK   (0x0f << GPR_GPR64_GPIO_DISP1_NASRC_SHIFT)

                                                    /* Bits 25-27: Reserved */
#define GPR_GPR64_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR64_DWP_MASK                (0x03 << GPR_GPR64_DWP_SHIFT)
#  define GPR_GPR64_DWP_ALLOWBOTH         (0x00 << GPR_GPR64_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR64_DWP_DENYCM7           (0x01 << GPR_GPR64_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR64_DWP_DENYCM4           (0x02 << GPR_GPR64_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR64_DWP_DENYBOTH          (0x03 << GPR_GPR64_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR64_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR64_DWP_LOCK_MASK           (0x03 << GPR_GPR64_DWP_LOCK_SHIFT)
#  define GPR_GPR64_DWP_LOCK_NOLCK        (0x00 << GPR_GPR64_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR64_DWP_LOCK_LCKLO        (0x01 << GPR_GPR64_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR64_DWP_LOCK_LCKHI        (0x02 << GPR_GPR64_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR64_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR64_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

