apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
/* General Purpose Register 65 (GPR65) */

#define GPR_GPR65_GPIO_EMC1_FREEZE        (1 << 0)  /* Bit 0:      Compensation code freeze (GPIO_EMC1_FREEZE) */
#define GPR_GPR65_GPIO_EMC1_COMPTQ        (1 << 1)  /* Bit 1:      COMPEN and COMPTQ control the operating modes of the compensation cell (GPIO_EMC1_COMPTQ) */
#define GPR_GPR65_GPIO_EMC1_COMPEN        (1 << 2)  /* Bit 2:      COMPEN and COMPTQ control the operating modes of the compensation cell (GPIO_EMC1_COMPEN) */
#define GPR_GPR65_GPIO_EMC1_FASTFRZ_EN    (1 << 3)  /* Bit 3:      Compensation code fast freeze (GPIO_EMC1_FASTFRZ_EN) */
#define GPR_GPR65_GPIO_EMC1_RASRCP_SHIFT  (4)       /* Bits 4-7:   GPIO_EMC_B1 IO bank's 4-bit PMOS compensation codes from core (GPIO_EMC1_RASRCP) */
#define GPR_GPR65_GPIO_EMC1_RASRCP_MASK   (0x0f << GPR_GPR65_GPIO_EMC1_RASRCP_SHIFT)
#define GPR_GPR65_GPIO_EMC1_RASRCN_SHIFT  (8)       /* Bits 8-11:  GPIO_EMC_B1 IO bank's 4-bit NMOS compensation codes from core (GPIO_EMC1_RASRCN) */
#define GPR_GPR65_GPIO_EMC1_RASRCN_MASK   (0x0f << GPR_GPR65_GPIO_EMC1_RASRCN_SHIFT)
#define GPR_GPR65_GPIO_EMC1_SELECT_NASRC  (1 << 12) /* Bit 12:     GPIO_EMC1_NASRC selection (GPIO_EMC1_SELECT_NASRC) */
#define GPR_GPR65_GPIO_EMC1_REFGEN_SLEEP  (1 << 13) /* Bit 13:     GPIO_EMC_B1 IO bank reference voltage generator cell sleep enable (GPIO_EMC1_REFGEN_SLEEP) */

#define GPR_GPR65_GPIO_EMC1_SUPLYDET_LATCH (1 << 14) /* Bit 14:    GPIO_EMC_B1 IO bank power supply mode latch enable (GPIO_EMC1_SUPLYDET_LATCH) */

                                                    /* Bits 15-19: Reserved */

#define GPR_GPR65_GPIO_EMC1_COMPOK        (1 << 20) /* Bit 20:     GPIO_EMC_B1 IO bank compensation OK flag (GPIO_EMC1_COMPOK) */
#define GPR_GPR65_GPIO_EMC1_NASRC_SHIFT   (21)      /* Bits 21-24: GPIO_EMC_B1 IO bank compensation codes (GPIO_EMC1_NASRC) */
#define GPR_GPR65_GPIO_EMC1_NASRC_MASK    (0x0f << GPR_GPR65_GPIO_EMC1_NASRC_SHIFT)

                                                    /* Bits 25-27: Reserved */
#define GPR_GPR65_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR65_DWP_MASK                (0x03 << GPR_GPR65_DWP_SHIFT)
#  define GPR_GPR65_DWP_ALLOWBOTH         (0x00 << GPR_GPR65_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR65_DWP_DENYCM7           (0x01 << GPR_GPR65_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR65_DWP_DENYCM4           (0x02 << GPR_GPR65_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR65_DWP_DENYBOTH          (0x03 << GPR_GPR65_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR65_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR65_DWP_LOCK_MASK           (0x03 << GPR_GPR65_DWP_LOCK_SHIFT)
#  define GPR_GPR65_DWP_LOCK_NOLCK        (0x00 << GPR_GPR65_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR65_DWP_LOCK_LCKLO        (0x01 << GPR_GPR65_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR65_DWP_LOCK_LCKHI        (0x02 << GPR_GPR65_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR65_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR65_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 66 (GPR66) */

#define GPR_GPR66_GPIO_EMC2_FREEZE        (1 << 0)  /* Bit 0:      Compensation code freeze (GPIO_EMC2_FREEZE) */
#define GPR_GPR66_GPIO_EMC2_COMPTQ        (1 << 1)  /* Bit 1:      COMPEN and COMPTQ control the operating modes of the compensation cell (GPIO_EMC2_COMPTQ) */
#define GPR_GPR66_GPIO_EMC2_COMPEN        (1 << 2)  /* Bit 2:      COMPEN and COMPTQ control the operating modes of the compensation cell (GPIO_EMC2_COMPEN) */
#define GPR_GPR66_GPIO_EMC2_FASTFRZ_EN    (1 << 3)  /* Bit 3:      Compensation code fast freeze (GPIO_EMC2_FASTFRZ_EN) */
#define GPR_GPR66_GPIO_EMC2_RASRCP_SHIFT  (4)       /* Bits 4-7:   GPIO_EMC_B2 IO bank's 4-bit PMOS compensation codes from core (GPIO_EMC2_RASRCP) */
#define GPR_GPR66_GPIO_EMC2_RASRCP_MASK   (0x0f << GPR_GPR66_GPIO_EMC2_RASRCP_SHIFT)
#define GPR_GPR66_GPIO_EMC2_RASRCN_SHIFT  (8)       /* Bits 8-11:  GPIO_EMC_B2 IO bank's 4-bit NMOS compensation codes from core (GPIO_EMC2_RASRCN) */
#define GPR_GPR66_GPIO_EMC2_RASRCN_MASK   (0x0f << GPR_GPR66_GPIO_EMC2_RASRCN_SHIFT)
#define GPR_GPR66_GPIO_EMC2_SELECT_NASRC  (1 << 12) /* Bit 12:     GPIO_EMC2_NASRC selection (GPIO_EMC2_SELECT_NASRC) */
#define GPR_GPR66_GPIO_EMC2_REFGEN_SLEEP  (1 << 13) /* Bit 13:     GPIO_EMC_B2 IO bank reference voltage generator cell sleep enable (GPIO_EMC2_REFGEN_SLEEP) */

#define GPR_GPR66_GPIO_EMC2_SUPLYDET_LATCH (1 << 14) /* Bit 14:    GPIO_EMC_B2 IO bank power supply mode latch enable (GPIO_EMC2_SUPLYDET_LATCH) */

                                                    /* Bits 15-19: Reserved */

#define GPR_GPR66_GPIO_EMC2_COMPOK        (1 << 20) /* Bit 20:     GPIO_EMC_B2 IO bank compensation OK flag (GPIO_EMC2_COMPOK) */
#define GPR_GPR66_GPIO_EMC2_NASRC_SHIFT   (21)      /* Bits 21-24: GPIO_EMC_B2 IO bank compensation codes (GPIO_EMC2_NASRC) */
#define GPR_GPR66_GPIO_EMC2_NASRC_MASK    (0x0f << GPR_GPR66_GPIO_EMC2_NASRC_SHIFT)

                                                    /* Bits 25-27: Reserved */
#define GPR_GPR66_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR66_DWP_MASK                (0x03 << GPR_GPR66_DWP_SHIFT)
#  define GPR_GPR66_DWP_ALLOWBOTH         (0x00 << GPR_GPR66_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR66_DWP_DENYCM7           (0x01 << GPR_GPR66_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR66_DWP_DENYCM4           (0x02 << GPR_GPR66_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR66_DWP_DENYBOTH          (0x03 << GPR_GPR66_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR66_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR66_DWP_LOCK_MASK           (0x03 << GPR_GPR66_DWP_LOCK_SHIFT)
#  define GPR_GPR66_DWP_LOCK_NOLCK        (0x00 << GPR_GPR66_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR66_DWP_LOCK_LCKLO        (0x01 << GPR_GPR66_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR66_DWP_LOCK_LCKHI        (0x02 << GPR_GPR66_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR66_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR66_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 67 (GPR67) */

#define GPR_GPR67_GPIO_SD1_FREEZE         (1 << 0)  /* Bit 0:      Compensation code freeze (GPIO_SD1_FREEZE) */
#define GPR_GPR67_GPIO_SD1_COMPTQ         (1 << 1)  /* Bit 1:      COMPEN and COMPTQ control the operating modes of the compensation cell (GPIO_SD1_COMPTQ) */
#define GPR_GPR67_GPIO_SD1_COMPEN         (1 << 2)  /* Bit 2:      COMPEN and COMPTQ control the operating modes of the compensation cell (GPIO_SD1_COMPEN) */
#define GPR_GPR67_GPIO_SD1_FASTFRZ_EN     (1 << 3)  /* Bit 3:      Compensation code fast freeze (GPIO_SD1_FASTFRZ_EN) */
#define GPR_GPR67_GPIO_SD1_RASRCP_SHIFT   (4)       /* Bits 4-7:   GPIO_SD_B1 IO bank's 4-bit PMOS compensation codes from core (GPIO_SD1_RASRCP) */
#define GPR_GPR67_GPIO_SD1_RASRCP_MASK    (0x0f << GPR_GPR67_GPIO_SD1_RASRCP_SHIFT)
#define GPR_GPR67_GPIO_SD1_RASRCN_SHIFT   (8)       /* Bits 8-11:  GPIO_SD_B1 IO bank's 4-bit NMOS compensation codes from core (GPIO_SD1_RASRCN) */
#define GPR_GPR67_GPIO_SD1_RASRCN_MASK    (0x0f << GPR_GPR67_GPIO_SD1_RASRCN_SHIFT)
#define GPR_GPR67_GPIO_SD1_SELECT_NASRC   (1 << 12) /* Bit 12:     GPIO_SD1_NASRC selection (GPIO_SD1_SELECT_NASRC) */
#define GPR_GPR67_GPIO_SD1_REFGEN_SLEEP   (1 << 13) /* Bit 13:     GPIO_SD_B1 IO bank reference voltage generator cell sleep enable (GPIO_SD1_REFGEN_SLEEP) */

