apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define GPR_GPR67_GPIO_SD1_SUPLYDET_LATCH (1 << 14) /* Bit 14:    GPIO_SD_B1 IO bank power supply mode latch enable (GPIO_SD1_SUPLYDET_LATCH) */

                                                    /* Bits 15-19: Reserved */

#define GPR_GPR67_GPIO_SD1_COMPOK         (1 << 20) /* Bit 20:     GPIO_SD_B1 IO bank compensation OK flag (GPIO_SD1_COMPOK) */
#define GPR_GPR67_GPIO_SD1_NASRC_SHIFT    (21)      /* Bits 21-24: GPIO_SD_B1 IO bank compensation codes (GPIO_SD1_NASRC) */
#define GPR_GPR67_GPIO_SD1_NASRC_MASK     (0x0f << GPR_GPR67_GPIO_SD1_NASRC_SHIFT)

                                                    /* Bits 25-27: Reserved */
#define GPR_GPR67_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR67_DWP_MASK                (0x03 << GPR_GPR67_DWP_SHIFT)
#  define GPR_GPR67_DWP_ALLOWBOTH         (0x00 << GPR_GPR67_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR67_DWP_DENYCM7           (0x01 << GPR_GPR67_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR67_DWP_DENYCM4           (0x02 << GPR_GPR67_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR67_DWP_DENYBOTH          (0x03 << GPR_GPR67_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR67_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR67_DWP_LOCK_MASK           (0x03 << GPR_GPR67_DWP_LOCK_SHIFT)
#  define GPR_GPR67_DWP_LOCK_NOLCK        (0x00 << GPR_GPR67_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR67_DWP_LOCK_LCKLO        (0x01 << GPR_GPR67_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR67_DWP_LOCK_LCKHI        (0x02 << GPR_GPR67_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR67_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR67_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 68 (GPR68) */

#define GPR_GPR68_GPIO_SD2_FREEZE         (1 << 0)  /* Bit 0:      Compensation code freeze (GPIO_SD2_FREEZE) */
#define GPR_GPR68_GPIO_SD2_COMPTQ         (1 << 1)  /* Bit 1:      COMPEN and COMPTQ control the operating modes of the compensation cell (GPIO_SD2_COMPTQ) */
#define GPR_GPR68_GPIO_SD2_COMPEN         (1 << 2)  /* Bit 2:      COMPEN and COMPTQ control the operating modes of the compensation cell (GPIO_SD2_COMPEN) */
#define GPR_GPR68_GPIO_SD2_FASTFRZ_EN     (1 << 3)  /* Bit 3:      Compensation code fast freeze (GPIO_SD2_FASTFRZ_EN) */
#define GPR_GPR68_GPIO_SD2_RASRCP_SHIFT   (4)       /* Bits 4-7:   GPIO_SD_B2 IO bank's 4-bit PMOS compensation codes from core (GPIO_SD2_RASRCP) */
#define GPR_GPR68_GPIO_SD2_RASRCP_MASK    (0x0f << GPR_GPR68_GPIO_SD2_RASRCP_SHIFT)
#define GPR_GPR68_GPIO_SD2_RASRCN_SHIFT   (8)       /* Bits 8-11:  GPIO_SD_B2 IO bank's 4-bit NMOS compensation codes from core (GPIO_SD2_RASRCN) */
#define GPR_GPR68_GPIO_SD2_RASRCN_MASK    (0x0f << GPR_GPR68_GPIO_SD2_RASRCN_SHIFT)
#define GPR_GPR68_GPIO_SD2_SELECT_NASRC   (1 << 12) /* Bit 12:     GPIO_SD2_NASRC selection (GPIO_SD2_SELECT_NASRC) */
#define GPR_GPR68_GPIO_SD2_REFGEN_SLEEP   (1 << 13) /* Bit 13:     GPIO_SD_B2 IO bank reference voltage generator cell sleep enable (GPIO_SD2_REFGEN_SLEEP) */

#define GPR_GPR68_GPIO_SD2_SUPLYDET_LATCH (1 << 14) /* Bit 14:    GPIO_SD_B2 IO bank power supply mode latch enable (GPIO_SD2_SUPLYDET_LATCH) */

                                                    /* Bits 15-19: Reserved */

#define GPR_GPR68_GPIO_SD2_COMPOK         (1 << 20) /* Bit 20:     GPIO_SD_B2 IO bank compensation OK flag (GPIO_SD2_COMPOK) */
#define GPR_GPR68_GPIO_SD2_NASRC_SHIFT    (21)      /* Bits 21-24: GPIO_SD_B2 IO bank compensation codes (GPIO_SD2_NASRC) */
#define GPR_GPR68_GPIO_SD2_NASRC_MASK     (0x0f << GPR_GPR68_GPIO_SD2_NASRC_SHIFT)

                                                    /* Bits 25-27: Reserved */
#define GPR_GPR68_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR68_DWP_MASK                (0x03 << GPR_GPR68_DWP_SHIFT)
#  define GPR_GPR68_DWP_ALLOWBOTH         (0x00 << GPR_GPR68_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR68_DWP_DENYCM7           (0x01 << GPR_GPR68_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR68_DWP_DENYCM4           (0x02 << GPR_GPR68_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR68_DWP_DENYBOTH          (0x03 << GPR_GPR68_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR68_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR68_DWP_LOCK_MASK           (0x03 << GPR_GPR68_DWP_LOCK_SHIFT)
#  define GPR_GPR68_DWP_LOCK_NOLCK        (0x00 << GPR_GPR68_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR68_DWP_LOCK_LCKLO        (0x01 << GPR_GPR68_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR68_DWP_LOCK_LCKHI        (0x02 << GPR_GPR68_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR68_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR68_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 69 (GPR69) */

                                                    /* Bit 0:      Reserved */
#define GPR_GPR69_GPIO_DISP2_HIGH_RANGE   (1 << 1)  /* Bit 1:      GPIO_DISP_B2 IO bank supply voltage range selection (GPIO_DISP2_HIGH_RANGE) */
#define GPR_GPR69_GPIO_DISP2_LOW_RANGE    (1 << 2)  /* Bit 2:      GPIO_DISP_B2 IO bank supply voltage range selection (GPIO_DISP2_LOW_RANGE) */
                                                    /* Bit 3:      Reserved */
#define GPR_GPR69_GPIO_AD0_HIGH_RANGE     (1 << 4)  /* Bit 4:      GPIO_AD IO bank supply voltage range selection for GPIO_AD_00 to GPIO_AD_17 (GPIO_AD0_HIGH_RANGE) */
#define GPR_GPR69_GPIO_AD0_LOW_RANGE      (1 << 5)  /* Bit 5:      GPIO_AD IO bank supply voltage range selection for GPIO_AD_00 to GPIO_AD_17 (GPIO_AD0_LOW_RANGE) */
                                                    /* Bit 6:      Reserved */
#define GPR_GPR69_GPIO_AD1_HIGH_RANGE     (1 << 7)  /* Bit 7:      GPIO_LPSR IO bank supply voltage range selection for GPIO_AD_18 to GPIO_AD_35 (GPIO_AD1_HIGH_RANGE) */
#define GPR_GPR69_GPIO_AD1_LOW_RANGE      (1 << 8)  /* Bit 8:      GPIO_LPSR IO bank supply voltage range selection for GPIO_AD_18 to GPIO_AD_35 (GPIO_AD1_LOW_RANGE) */
#define GPR_GPR69_SUPLYDET_DISP1_SLEEP    (1 << 9)  /* Bit 9:      GPIO_DISP_B1 IO bank supply voltage detector sleep mode enable (SUPLYDET_DISP1_SLEEP) */
#define GPR_GPR69_SUPLYDET_EMC1_SLEEP     (1 << 10) /* Bit 10:     GPIO_EMC_B1 IO bank supply voltage detector sleep mode enable (SUPLYDET_EMC1_SLEEP) */
#define GPR_GPR69_SUPLYDET_EMC2_SLEEP     (1 << 11) /* Bit 11:     GPIO_EMC_B2 IO bank supply voltage detector sleep mode enable (SUPLYDET_EMC2_SLEEP) */
#define GPR_GPR69_SUPLYDET_SD1_SLEEP      (1 << 12) /* Bit 12:     GPIO_SD_B1 IO bank supply voltage detector sleep mode enable (SUPLYDET_SD1_SLEEP) */
#define GPR_GPR69_SUPLYDET_SD2_SLEEP      (1 << 13) /* Bit 13:     GPIO_SD_B2 IO bank supply voltage detector sleep mode enable (SUPLYDET_SD2_SLEEP) */
                                                    /* Bits 14-15: Reserved */
                                                    /* Bits 16-27: Reserved */
#define GPR_GPR69_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR69_DWP_MASK                (0x03 << GPR_GPR69_DWP_SHIFT)
#  define GPR_GPR69_DWP_ALLOWBOTH         (0x00 << GPR_GPR69_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR69_DWP_DENYCM7           (0x01 << GPR_GPR69_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR69_DWP_DENYCM4           (0x02 << GPR_GPR69_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR69_DWP_DENYBOTH          (0x03 << GPR_GPR69_DWP_SHIFT) /* Both cores are forbidden */

