apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define GPR_GPR69_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR69_DWP_LOCK_MASK           (0x03 << GPR_GPR69_DWP_LOCK_SHIFT)
#  define GPR_GPR69_DWP_LOCK_NOLCK        (0x00 << GPR_GPR69_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR69_DWP_LOCK_LCKLO        (0x01 << GPR_GPR69_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR69_DWP_LOCK_LCKHI        (0x02 << GPR_GPR69_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR69_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR69_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 70 (GPR70) */

#define GPR_GPR70_ADC1_IPG_DOZE           (1 << 0)  /* Bit 0:      ADC1 doze mode (ADC1_IPG_DOZE) */
#define GPR_GPR70_ADC1_STOP_REQ           (1 << 1)  /* Bit 1:      ADC1 stop request (ADC1_STOP_REQ) */
#define GPR_GPR70_ADC1_IPG_STOP_MODE      (1 << 2)  /* Bit 2:      ADC1 stop mode selection (ADC1_IPG_STOP_MODE) */
#define GPR_GPR70_ADC2_IPG_DOZE           (1 << 3)  /* Bit 3:      ADC2 doze mode (ADC2_IPG_DOZE) */
#define GPR_GPR70_ADC2_STOP_REQ           (1 << 4)  /* Bit 4:      ADC2 stop request (ADC2_STOP_REQ) */
#define GPR_GPR70_ADC2_IPG_STOP_MODE      (1 << 5)  /* Bit 5:      ADC2 stop mode selection (ADC2_IPG_STOP_MODE) */
#define GPR_GPR70_CAAM_IPG_DOZE           (1 << 6)  /* Bit 6:      CAAM doze mode (CAAM_IPG_DOZE) */
#define GPR_GPR70_CAAM_STOP_REQ           (1 << 7)  /* Bit 7:      CAAM stop request (CAAM_STOP_REQ) */
#define GPR_GPR70_CAN1_IPG_DOZE           (1 << 8)  /* Bit 8:      CAN1 doze mode (CAN1_IPG_DOZE) */
#define GPR_GPR70_CAN1_STOP_REQ           (1 << 9)  /* Bit 9:      CAN1 stop request (CAN1_STOP_REQ) */
#define GPR_GPR70_CAN2_IPG_DOZE           (1 << 10) /* Bit 10:     CAN2 doze mode (CAN2_IPG_DOZE) */
#define GPR_GPR70_CAN2_STOP_REQ           (1 << 11) /* Bit 11:     CAN2 stop request (CAN2_STOP_REQ) */
#define GPR_GPR70_CAN3_IPG_DOZE           (1 << 12) /* Bit 12:     CAN3 doze mode (CAN3_IPG_DOZE) */
#define GPR_GPR70_CAN3_STOP_REQ           (1 << 13) /* Bit 13:     CAN3 stop request (CAN3_STOP_REQ) */
                                                    /* Bit 14:     Reserved */
#define GPR_GPR70_EDMA_STOP_REQ           (1 << 15) /* Bit 15:     EDMA stop request (EDMA_STOP_REQ) */
#define GPR_GPR70_EDMA_LPSR_STOP_REQ      (1 << 16) /* Bit 16:     EDMA_LPSR stop request (EDMA_LPSR_STOP_REQ) */
#define GPR_GPR70_ENET_IPG_DOZE           (1 << 17) /* Bit 17:     ENET doze mode (ENET_IPG_DOZE) */
#define GPR_GPR70_ENET_STOP_REQ           (1 << 18) /* Bit 18:     ENET stop request (ENET_STOP_REQ) */
#define GPR_GPR70_ENET1G_IPG_DOZE         (1 << 19) /* Bit 19:     ENET1G doze mode (ENET1G_IPG_DOZE) */
#define GPR_GPR70_ENET1G_STOP_REQ         (1 << 20) /* Bit 20:     ENET1G stop request (ENET1G_STOP_REQ) */
#define GPR_GPR70_FLEXIO1_IPG_DOZE        (1 << 21) /* Bit 21:     FLEXIO1 doze mode (FLEXIO1_IPG_DOZE) */
#define GPR_GPR70_FLEXIO2_IPG_DOZE        (1 << 22) /* Bit 22:     FLEXIO2 doze mode (FLEXIO2_IPG_DOZE) */
#define GPR_GPR70_FLEXSPI1_IPG_DOZE       (1 << 23) /* Bit 23:     FLEXSPI1 doze mode (FLEXSPI1_IPG_DOZE) */
#define GPR_GPR70_FLEXSPI1_STOP_REQ       (1 << 24) /* Bit 24:     FLEXSPI1 stop request (FLEXSPI1_STOP_REQ) */
#define GPR_GPR70_FLEXSPI2_IPG_DOZE       (1 << 25) /* Bit 25:     FLEXSPI2 doze mode (FLEXSPI2_IPG_DOZE) */
#define GPR_GPR70_FLEXSPI2_STOP_REQ       (1 << 26) /* Bit 26:     FLEXSPI2 stop request (FLEXSPI2_STOP_REQ) */
                                                    /* Bit 27:     Reserved */
#define GPR_GPR70_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR70_DWP_MASK                (0x03 << GPR_GPR70_DWP_SHIFT)
#  define GPR_GPR70_DWP_ALLOWBOTH         (0x00 << GPR_GPR70_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR70_DWP_DENYCM7           (0x01 << GPR_GPR70_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR70_DWP_DENYCM4           (0x02 << GPR_GPR70_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR70_DWP_DENYBOTH          (0x03 << GPR_GPR70_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR70_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR70_DWP_LOCK_MASK           (0x03 << GPR_GPR70_DWP_LOCK_SHIFT)
#  define GPR_GPR70_DWP_LOCK_NOLCK        (0x00 << GPR_GPR70_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR70_DWP_LOCK_LCKLO        (0x01 << GPR_GPR70_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR70_DWP_LOCK_LCKHI        (0x02 << GPR_GPR70_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR70_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR70_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 71 (GPR71) */

#define GPR_GPR71_GPT1_IPG_DOZE           (1 << 0)  /* Bit 0:      GPT1 doze mode (GPT1_IPG_DOZE) */
#define GPR_GPR71_GPT2_IPG_DOZE           (1 << 1)  /* Bit 1:      GPT2 doze mode (GPT2_IPG_DOZE) */
#define GPR_GPR71_GPT3_IPG_DOZE           (1 << 2)  /* Bit 2:      GPT3 doze mode (GPT3_IPG_DOZE) */
#define GPR_GPR71_GPT4_IPG_DOZE           (1 << 3)  /* Bit 3:      GPT4 doze mode (GPT4_IPG_DOZE) */
#define GPR_GPR71_GPT5_IPG_DOZE           (1 << 4)  /* Bit 4:      GPT5 doze mode (GPT5_IPG_DOZE) */
#define GPR_GPR71_GPT6_IPG_DOZE           (1 << 5)  /* Bit 5:      GPT6 doze mode (GPT6_IPG_DOZE) */
#define GPR_GPR71_LPI2C1_IPG_DOZE         (1 << 6)  /* Bit 6:      LPI2C1 doze mode (LPI2C1_IPG_DOZE) */
#define GPR_GPR71_LPI2C1_STOP_REQ         (1 << 7)  /* Bit 7:      LPI2C1 stop request (LPI2C1_STOP_REQ) */
#define GPR_GPR71_LPI2C1_IPG_STOP_MODE    (1 << 8)  /* Bit 8:      LPI2C1 stop mode selection (LPI2C1_IPG_STOP_MODE) */
#define GPR_GPR71_LPI2C2_IPG_DOZE         (1 << 9)  /* Bit 9:      LPI2C2 doze mode (LPI2C2_IPG_DOZE) */
#define GPR_GPR71_LPI2C2_STOP_REQ         (1 << 10) /* Bit 10:     LPI2C2 stop request (LPI2C2_STOP_REQ) */
#define GPR_GPR71_LPI2C2_IPG_STOP_MODE    (1 << 11) /* Bit 11:     LPI2C2 stop mode selection (LPI2C2_IPG_STOP_MODE) */
#define GPR_GPR71_LPI2C3_IPG_DOZE         (1 << 12) /* Bit 12:     LPI2C3 doze mode (LPI2C3_IPG_DOZE) */
#define GPR_GPR71_LPI2C3_STOP_REQ         (1 << 13) /* Bit 13:     LPI2C3 stop request (LPI2C3_STOP_REQ) */
#define GPR_GPR71_LPI2C3_IPG_STOP_MODE    (1 << 14) /* Bit 14:     LPI2C3 stop mode selection (LPI2C3_IPG_STOP_MODE) */
#define GPR_GPR71_LPI2C4_IPG_DOZE         (1 << 15) /* Bit 15:     LPI2C4 doze mode (LPI2C4_IPG_DOZE) */
#define GPR_GPR71_LPI2C4_STOP_REQ         (1 << 16) /* Bit 16:     LPI2C4 stop request (LPI2C4_STOP_REQ) */
#define GPR_GPR71_LPI2C4_IPG_STOP_MODE    (1 << 17) /* Bit 17:     LPI2C4 stop mode selection (LPI2C4_IPG_STOP_MODE) */
#define GPR_GPR71_LPI2C5_IPG_DOZE         (1 << 18) /* Bit 18:     LPI2C5 doze mode (LPI2C5_IPG_DOZE) */
#define GPR_GPR71_LPI2C5_STOP_REQ         (1 << 19) /* Bit 19:     LPI2C5 stop request (LPI2C5_STOP_REQ) */
#define GPR_GPR71_LPI2C5_IPG_STOP_MODE    (1 << 20) /* Bit 20:     LPI2C5 stop mode selection (LPI2C5_IPG_STOP_MODE) */
#define GPR_GPR71_LPI2C6_IPG_DOZE         (1 << 21) /* Bit 21:     LPI2C6 doze mode (LPI2C6_IPG_DOZE) */
#define GPR_GPR71_LPI2C6_STOP_REQ         (1 << 22) /* Bit 22:     LPI2C6 stop request (LPI2C6_STOP_REQ) */
#define GPR_GPR71_LPI2C6_IPG_STOP_MODE    (1 << 23) /* Bit 23:     LPI2C6 stop mode selection (LPI2C6_IPG_STOP_MODE) */
#define GPR_GPR71_LPSPI1_IPG_DOZE         (1 << 24) /* Bit 24:     LPSPI1 doze mode (LPSPI1_IPG_DOZE) */
#define GPR_GPR71_LPSPI1_STOP_REQ         (1 << 25) /* Bit 25:     LPSPI1 stop request (LPSPI1_STOP_REQ) */
#define GPR_GPR71_LPSPI1_IPG_STOP_MODE    (1 << 26) /* Bit 26:     LPSPI1 stop mode selection (LPSPI1_IPG_STOP_MODE) */
                                                    /* Bit 27:     Reserved */
#define GPR_GPR71_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR71_DWP_MASK                (0x03 << GPR_GPR71_DWP_SHIFT)
#  define GPR_GPR71_DWP_ALLOWBOTH         (0x00 << GPR_GPR71_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR71_DWP_DENYCM7           (0x01 << GPR_GPR71_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR71_DWP_DENYCM4           (0x02 << GPR_GPR71_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR71_DWP_DENYBOTH          (0x03 << GPR_GPR71_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR71_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR71_DWP_LOCK_MASK           (0x03 << GPR_GPR71_DWP_LOCK_SHIFT)
#  define GPR_GPR71_DWP_LOCK_NOLCK        (0x00 << GPR_GPR71_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR71_DWP_LOCK_LCKLO        (0x01 << GPR_GPR71_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR71_DWP_LOCK_LCKHI        (0x02 << GPR_GPR71_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR71_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR71_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 72 (GPR72) */

