apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define GPR_GPR72_LPSPI2_IPG_DOZE         (1 << 0)  /* Bit 0:      LPSPI2 doze mode (LPSPI2_IPG_DOZE) */
#define GPR_GPR72_LPSPI2_STOP_REQ         (1 << 1)  /* Bit 1:      LPSPI2 stop request (LPSPI2_STOP_REQ) */
#define GPR_GPR72_LPSPI2_IPG_STOP_MODE    (1 << 2)  /* Bit 2:      LPSPI2 stop mode selection (LPSPI2_IPG_STOP_MODE) */
#define GPR_GPR72_LPSPI3_IPG_DOZE         (1 << 3)  /* Bit 3:      LPSPI3 doze mode (LPSPI3_IPG_DOZE) */
#define GPR_GPR72_LPSPI3_STOP_REQ         (1 << 4)  /* Bit 4:      LPSPI3 stop request (LPSPI3_STOP_REQ) */
#define GPR_GPR72_LPSPI3_IPG_STOP_MODE    (1 << 5)  /* Bit 5:      LPSPI3 stop mode selection (LPSPI3_IPG_STOP_MODE) */
#define GPR_GPR72_LPSPI4_IPG_DOZE         (1 << 6)  /* Bit 6:      LPSPI4 doze mode (LPSPI4_IPG_DOZE) */
#define GPR_GPR72_LPSPI4_STOP_REQ         (1 << 7)  /* Bit 7:      LPSPI4 stop request (LPSPI4_STOP_REQ) */
#define GPR_GPR72_LPSPI4_IPG_STOP_MODE    (1 << 8)  /* Bit 8:      LPSPI4 stop mode selection (LPSPI4_IPG_STOP_MODE) */
#define GPR_GPR72_LPSPI5_IPG_DOZE         (1 << 9)  /* Bit 9:      LPSPI5 doze mode (LPSPI5_IPG_DOZE) */
#define GPR_GPR72_LPSPI5_STOP_REQ         (1 << 10) /* Bit 10:     LPSPI5 stop request (LPSPI5_STOP_REQ) */
#define GPR_GPR72_LPSPI5_IPG_STOP_MODE    (1 << 11) /* Bit 11:     LPSPI5 stop mode selection (LPSPI5_IPG_STOP_MODE) */
#define GPR_GPR72_LPSPI6_IPG_DOZE         (1 << 12) /* Bit 12:     LPSPI6 doze mode (LPSPI6_IPG_DOZE) */
#define GPR_GPR72_LPSPI6_STOP_REQ         (1 << 13) /* Bit 13:     LPSPI6 stop request (LPSPI6_STOP_REQ) */
#define GPR_GPR72_LPSPI6_IPG_STOP_MODE    (1 << 14) /* Bit 14:     LPSPI6 stop mode selection (LPSPI6_IPG_STOP_MODE) */
#define GPR_GPR72_LPUART1_IPG_DOZE        (1 << 15) /* Bit 15:     LPUART1 doze mode (LPUART1_IPG_DOZE) */
#define GPR_GPR72_LPUART1_STOP_REQ        (1 << 16) /* Bit 16:     LPUART1 stop request (LPUART1_STOP_REQ) */
#define GPR_GPR72_LPUART1_IPG_STOP_MODE   (1 << 17) /* Bit 17:     LPUART1 stop mode selection (LPUART1_IPG_STOP_MODE) */
#define GPR_GPR72_LPUART2_IPG_DOZE        (1 << 18) /* Bit 18:     LPUART2 doze mode (LPUART2_IPG_DOZE) */
#define GPR_GPR72_LPUART2_STOP_REQ        (1 << 19) /* Bit 19:     LPUART2 stop request (LPUART2_STOP_REQ) */
#define GPR_GPR72_LPUART2_IPG_STOP_MODE   (1 << 20) /* Bit 20:     LPUART2 stop mode selection (LPUART2_IPG_STOP_MODE) */
#define GPR_GPR72_LPUART3_IPG_DOZE        (1 << 21) /* Bit 21:     LPUART3 doze mode (LPUART3_IPG_DOZE) */
#define GPR_GPR72_LPUART3_STOP_REQ        (1 << 22) /* Bit 22:     LPUART3 stop request (LPUART3_STOP_REQ) */
#define GPR_GPR72_LPUART3_IPG_STOP_MODE   (1 << 23) /* Bit 23:     LPUART3 stop mode selection (LPUART3_IPG_STOP_MODE) */
#define GPR_GPR72_LPUART4_IPG_DOZE        (1 << 24) /* Bit 24:     LPUART4 doze mode (LPUART4_IPG_DOZE) */
#define GPR_GPR72_LPUART4_STOP_REQ        (1 << 25) /* Bit 25:     LPUART4 stop request (LPUART4_STOP_REQ) */
#define GPR_GPR72_LPUART4_IPG_STOP_MODE   (1 << 26) /* Bit 26:     LPUART4 stop mode selection (LPUART4_IPG_STOP_MODE) */
                                                    /* Bit 27:     Reserved */
#define GPR_GPR72_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR72_DWP_MASK                (0x03 << GPR_GPR72_DWP_SHIFT)
#  define GPR_GPR72_DWP_ALLOWBOTH         (0x00 << GPR_GPR72_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR72_DWP_DENYCM7           (0x01 << GPR_GPR72_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR72_DWP_DENYCM4           (0x02 << GPR_GPR72_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR72_DWP_DENYBOTH          (0x03 << GPR_GPR72_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR72_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR72_DWP_LOCK_MASK           (0x03 << GPR_GPR72_DWP_LOCK_SHIFT)
#  define GPR_GPR72_DWP_LOCK_NOLCK        (0x00 << GPR_GPR72_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR72_DWP_LOCK_LCKLO        (0x01 << GPR_GPR72_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR72_DWP_LOCK_LCKHI        (0x02 << GPR_GPR72_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR72_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR72_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 73 (GPR73) */

#define GPR_GPR73_LPUART5_IPG_DOZE        (1 << 0)  /* Bit 0:      LPUART5 doze mode (LPUART5_IPG_DOZE) */
#define GPR_GPR73_LPUART5_STOP_REQ        (1 << 1)  /* Bit 1:      LPUART5 stop request (LPUART5_STOP_REQ) */
#define GPR_GPR73_LPUART5_IPG_STOP_MODE   (1 << 2)  /* Bit 2:      LPUART5 stop mode selection (LPUART5_IPG_STOP_MODE) */
#define GPR_GPR73_LPUART6_IPG_DOZE        (1 << 3)  /* Bit 3:      LPUART6 doze mode (LPUART6_IPG_DOZE) */
#define GPR_GPR73_LPUART6_STOP_REQ        (1 << 4)  /* Bit 4:      LPUART6 stop request (LPUART6_STOP_REQ) */
#define GPR_GPR73_LPUART6_IPG_STOP_MODE   (1 << 5)  /* Bit 5:      LPUART6 stop mode selection (LPUART6_IPG_STOP_MODE) */
#define GPR_GPR73_LPUART7_IPG_DOZE        (1 << 6)  /* Bit 6:      LPUART7 doze mode (LPUART7_IPG_DOZE) */
#define GPR_GPR73_LPUART7_STOP_REQ        (1 << 7)  /* Bit 7:      LPUART7 stop request (LPUART7_STOP_REQ) */
#define GPR_GPR73_LPUART7_IPG_STOP_MODE   (1 << 8)  /* Bit 8:      LPUART7 stop mode selection (LPUART7_IPG_STOP_MODE) */
#define GPR_GPR73_LPUART8_IPG_DOZE        (1 << 9)  /* Bit 9:      LPUART8 doze mode (LPUART8_IPG_DOZE) */
#define GPR_GPR73_LPUART8_STOP_REQ        (1 << 10) /* Bit 10:     LPUART8 stop request (LPUART8_STOP_REQ) */
#define GPR_GPR73_LPUART8_IPG_STOP_MODE   (1 << 11) /* Bit 11:     LPUART8 stop mode selection (LPUART8_IPG_STOP_MODE) */
#define GPR_GPR73_LPUART9_IPG_DOZE        (1 << 12) /* Bit 12:     LPUART9 doze mode (LPUART9_IPG_DOZE) */
#define GPR_GPR73_LPUART9_STOP_REQ        (1 << 13) /* Bit 13:     LPUART9 stop request (LPUART9_STOP_REQ) */
#define GPR_GPR73_LPUART9_IPG_STOP_MODE   (1 << 14) /* Bit 14:     LPUART9 stop mode selection (LPUART9_IPG_STOP_MODE) */
#define GPR_GPR73_LPUART10_IPG_DOZE       (1 << 15) /* Bit 15:     LPUART10 doze mode (LPUART10_IPG_DOZE) */
#define GPR_GPR73_LPUART10_STOP_REQ       (1 << 16) /* Bit 16:     LPUART10 stop request (LPUART10_STOP_REQ) */
#define GPR_GPR73_LPUART10_IPG_STOP_MODE  (1 << 17) /* Bit 17:     LPUART10 stop mode selection (LPUART10_IPG_STOP_MODE) */
#define GPR_GPR73_LPUART11_IPG_DOZE       (1 << 18) /* Bit 18:     LPUART11 doze mode (LPUART11_IPG_DOZE) */
#define GPR_GPR73_LPUART11_STOP_REQ       (1 << 19) /* Bit 19:     LPUART11 stop request (LPUART11_STOP_REQ) */
#define GPR_GPR73_LPUART11_IPG_STOP_MODE  (1 << 20) /* Bit 20:     LPUART11 stop mode selection (LPUART11_IPG_STOP_MODE) */
#define GPR_GPR73_LPUART12_IPG_DOZE       (1 << 21) /* Bit 21:     LPUART12 doze mode (LPUART12_IPG_DOZE) */
#define GPR_GPR73_LPUART12_STOP_REQ       (1 << 22) /* Bit 22:     LPUART12 stop request (LPUART12_STOP_REQ) */
#define GPR_GPR73_LPUART12_IPG_STOP_MODE  (1 << 23) /* Bit 23:     LPUART12 stop mode selection (LPUART12_IPG_STOP_MODE) */
#define GPR_GPR73_MIC_IPG_DOZE            (1 << 24) /* Bit 24:     MIC doze mode (MIC_IPG_DOZE) */
#define GPR_GPR73_MIC_STOP_REQ            (1 << 25) /* Bit 25:     MIC stop request (MIC_STOP_REQ) */
#define GPR_GPR73_MIC_IPG_STOP_MODE       (1 << 26) /* Bit 26:     MIC stop mode selection (MIC_IPG_STOP_MODE) */
                                                    /* Bit 27:     Reserved */
#define GPR_GPR73_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR73_DWP_MASK                (0x03 << GPR_GPR73_DWP_SHIFT)
#  define GPR_GPR73_DWP_ALLOWBOTH         (0x00 << GPR_GPR73_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR73_DWP_DENYCM7           (0x01 << GPR_GPR73_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR73_DWP_DENYCM4           (0x02 << GPR_GPR73_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR73_DWP_DENYBOTH          (0x03 << GPR_GPR73_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR73_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR73_DWP_LOCK_MASK           (0x03 << GPR_GPR73_DWP_LOCK_SHIFT)
#  define GPR_GPR73_DWP_LOCK_NOLCK        (0x00 << GPR_GPR73_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR73_DWP_LOCK_LCKLO        (0x01 << GPR_GPR73_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR73_DWP_LOCK_LCKHI        (0x02 << GPR_GPR73_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR73_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR73_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 74 (GPR74) */

