apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
                                                    /* Bit 0:      Reserved */
#define GPR_GPR74_PIT1_STOP_REQ           (1 << 1)  /* Bit 1:      PIT1 stop request (PIT1_STOP_REQ) */
#define GPR_GPR74_PIT2_STOP_REQ           (1 << 2)  /* Bit 2:      PIT2 stop request (PIT2_STOP_REQ) */
#define GPR_GPR74_SEMC_STOP_REQ           (1 << 3)  /* Bit 3:      SEMC stop request (SEMC_STOP_REQ) */
#define GPR_GPR74_SIM1_IPG_DOZE           (1 << 4)  /* Bit 4:      SIM1 doze mode (SIM1_IPG_DOZE) */
#define GPR_GPR74_SIM2_IPG_DOZE           (1 << 5)  /* Bit 5:      SIM2 doze mode (SIM2_IPG_DOZE) */
#define GPR_GPR74_SNVS_HP_IPG_DOZE        (1 << 6)  /* Bit 6:      SNVS_HP doze mode (SNVS_HP_IPG_DOZE) */
#define GPR_GPR74_SNVS_HP_STOP_REQ        (1 << 7)  /* Bit 7:      SNVS_HP stop request (SNVS_HP_STOP_REQ) */
#define GPR_GPR74_WDOG1_IPG_DOZE          (1 << 8)  /* Bit 8:      WDOG1 doze mode (WDOG1_IPG_DOZE) */
#define GPR_GPR74_WDOG2_IPG_DOZE          (1 << 9)  /* Bit 9:      WDOG2 doze mode (WDOG2_IPG_DOZE) */
#define GPR_GPR74_SAI1_STOP_REQ           (1 << 10) /* Bit 10:     SAI1 stop request (SAI1_STOP_REQ) */
#define GPR_GPR74_SAI2_STOP_REQ           (1 << 11) /* Bit 11:     SAI2 stop request (SAI2_STOP_REQ) */
#define GPR_GPR74_SAI3_STOP_REQ           (1 << 12) /* Bit 12:     SAI3 stop request (SAI3_STOP_REQ) */
#define GPR_GPR74_SAI4_STOP_REQ           (1 << 13) /* Bit 13:     SAI4 stop request (SAI4_STOP_REQ) */
#define GPR_GPR74_FLEXIO1_STOP_REQ_BUS    (1 << 14) /* Bit 14:     FLEXIO1 bus clock domain stop request (FLEXIO1_STOP_REQ_BUS) */
#define GPR_GPR74_FLEXIO1_STOP_REQ_PER    (1 << 15) /* Bit 15:     FLEXIO1 peripheral clock domain stop request (FLEXIO1_STOP_REQ_PER) */
#define GPR_GPR74_FLEXIO2_STOP_REQ_BUS    (1 << 16) /* Bit 16:     FLEXIO2 bus clock domain stop request (FLEXIO2_STOP_REQ_BUS) */
#define GPR_GPR74_FLEXIO2_STOP_REQ_PER    (1 << 17) /* Bit 17:     FLEXIO2 peripheral clock domain stop request (FLEXIO2_STOP_REQ_PER) */
                                                    /* Bits 18-27: Reserved */
#define GPR_GPR74_DWP_SHIFT               (28)      /* Bits 28-29: Domain write protection (DWP) */
#define GPR_GPR74_DWP_MASK                (0x03 << GPR_GPR74_DWP_SHIFT)
#  define GPR_GPR74_DWP_ALLOWBOTH         (0x00 << GPR_GPR74_DWP_SHIFT) /* Both cores are allowed */
#  define GPR_GPR74_DWP_DENYCM7           (0x01 << GPR_GPR74_DWP_SHIFT) /* CM7 is forbidden */
#  define GPR_GPR74_DWP_DENYCM4           (0x02 << GPR_GPR74_DWP_SHIFT) /* CM4 is forbidden */
#  define GPR_GPR74_DWP_DENYBOTH          (0x03 << GPR_GPR74_DWP_SHIFT) /* Both cores are forbidden */

#define GPR_GPR74_DWP_LOCK_SHIFT          (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define GPR_GPR74_DWP_LOCK_MASK           (0x03 << GPR_GPR74_DWP_LOCK_SHIFT)
#  define GPR_GPR74_DWP_LOCK_NOLCK        (0x00 << GPR_GPR74_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define GPR_GPR74_DWP_LOCK_LCKLO        (0x01 << GPR_GPR74_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define GPR_GPR74_DWP_LOCK_LCKHI        (0x02 << GPR_GPR74_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define GPR_GPR74_DWP_LOCK_LCKBOTH      (0x03 << GPR_GPR74_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* General Purpose Register 75 (GPR75) */

#define GPR_GPR75_ADC1_STOP_ACK           (1 << 0)  /* Bit 0:      ADC1 stop acknowledge (ADC1_STOP_ACK) */
#define GPR_GPR75_ADC2_STOP_ACK           (1 << 1)  /* Bit 1:      ADC2 stop acknowledge (ADC2_STOP_ACK) */
#define GPR_GPR75_CAAM_STOP_ACK           (1 << 2)  /* Bit 2:      CAAM stop acknowledge (CAAM_STOP_ACK) */
#define GPR_GPR75_CAN1_STOP_ACK           (1 << 3)  /* Bit 3:      CAN1 stop acknowledge (CAN1_STOP_ACK) */
#define GPR_GPR75_CAN2_STOP_ACK           (1 << 4)  /* Bit 4:      CAN2 stop acknowledge (CAN2_STOP_ACK) */
#define GPR_GPR75_CAN3_STOP_ACK           (1 << 5)  /* Bit 5:      CAN3 stop acknowledge (CAN3_STOP_ACK) */
#define GPR_GPR75_EDMA_STOP_ACK           (1 << 6)  /* Bit 6:      EDMA stop acknowledge (EDMA_STOP_ACK) */
#define GPR_GPR75_EDMA_LPSR_STOP_ACK      (1 << 7)  /* Bit 7:      EDMA_LPSR stop acknowledge (EDMA_LPSR_STOP_ACK) */
#define GPR_GPR75_ENET_STOP_ACK           (1 << 8)  /* Bit 8:      ENET stop acknowledge (ENET_STOP_ACK) */
#define GPR_GPR75_ENET1G_STOP_ACK         (1 << 9)  /* Bit 9:      ENET1G stop acknowledge (ENET1G_STOP_ACK) */
#define GPR_GPR75_FLEXSPI1_STOP_ACK       (1 << 10) /* Bit 10:     FLEXSPI1 stop acknowledge (FLEXSPI1_STOP_ACK) */
#define GPR_GPR75_FLEXSPI2_STOP_ACK       (1 << 11) /* Bit 11:     FLEXSPI2 stop acknowledge (FLEXSPI2_STOP_ACK) */
#define GPR_GPR75_LPI2C1_STOP_ACK         (1 << 12) /* Bit 12:     LPI2C1 stop acknowledge (LPI2C1_STOP_ACK) */
#define GPR_GPR75_LPI2C2_STOP_ACK         (1 << 13) /* Bit 13:     LPI2C2 stop acknowledge (LPI2C2_STOP_ACK) */
#define GPR_GPR75_LPI2C3_STOP_ACK         (1 << 14) /* Bit 14:     LPI2C3 stop acknowledge (LPI2C3_STOP_ACK) */
#define GPR_GPR75_LPI2C4_STOP_ACK         (1 << 15) /* Bit 15:     LPI2C4 stop acknowledge (LPI2C4_STOP_ACK) */
#define GPR_GPR75_LPI2C5_STOP_ACK         (1 << 16) /* Bit 16:     LPI2C5 stop acknowledge (LPI2C5_STOP_ACK) */
#define GPR_GPR75_LPI2C6_STOP_ACK         (1 << 17) /* Bit 17:     LPI2C6 stop acknowledge (LPI2C6_STOP_ACK) */
#define GPR_GPR75_LPSPI1_STOP_ACK         (1 << 18) /* Bit 18:     LPSPI1 stop acknowledge (LPSPI1_STOP_ACK) */
#define GPR_GPR75_LPSPI2_STOP_ACK         (1 << 19) /* Bit 19:     LPSPI2 stop acknowledge (LPSPI2_STOP_ACK) */
#define GPR_GPR75_LPSPI3_STOP_ACK         (1 << 20) /* Bit 20:     LPSPI3 stop acknowledge (LPSPI3_STOP_ACK) */
#define GPR_GPR75_LPSPI4_STOP_ACK         (1 << 21) /* Bit 21:     LPSPI4 stop acknowledge (LPSPI4_STOP_ACK) */
#define GPR_GPR75_LPSPI5_STOP_ACK         (1 << 22) /* Bit 22:     LPSPI5 stop acknowledge (LPSPI5_STOP_ACK) */
#define GPR_GPR75_LPSPI6_STOP_ACK         (1 << 23) /* Bit 23:     LPSPI6 stop acknowledge (LPSPI6_STOP_ACK) */
#define GPR_GPR75_LPUART1_STOP_ACK        (1 << 24) /* Bit 24:     LPUART1 stop acknowledge (LPUART1_STOP_ACK) */
#define GPR_GPR75_LPUART2_STOP_ACK        (1 << 25) /* Bit 25:     LPUART2 stop acknowledge (LPUART2_STOP_ACK) */
#define GPR_GPR75_LPUART3_STOP_ACK        (1 << 26) /* Bit 26:     LPUART3 stop acknowledge (LPUART3_STOP_ACK) */
#define GPR_GPR75_LPUART4_STOP_ACK        (1 << 27) /* Bit 27:     LPUART4 stop acknowledge (LPUART4_STOP_ACK) */
#define GPR_GPR75_LPUART5_STOP_ACK        (1 << 28) /* Bit 28:     LPUART5 stop acknowledge (LPUART5_STOP_ACK) */
#define GPR_GPR75_LPUART6_STOP_ACK        (1 << 29) /* Bit 29:     LPUART6 stop acknowledge (LPUART6_STOP_ACK) */
#define GPR_GPR75_LPUART7_STOP_ACK        (1 << 30) /* Bit 30:     LPUART7 stop acknowledge (LPUART7_STOP_ACK) */
#define GPR_GPR75_LPUART8_STOP_ACK        (1 << 31) /* Bit 31:     LPUART8 stop acknowledge (LPUART8_STOP_ACK) */

