apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
/* General Purpose Register 76 (GPR76) */

#define GPR_GPR76_LPUART9_STOP_ACK        (1 << 0)  /* Bit 0:      LPUART9 stop acknowledge (LPUART9_STOP_ACK) */
#define GPR_GPR76_LPUART10_STOP_ACK       (1 << 1)  /* Bit 1:      LPUART10 stop acknowledge (LPUART10_STOP_ACK) */
#define GPR_GPR76_LPUART11_STOP_ACK       (1 << 2)  /* Bit 2:      LPUART11 stop acknowledge (LPUART11_STOP_ACK) */
#define GPR_GPR76_LPUART12_STOP_ACK       (1 << 3)  /* Bit 3:      LPUART12 stop acknowledge (LPUART12_STOP_ACK) */
#define GPR_GPR76_MIC_STOP_ACK            (1 << 4)  /* Bit 4:      MIC stop acknowledge (MIC_STOP_ACK) */
#define GPR_GPR76_PIT1_STOP_ACK           (1 << 5)  /* Bit 5:      PIT1 stop acknowledge (PIT1_STOP_ACK) */
#define GPR_GPR76_PIT2_STOP_ACK           (1 << 6)  /* Bit 6:      PIT2 stop acknowledge (PIT2_STOP_ACK) */
#define GPR_GPR76_SEMC_STOP_ACK           (1 << 7)  /* Bit 7:      SEMC stop acknowledge (SEMC_STOP_ACK) */
#define GPR_GPR76_SNVS_HP_STOP_ACK        (1 << 8)  /* Bit 8:      SNVS_HP stop acknowledge (SNVS_HP_STOP_ACK) */
#define GPR_GPR76_SAI1_STOP_ACK           (1 << 9)  /* Bit 9:      SAI1 stop acknowledge (SAI1_STOP_ACK) */
#define GPR_GPR76_SAI2_STOP_ACK           (1 << 10) /* Bit 10:     SAI2 stop acknowledge (SAI2_STOP_ACK) */
#define GPR_GPR76_SAI3_STOP_ACK           (1 << 11) /* Bit 11:     SAI3 stop acknowledge (SAI3_STOP_ACK) */
#define GPR_GPR76_SAI4_STOP_ACK           (1 << 12) /* Bit 12:     SAI4 stop acknowledge (SAI4_STOP_ACK) */
#define GPR_GPR76_FLEXIO1_STOP_ACK_BUS    (1 << 13) /* Bit 13:     FLEXIO1 stop acknowledge of bus clock domain (FLEXIO1_STOP_ACK_BUS) */
#define GPR_GPR76_FLEXIO1_STOP_ACK_PER    (1 << 14) /* Bit 14:     FLEXIO1 stop acknowledge of peripheral clock domain (FLEXIO1_STOP_ACK_PER) */
#define GPR_GPR76_FLEXIO2_STOP_ACK_BUS    (1 << 15) /* Bit 15:     FLEXIO2 stop acknowledge of bus clock domain (FLEXIO2_STOP_ACK_BUS) */
#define GPR_GPR76_FLEXIO2_STOP_ACK_PER    (1 << 16) /* Bit 16:     FLEXIO2 stop acknowledge of peripheral clock domain (FLEXIO2_STOP_ACK_PER) */
                                                    /* Bits 17-31: Reserved */

/* LPSR General Purpose Register 26 (LPSR_GPR26) */

#define LPSR_GPR_GPR26_CM7_INIT_VTOR_SHIFT (0)      /* Bits 0-24:  Vector table offset register out of reset (CM7_INIT_VTOR) */
#define LPSR_GPR_GPR26_CM7_INIT_VTOR_MASK  (0xffffff << LPSR_GPR_GPR26_CM7_INIT_VTOR_SHIFT)

#define LPSR_GPR_GPR26_FIELD_0_SHIFT      (25)      /* Bits 25-27: General purpose bits (FIELD_0) */
#define LPSR_GPR_GPR26_FIELD_0_MASK       (0x07 << LPSR_GPR_GPR26_FIELD_0_SHIFT)
#define LPSR_GPR_GPR26_DWP_SHIFT          (28)      /* Bits 28-29: Domain write protection (DWP) */
#define LPSR_GPR_GPR26_DWP_MASK           (0x03 << LPSR_GPR_GPR26_DWP_SHIFT)
#  define LPSR_GPR_GPR26_DWP_ALLOWBOTH    (0x00 << LPSR_GPR_GPR26_DWP_SHIFT) /* Both cores are allowed */
#  define LPSR_GPR_GPR26_DWP_DENYCM7      (0x01 << LPSR_GPR_GPR26_DWP_SHIFT) /* CM7 is forbidden */
#  define LPSR_GPR_GPR26_DWP_DENYCM4      (0x02 << LPSR_GPR_GPR26_DWP_SHIFT) /* CM4 is forbidden */
#  define LPSR_GPR_GPR26_DWP_DENYBOTH     (0x03 << LPSR_GPR_GPR26_DWP_SHIFT) /* Both cores are forbidden */

#define LPSR_GPR_GPR26_DWP_LOCK_SHIFT     (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define LPSR_GPR_GPR26_DWP_LOCK_MASK      (0x03 << LPSR_GPR_GPR26_DWP_LOCK_SHIFT)
#  define LPSR_GPR_GPR26_DWP_LOCK_NOLCK   (0x00 << LPSR_GPR_GPR26_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define LPSR_GPR_GPR26_DWP_LOCK_LCKLO   (0x01 << LPSR_GPR_GPR26_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define LPSR_GPR_GPR26_DWP_LOCK_LCKHI   (0x02 << LPSR_GPR_GPR26_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define LPSR_GPR_GPR26_DWP_LOCK_LCKBOTH (0x03 << LPSR_GPR_GPR26_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* LPSR General Purpose Register 33 (LPSR_GPR33) */

#define LPSR_GPR_GPR33_M4_NMI_CLEAR       (1 << 0)  /* Bit 0:      Clear CM4 NMI holding register (M4_NMI_CLEAR) */
                                                    /* Bits 1-7:   Reserved */

#define LPSR_GPR_GPR33_USBPHY1_WAKEUP_IRQ_CLEAR (1 << 8) /* Bit 8: Clear USBPHY1 wakeup interrupt holding register (USBPHY1_WAKEUP_IRQ_CLEAR) */
#define LPSR_GPR_GPR33_USBPHY2_WAKEUP_IRQ_CLEAR (1 << 9) /* Bit 9: Clear USBPHY2 wakeup interrupt holding register (USBPHY2_WAKEUP_IRQ_CLEAR) */

                                                    /* Bits 10-15: Reserved */

                                                    /* Bits 16-27: Reserved */

#define LPSR_GPR_GPR33_DWP_SHIFT          (28)      /* Bits 28-29: Domain write protection (DWP) */
#define LPSR_GPR_GPR33_DWP_MASK           (0x03 << LPSR_GPR_GPR33_DWP_SHIFT)
#  define LPSR_GPR_GPR33_DWP_ALLOWBOTH    (0x00 << LPSR_GPR_GPR33_DWP_SHIFT) /* Both cores are allowed */
#  define LPSR_GPR_GPR33_DWP_DENYCM7      (0x01 << LPSR_GPR_GPR33_DWP_SHIFT) /* CM7 is forbidden */
#  define LPSR_GPR_GPR33_DWP_DENYCM4      (0x02 << LPSR_GPR_GPR33_DWP_SHIFT) /* CM4 is forbidden */
#  define LPSR_GPR_GPR33_DWP_DENYBOTH     (0x03 << LPSR_GPR_GPR33_DWP_SHIFT) /* Both cores are forbidden */

#define LPSR_GPR_GPR33_DWP_LOCK_SHIFT     (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define LPSR_GPR_GPR33_DWP_LOCK_MASK      (0x03 << LPSR_GPR_GPR33_DWP_LOCK_SHIFT)
#  define LPSR_GPR_GPR33_DWP_LOCK_NOLCK   (0x00 << LPSR_GPR_GPR33_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define LPSR_GPR_GPR33_DWP_LOCK_LCKLO   (0x01 << LPSR_GPR_GPR33_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define LPSR_GPR_GPR33_DWP_LOCK_LCKHI   (0x02 << LPSR_GPR_GPR33_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define LPSR_GPR_GPR33_DWP_LOCK_LCKBOTH (0x03 << LPSR_GPR_GPR33_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* LPSR General Purpose Register 34 (LPSR_GPR34) */

                                                    /* Bit 0:      Reserved */

#define LPSR_GPR_GPR34_GPIO_LPSR_HIGH_RANGE (1 << 1) /* Bit 1:     GPIO_LPSR IO bank supply voltage range selection (GPIO_LPSR_HIGH_RANGE) */
#define LPSR_GPR_GPR34_GPIO_LPSR_LOW_RANGE  (1 << 2) /* Bit 2:     GPIO_LPSR IO bank supply voltage range selection (GPIO_LPSR_LOW_RANGE) */

#define LPSR_GPR_GPR34_M7_NMI_MASK        (1 << 3)  /* Bit 3:      Mask CM7 NMI pin input (M7_NMI_MASK) */
#define LPSR_GPR_GPR34_M4_NMI_MASK        (1 << 4)  /* Bit 4:      Mask CM4 NMI pin input (M4_NMI_MASK) */
#define LPSR_GPR_GPR34_M4_GPC_SLEEP_SEL   (1 << 5)  /* Bit 5:      CM4 sleep request selection (M4_GPC_SLEEP_SEL) */

                                                    /* Bits 6-8:   Reserved */

