apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
#define LPSR_GPR_GPR36_LPI2C1_IPG_STOP_MODE (1 << 8)  /* Bit 8:    LPI2C1 stop mode selection (LPI2C1_IPG_STOP_MODE) */

#define LPSR_GPR_GPR36_LPI2C2_IPG_DOZE    (1 << 9)  /* Bit 9:      LPI2C2 doze mode (LPI2C2_IPG_DOZE) */
#define LPSR_GPR_GPR36_LPI2C2_STOP_REQ    (1 << 10) /* Bit 10:     LPI2C2 stop request (LPI2C2_STOP_REQ) */

#define LPSR_GPR_GPR36_LPI2C2_IPG_STOP_MODE (1 << 11) /* Bit 11:   LPI2C2 stop mode selection (LPI2C2_IPG_STOP_MODE) */

#define LPSR_GPR_GPR36_LPI2C3_IPG_DOZE    (1 << 12) /* Bit 12:     LPI2C3 doze mode (LPI2C3_IPG_DOZE) */
#define LPSR_GPR_GPR36_LPI2C3_STOP_REQ    (1 << 13) /* Bit 13:     LPI2C3 stop request (LPI2C3_STOP_REQ) */

#define LPSR_GPR_GPR36_LPI2C3_IPG_STOP_MODE (1 << 14) /* Bit 14:   LPI2C3 stop mode selection (LPI2C3_IPG_STOP_MODE) */

#define LPSR_GPR_GPR36_LPI2C4_IPG_DOZE    (1 << 15) /* Bit 15:     LPI2C4 doze mode (LPI2C4_IPG_DOZE) */
#define LPSR_GPR_GPR36_LPI2C4_STOP_REQ    (1 << 16) /* Bit 16:     LPI2C4 stop request (LPI2C4_STOP_REQ) */

#define LPSR_GPR_GPR36_LPI2C4_IPG_STOP_MODE (1 << 17) /* Bit 17:   LPI2C4 stop mode selection (LPI2C4_IPG_STOP_MODE) */

#define LPSR_GPR_GPR36_LPI2C5_IPG_DOZE    (1 << 18) /* Bit 18:     LPI2C5 doze mode (LPI2C5_IPG_DOZE) */
#define LPSR_GPR_GPR36_LPI2C5_STOP_REQ    (1 << 19) /* Bit 19:     LPI2C5 stop request (LPI2C5_STOP_REQ) */

#define LPSR_GPR_GPR36_LPI2C5_IPG_STOP_MODE (1 << 20) /* Bit 20:   LPI2C5 stop mode selection (LPI2C5_IPG_STOP_MODE) */

#define LPSR_GPR_GPR36_LPI2C6_IPG_DOZE    (1 << 21) /* Bit 21:     LPI2C6 doze mode (LPI2C6_IPG_DOZE) */
#define LPSR_GPR_GPR36_LPI2C6_STOP_REQ    (1 << 22) /* Bit 22:     LPI2C6 stop request (LPI2C6_STOP_REQ) */

#define LPSR_GPR_GPR36_LPI2C6_IPG_STOP_MODE (1 << 23) /* Bit 23:   LPI2C6 stop mode selection (LPI2C6_IPG_STOP_MODE) */

#define LPSR_GPR_GPR36_LPSPI1_IPG_DOZE    (1 << 24) /* Bit 24:     LPSPI1 doze mode (LPSPI1_IPG_DOZE) */
#define LPSR_GPR_GPR36_LPSPI1_STOP_REQ    (1 << 25) /* Bit 25:     LPSPI1 stop request (LPSPI1_STOP_REQ) */

#define LPSR_GPR_GPR36_LPSPI1_IPG_STOP_MODE (1 << 26) /* Bit 26:   LPSPI1 stop mode selection (LPSPI1_IPG_STOP_MODE) */

                                                    /* Bit 27:     Reserved */
#define LPSR_GPR_GPR36_DWP_SHIFT          (28)      /* Bits 28-29: Domain write protection (DWP) */
#define LPSR_GPR_GPR36_DWP_MASK           (0x03 << LPSR_GPR_GPR36_DWP_SHIFT)
#  define LPSR_GPR_GPR36_DWP_ALLOWBOTH    (0x00 << LPSR_GPR_GPR36_DWP_SHIFT) /* Both cores are allowed */
#  define LPSR_GPR_GPR36_DWP_DENYCM7      (0x01 << LPSR_GPR_GPR36_DWP_SHIFT) /* CM7 is forbidden */
#  define LPSR_GPR_GPR36_DWP_DENYCM4      (0x02 << LPSR_GPR_GPR36_DWP_SHIFT) /* CM4 is forbidden */
#  define LPSR_GPR_GPR36_DWP_DENYBOTH     (0x03 << LPSR_GPR_GPR36_DWP_SHIFT) /* Both cores are forbidden */

#define LPSR_GPR_GPR36_DWP_LOCK_SHIFT     (30)      /* Bits 30-31: Domain write protection lock (DWP_LOCK) */
#define LPSR_GPR_GPR36_DWP_LOCK_MASK      (0x03 << LPSR_GPR_GPR36_DWP_LOCK_SHIFT)
#  define LPSR_GPR_GPR36_DWP_LOCK_NOLCK   (0x00 << LPSR_GPR_GPR36_DWP_LOCK_SHIFT) /* Neither of DWP bits is locked */
#  define LPSR_GPR_GPR36_DWP_LOCK_LCKLO   (0x01 << LPSR_GPR_GPR36_DWP_LOCK_SHIFT) /* Lower DWP bit is locked */
#  define LPSR_GPR_GPR36_DWP_LOCK_LCKHI   (0x02 << LPSR_GPR_GPR36_DWP_LOCK_SHIFT) /* Higher DWP bit is locked */
#  define LPSR_GPR_GPR36_DWP_LOCK_LCKBOTH (0x03 << LPSR_GPR_GPR36_DWP_LOCK_SHIFT) /* Both DWP bits are locked */

/* LPSR General Purpose Register 37 (LPSR_GPR37) */

#define LPSR_GPR_GPR37_LPSPI2_IPG_DOZE    (1 << 0)  /* Bit 0:      LPSPI2 doze mode (LPSPI2_IPG_DOZE) */
#define LPSR_GPR_GPR37_LPSPI2_STOP_REQ    (1 << 1)  /* Bit 1:      LPSPI2 stop request (LPSPI2_STOP_REQ) */

#define LPSR_GPR_GPR37_LPSPI2_IPG_STOP_MODE (1 << 2)  /* Bit 2:    LPSPI2 stop mode selection (LPSPI2_IPG_STOP_MODE) */

#define LPSR_GPR_GPR37_LPSPI3_IPG_DOZE    (1 << 3)  /* Bit 3:      LPSPI3 doze mode (LPSPI3_IPG_DOZE) */
#define LPSR_GPR_GPR37_LPSPI3_STOP_REQ    (1 << 4)  /* Bit 4:      LPSPI3 stop request (LPSPI3_STOP_REQ) */

#define LPSR_GPR_GPR37_LPSPI3_IPG_STOP_MODE (1 << 5)  /* Bit 5:    LPSPI3 stop mode selection (LPSPI3_IPG_STOP_MODE) */

#define LPSR_GPR_GPR37_LPSPI4_IPG_DOZE    (1 << 6)  /* Bit 6:      LPSPI4 doze mode (LPSPI4_IPG_DOZE) */
#define LPSR_GPR_GPR37_LPSPI4_STOP_REQ    (1 << 7)  /* Bit 7:      LPSPI4 stop request (LPSPI4_STOP_REQ) */

#define LPSR_GPR_GPR37_LPSPI4_IPG_STOP_MODE (1 << 8)  /* Bit 8:    LPSPI4 stop mode selection (LPSPI4_IPG_STOP_MODE) */

#define LPSR_GPR_GPR37_LPSPI5_IPG_DOZE    (1 << 9)  /* Bit 9:      LPSPI5 doze mode (LPSPI5_IPG_DOZE) */
#define LPSR_GPR_GPR37_LPSPI5_STOP_REQ    (1 << 10) /* Bit 10:     LPSPI5 stop request (LPSPI5_STOP_REQ) */

#define LPSR_GPR_GPR37_LPSPI5_IPG_STOP_MODE (1 << 11) /* Bit 11:   LPSPI5 stop mode selection (LPSPI5_IPG_STOP_MODE) */

#define LPSR_GPR_GPR37_LPSPI6_IPG_DOZE    (1 << 12) /* Bit 12:     LPSPI6 doze mode (LPSPI6_IPG_DOZE) */
#define LPSR_GPR_GPR37_LPSPI6_STOP_REQ    (1 << 13) /* Bit 13:     LPSPI6 stop request (LPSPI6_STOP_REQ) */

#define LPSR_GPR_GPR37_LPSPI6_IPG_STOP_MODE (1 << 14) /* Bit 14:   LPSPI6 stop mode selection (LPSPI6_IPG_STOP_MODE) */

#define LPSR_GPR_GPR37_LPUART1_IPG_DOZE   (1 << 15) /* Bit 15:     LPUART1 doze mode (LPUART1_IPG_DOZE) */
#define LPSR_GPR_GPR37_LPUART1_STOP_REQ   (1 << 16) /* Bit 16:     LPUART1 stop request (LPUART1_STOP_REQ) */

#define LPSR_GPR_GPR37_LPUART1_IPG_STOP_MODE (1 << 17) /* Bit 17:  LPUART1 stop mode selection (LPUART1_IPG_STOP_MODE) */

#define LPSR_GPR_GPR37_LPUART2_IPG_DOZE   (1 << 18) /* Bit 18:     LPUART2 doze mode (LPUART2_IPG_DOZE) */
#define LPSR_GPR_GPR37_LPUART2_STOP_REQ   (1 << 19) /* Bit 19:     LPUART2 stop request (LPUART2_STOP_REQ) */

#define LPSR_GPR_GPR37_LPUART2_IPG_STOP_MODE (1 << 20) /* Bit 20:  LPUART2 stop mode selection (LPUART2_IPG_STOP_MODE) */

#define LPSR_GPR_GPR37_LPUART3_IPG_DOZE   (1 << 21) /* Bit 21:     LPUART3 doze mode (LPUART3_IPG_DOZE) */
#define LPSR_GPR_GPR37_LPUART3_STOP_REQ   (1 << 22) /* Bit 22:     LPUART3 stop request (LPUART3_STOP_REQ) */

