apache/nuttx/arch/arm/src/imxrt/hardware/rt117x/imxrt117x_iomuxc.h
/* LPSR General Purpose Register 41 (LPSR_GPR41) */

#define LPSR_GPR_GPR41_LPUART9_STOP_ACK   (1 << 0)  /* Bit 0:      LPUART9 stop acknowledge (LPUART9_STOP_ACK) */
#define LPSR_GPR_GPR41_LPUART10_STOP_ACK  (1 << 1)  /* Bit 1:      LPUART10 stop acknowledge (LPUART10_STOP_ACK) */
#define LPSR_GPR_GPR41_LPUART11_STOP_ACK  (1 << 2)  /* Bit 2:      LPUART11 stop acknowledge (LPUART11_STOP_ACK) */
#define LPSR_GPR_GPR41_LPUART12_STOP_ACK  (1 << 3)  /* Bit 3:      LPUART12 stop acknowledge (LPUART12_STOP_ACK) */
#define LPSR_GPR_GPR41_MIC_STOP_ACK       (1 << 4)  /* Bit 4:      MIC stop acknowledge (MIC_STOP_ACK) */
#define LPSR_GPR_GPR41_PIT1_STOP_ACK      (1 << 5)  /* Bit 5:      PIT1 stop acknowledge (PIT1_STOP_ACK) */
#define LPSR_GPR_GPR41_PIT2_STOP_ACK      (1 << 6)  /* Bit 6:      PIT2 stop acknowledge (PIT2_STOP_ACK) */
#define LPSR_GPR_GPR41_SEMC_STOP_ACK      (1 << 7)  /* Bit 7:      SEMC stop acknowledge (SEMC_STOP_ACK) */
#define LPSR_GPR_GPR41_SNVS_HP_STOP_ACK   (1 << 8)  /* Bit 8:      SNVS_HP stop acknowledge (SNVS_HP_STOP_ACK) */
#define LPSR_GPR_GPR41_SAI1_STOP_ACK      (1 << 9)  /* Bit 9:      SAI1 stop acknowledge (SAI1_STOP_ACK) */
#define LPSR_GPR_GPR41_SAI2_STOP_ACK      (1 << 10) /* Bit 10:     SAI2 stop acknowledge (SAI2_STOP_ACK) */
#define LPSR_GPR_GPR41_SAI3_STOP_ACK      (1 << 11) /* Bit 11:     SAI3 stop acknowledge (SAI3_STOP_ACK) */
#define LPSR_GPR_GPR41_SAI4_STOP_ACK      (1 << 12) /* Bit 12:     SAI4 stop acknowledge (SAI4_STOP_ACK) */

#define LPSR_GPR_GPR41_FLEXIO1_STOP_ACK_BUS (1 << 13) /* Bit 13:   FLEXIO1 stop acknowledge of bus clock domain (FLEXIO1_STOP_ACK_BUS) */
#define LPSR_GPR_GPR41_FLEXIO1_STOP_ACK_PER (1 << 14) /* Bit 14:   FLEXIO1 stop acknowledge of peripheral clock domain (FLEXIO1_STOP_ACK_PER) */
#define LPSR_GPR_GPR41_FLEXIO2_STOP_ACK_BUS (1 << 15) /* Bit 15:   FLEXIO2 stop acknowledge of bus clock domain (FLEXIO2_STOP_ACK_BUS) */
#define LPSR_GPR_GPR41_FLEXIO2_STOP_ACK_PER (1 << 16) /* Bit 16:   FLEXIO2 stop acknowledge of peripheral clock domain (FLEXIO2_STOP_ACK_PER) */

                                                    /* Bits 17-31: Reserved */

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_RT117X_IMXRT117X_IOMUXC_H */
